{
  "backend/main.mo": "Empty Motoko actor serving as the backend canister placeholder with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report listing implemented features with associated files, components, test IDs, and confidence levels, covering live trading toggle fixes, order execution flow, and useEffect/React Query audits.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short summaries describing each file's purpose and key exports across the React application.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes including colors for background, foreground, primary, sidebar, and chart tokens.",
  "frontend/index.html": "HTML entry point for the Crypto Position Monitor app, configuring PWA manifest, theme color, favicon, Apple touch icon, and mounting the React root div.",
  "frontend/public/manifest.json": "PWA manifest for Crypto Position Monitor defining app name, icons, display mode, theme/background colors, categories, and an 'Add Position' shortcut.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first for static assets, network-first for HTML and Binance API calls, with install/activate lifecycle handlers for cache versioning and cleanup.",
  "frontend/src/App.tsx": "Root React component composing the full app layout with header, live trading banner, tab navigation, settings dialog, and position storage/monitoring hooks.",
  "frontend/src/components/AdjustmentSuggestionCard.tsx": "Alert-style card that presents a stop-loss or take-profit adjustment suggestion with accept/dismiss actions and confidence display.",
  "frontend/src/components/AIDailyTradesSection.tsx": "Collapsible section component that displays AI-generated daily trades using generation, monitoring, and storage hooks, with loading skeletons and a force-refresh button.",
  "frontend/src/components/AIDailyTradesSummary.tsx": "Summary panel showing aggregated AI portfolio PnL, win/loss counts, and reversal guard activations for the current UTC day.",
  "frontend/src/components/AIDailyTradesTab.tsx": "Tab layout component that composes AIDailyTradesSection and PerformanceComparisonPanel into a single view.",
  "frontend/src/components/AIInsightsTab.tsx": "Tab that renders per-position AI insights including sentiment gauges, trend predictions, and dismissible adjustment suggestions for a list of positions.",
  "frontend/src/components/AITradeCard.tsx": "Card component that displays a single AI trade's details including modality, PnL, TP progress bars, risk management step tracker, and status badges.",
  "frontend/src/components/BinanceCredentialsPanel.tsx": "Form panel for entering, saving, clearing, and testing Binance API credentials stored locally in the browser's localStorage.",
  "frontend/src/components/CredentialStatusIndicator.tsx": "A memoized React button component that displays Binance API credential validity and live trading status using icons, listening to credential/live trading change events.",
  "frontend/src/components/DashboardTab.tsx": "A layout component for the main dashboard tab that composes TotalCapitalSummary, PositionEntryForm, and PositionDashboard with position data and CRUD handlers.",
  "frontend/src/components/ExposureChart.tsx": "Renders two cards showing asset allocation and long/short balance as labeled progress bars based on exposure and capital data.",
  "frontend/src/components/InstallButton.tsx": "A PWA install button that triggers the native install prompt if available, or shows a manual install instructions modal; hidden when the app is already installed.",
  "frontend/src/components/InstallInstructionsModal.tsx": "A dialog modal displaying step-by-step PWA installation instructions for multiple browsers (Chrome, Safari, Edge, Firefox) with icons and per-browser guides.",
  "frontend/src/components/LiveTradingBanner.tsx": "A memoized banner component that displays a prominent warning strip when live trading mode is active, listening to live trading and credential change events.",
  "frontend/src/components/LiveTradingToggle.tsx": "A toggle switch component for enabling/disabling live trading mode, with credential validation, a confirmation dialog before enabling, and toast notifications for state changes.",
  "frontend/src/components/PerformanceComparisonPanel.tsx": "Displays a side-by-side performance comparison panel between AI-generated trades and user trades, showing metrics like win rate and PnL calculated from trade history storage.",
  "frontend/src/components/PortfolioExposureDashboard.tsx": "Displays a portfolio exposure dashboard card showing deployed capital, total leverage exposure, capital at risk, and warnings based on optional total capital input. Includes charts and percentage breakdowns relative to the user's total capital.",
  "frontend/src/components/PositionCard.tsx": "Renders an individual trading position card with PnL, take-profit/stop-loss indicators, AI insights (sentiment, trend prediction, adjustment suggestions), and a trade outcome modal triggered on deletion.",
  "frontend/src/components/PositionDashboard.tsx": "Displays the list of active trading positions using real-time price data via usePositionMonitoring, showing an empty state with an add button when no positions exist.",
  "frontend/src/components/PositionEntryForm.tsx": "Form component for creating a new trading position by selecting a Binance pair, entering price and investment details, then auto-calculating take-profit and stop-loss levels using historical kline data.",
  "frontend/src/components/PositionSizeCalculator.tsx": "Interactive calculator that computes recommended position size based on capital, risk percentage, entry price, stop-loss price, and leverage, with an optional apply callback to pass results to a parent form.",
  "frontend/src/components/RiskManagementTab.tsx": "Composes the risk management tab by rendering the PositionSizeCalculator, PortfolioExposureDashboard (or a placeholder when no positions exist), and ScenarioSimulator components.",
  "frontend/src/components/ScenarioSimulator.tsx": "A card component that lets users simulate portfolio impact by adjusting price changes via preset buttons or a custom slider, displaying P&L results and liquidation risk warnings relative to total capital.",
  "frontend/src/components/SentimentGauge.tsx": "Displays market sentiment (bullish/bearish/neutral) for a given symbol using a badge, strength progress bar, and a list of contributing indicator factors fetched via the useSentimentAnalysis hook.",
  "frontend/src/components/SettingsDialog.tsx": "A modal dialog for app settings that contains sections for Binance API credentials (BinanceCredentialsPanel) and trading mode selection (LiveTradingToggle).",
  "frontend/src/components/StopLossRecommendations.tsx": "Renders a stop-loss card showing price, distance from current price, max loss in USD/percent, capital risk, reasoning, and a partial-taking strategy alert, with visual warnings when price is near the stop level.",
  "frontend/src/components/TabNavigation.tsx": "A sticky top navigation bar with four tabs (Dashboard, AI Daily Trades, AI Insights, Risk Management) that highlights the active tab and calls a callback on tab change.",
  "frontend/src/components/TakeProfitRecommendations.tsx": "Renders a list of take-profit level cards, each showing target price, distance from current price, expected profit in USD/percent, and reasoning, with visual highlighting when a level has been reached.",
  "frontend/src/components/TotalCapitalInput.tsx": "A card with a number input that allows users to save their total trading capital to local storage, used for portfolio-wide risk percentage calculations, with validation and success feedback.",
  "frontend/src/components/TotalCapitalSummary.tsx": "Displays a capital overview card showing total, deployed, available, and at-risk capital percentages calculated from positions. Includes a dialog to set or edit the total trading capital value.",
  "frontend/src/components/TradeOutcomeModal.tsx": "Modal dialog for closing a position by recording its trade outcome (TP hit, SL hit, or manually closed) and exit price, then computing and saving PnL to trade history.",
  "frontend/src/components/TrendPredictionCard.tsx": "Renders a card showing AI-generated short-term and medium-term trend predictions (direction and confidence) for a given trading symbol.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an ICP backend actor using the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAdjustmentSuggestions.ts": "React Query hook that fetches hourly Binance kline data for each position and generates position adjustment suggestions, refreshing every 30 seconds.",
  "frontend/src/hooks/useAITradeGeneration.ts": "React Query hook that generates or retrieves daily AI trades for four trading modalities, using stored trades when fresh and regenerating when the UTC date changes.",
  "frontend/src/hooks/useAITradeMonitoring.ts": "React Query hook that polls live prices for AI trades and updates their execution state (TP/SL hits, stop-loss adjustments, reversal detection) storing changes to localStorage.",
  "frontend/src/hooks/useAITradeStorage.ts": "Utility hook providing localStorage read/write/clear operations for daily AI trades, with date-based invalidation and backward-compatible default field values.",
  "frontend/src/hooks/useBinancePairs.ts": "React Query hook that fetches and caches the list of Binance perpetual trading pairs, refreshing every hour.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication via DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useLiveTradingMode.ts": "Manages live trading mode state by reading/writing to localStorage, validating Binance credentials before enabling, and listening for storage change events.",
  "frontend/src/hooks/usePortfolioExposure.ts": "Memoizes portfolio exposure calculations by delegating to calculatePortfolioExposure whenever the positions array changes.",
  "frontend/src/hooks/usePositionMonitoring.ts": "Polls Binance for current prices of all open positions every 5 seconds and computes PnL, distance to take-profit, and distance to stop-loss for each.",
  "frontend/src/hooks/usePositionStorage.ts": "Persists trading positions to localStorage and, when live trading is active, fires Binance Futures market/TP/SL orders asynchronously when a position is added.",
  "frontend/src/hooks/usePWAInstall.ts": "Tracks PWA installability and installation state by capturing the beforeinstallprompt event and exposing an install function to trigger the native prompt.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module that exports nothing; notes that all backend operations use direct Binance API calls and the ICP canister is unused.",
  "frontend/src/hooks/useSentimentAnalysis.ts": "Fetches 100 hourly Binance klines for a symbol and runs sentiment analysis on close prices and volumes, refreshing every 30 seconds.",
  "frontend/src/hooks/useTrendPrediction.ts": "Fetches hourly and daily Binance klines for a symbol and returns short-term and medium-term trend predictions, refreshing every 5 minutes.",
  "frontend/src/index.css": "Global stylesheet that defines Tailwind base/components/utilities, a golden OKLCH color theme with light and dark modes, and PWA standalone adjustments.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/services/binanceApi.ts": "Provides functions to fetch Binance USD-M Futures data including perpetual pairs, current prices, and OHLCV klines from the Binance FAPI REST API.",
  "frontend/src/services/binanceOrderService.ts": "Handles placing Binance USD-M Futures orders (market, take-profit, stop-loss) using HMAC-SHA256 signed requests via the Web Crypto API.",
  "frontend/src/types/adjustment.ts": "Defines TypeScript types for TP/SL adjustment suggestions and their acceptance/dismissal history.",
  "frontend/src/types/aiTrade.ts": "Defines types for AI-generated trades including status, risk management steps, reversal detection state, and a price-enriched variant for UI display.",
  "frontend/src/types/binanceApi.ts": "Defines TypeScript interfaces and enums for Binance API responses including account info, positions, orders, and order IDs.",
  "frontend/src/types/calculator.ts": "Defines input and result types for the position size calculator, including capital, risk, leverage, and risk/reward outputs.",
  "frontend/src/types/exposure.ts": "Defines types for portfolio exposure analysis including per-asset exposure, long/short balance, correlation risks, and warning flags.",
  "frontend/src/types/position.ts": "Defines types for trading positions including take-profit levels, stop-loss recommendations, and a price-enriched variant with PnL and distance metrics.",
  "frontend/src/types/prediction.ts": "Defines types for trend predictions (direction, confidence, time horizon) and their historical accuracy tracking.",
  "frontend/src/types/reversal.ts": "Defines types for market reversal detection signals including RSI divergence, EMA crossovers, candlestick patterns, volatility spikes, and support/resistance violations.",
  "frontend/src/types/scenario.ts": "Defines types for scenario simulation inputs and results, including per-position outcomes and preset scenarios.",
  "frontend/src/types/sentiment.ts": "Defines types for market sentiment analysis including bullish/bearish/neutral scores, contributing factors, and strength.",
  "frontend/src/types/tradeHistory.ts": "Defines types for user and AI trade history records, modality statistics, and overall performance metrics.",
  "frontend/src/utils/adjustmentSuggestions.ts": "Generates TP/SL adjustment suggestions for open positions based on ATR-derived volatility, support/resistance proximity, and 24h price change.",
  "frontend/src/utils/aiTradeHistoryStorage.ts": "Provides localStorage-backed CRUD utilities for persisting and retrieving AI trade history records, with duplicate prevention.",
  "frontend/src/utils/aiTradeSelection.ts": "Computes technical indicators (EMA, RSI, ATR, momentum) from Binance kline data and uses them to generate AI trade signals with configurable parameters per trading modality (Scalping, DayTrading, SwingTrading, etc.).",
  "frontend/src/utils/binanceAuth.ts": "Handles Binance API authentication by storing/retrieving credentials in localStorage, signing requests with HMAC-SHA256, and making authenticated fetch calls to the Binance Futures API.",
  "frontend/src/utils/exposureCalculations.ts": "Calculates portfolio exposure metrics (total capital, leverage, long/short balance, per-asset breakdown) and detects correlated position risks and warning flags from a list of positions.",
  "frontend/src/utils/liveTradingStorage.ts": "Manages live trading mode state and Binance credentials in localStorage, dispatching custom browser events when values change.",
  "frontend/src/utils/marketReversalDetector.ts": "Detects market trend reversals by analyzing Binance kline data using RSI divergence, EMA crossovers, candlestick patterns, ATR volatility spikes, and support/resistance violations, with timeframes configured per trading modality.",
  "frontend/src/utils/performanceCalculations.ts": "Calculates win rate, total PnL, and per-modality performance breakdowns for both user and AI trade records.",
  "frontend/src/utils/pnlCalculations.ts": "Calculates PnL in USD and percentage for leveraged long/short positions, and computes the percentage distance between current and target prices.",
  "frontend/src/utils/positionSizeCalculator.ts": "Calculates position size, number of contracts, risk/reward amounts, and risk-reward ratio based on capital, risk percentage, stop-loss, entry price, and leverage inputs.",
  "frontend/src/utils/registerServiceWorker.ts": "Registers a service worker for PWA support, handles update detection with a user confirmation prompt, and schedules hourly update checks.",
  "frontend/src/utils/scenarioSimulator.ts": "Defines preset market scenarios (crash, bull run, volatility) and a `simulateScenario` function that projects P&L, TP/SL hits, and liquidation risk for a list of positions given a percentage price change.",
  "frontend/src/utils/sentimentAnalysis.ts": "Implements technical indicator calculations (RSI, MACD, EMA, price action, volume trend, momentum) and an `analyzeSentiment` function that aggregates them into a `SentimentAnalysis` result with bullish/bearish factors.",
  "frontend/src/utils/stopLossCalculator.ts": "Calculates a recommended stop-loss price and associated loss metrics using ATR, support/resistance levels, and leverage-adjusted risk percentages, returning a `StopLossRecommendation` with reasoning and partial-taking strategy.",
  "frontend/src/utils/takeProfitCalculator.ts": "Generates three take-profit levels (conservative, moderate, aggressive) for a position by combining volatility, support/resistance levels, and leverage factors, returning an array of `TakeProfitLevel` objects with profit calculations and reasoning.",
  "frontend/src/utils/technicalAnalysis.ts": "Provides core technical analysis helpers: ATR calculation, volatility (std dev of returns), support/resistance detection via price clustering, and risk/reward ratio computation.",
  "frontend/src/utils/totalCapitalStorage.ts": "Manages persisting and retrieving a total capital value in localStorage, with validation to ensure the stored number is positive and non-NaN.",
  "frontend/src/utils/tradeHistoryStorage.ts": "Handles CRUD operations for user trade history records in localStorage, exposing functions to get, save, and clear `UserTradeRecord` entries.",
  "frontend/src/utils/trendPrediction.ts": "Predicts short-term (1–24 hour) and medium-term (1–7 day) price trend direction and confidence using moving averages, momentum, and volatility derived from hourly and daily price arrays.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH color tokens (primary, secondary, sidebar, chart, etc.), border radius, box shadow, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document (version 35) describing a crypto trading monitoring app with manual position entry and AI-powered TP/SL recommendations, listing architectural notes, known issues (PWA install, live trade freeze, settings panel unresponsive), and existing features."
}