{
  "backend/main.mo": "Empty Motoko actor serving as the backend canister placeholder with no implemented methods.",
  "feature_evidence.json": "Feature evidence report file with an empty features array, indicating no documented feature evidence.",
  "frontend-file-summaries.txt": "JSON document containing one- to two-sentence summaries of each frontend source file, used for build planning reference.",
  "frontend/index.css": "Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark theme tokens including colors, borders, and sidebar variables.",
  "frontend/index.html": "HTML shell for the React app with PWA manifest, theme color, Apple touch icon, and mobile web app meta tags configured for Crypto Position Monitor.",
  "frontend/public/manifest.json": "PWA manifest defining app name, icons, display mode, theme color, categories, and an 'Add Position' shortcut for Crypto Position Monitor.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first for static assets, network-first for HTML and Binance API calls, with install/activate lifecycle cache management.",
  "frontend/src/App.tsx": "Root React component orchestrating tab navigation, position storage, monitoring, and portfolio exposure hooks, rendering Dashboard, AI Daily Trades, AI Insights, and Risk Management tabs.",
  "frontend/src/components/AdjustmentSuggestionCard.tsx": "Displays an AI-generated stop-loss or take-profit adjustment suggestion with current vs. proposed levels, confidence badge, and accept/dismiss actions.",
  "frontend/src/components/AIDailyTradesSection.tsx": "Collapsible section component that fetches AI-generated daily trades via React Query, monitors live prices, and renders trade cards with loading skeletons and a force-refresh action.",
  "frontend/src/components/AIDailyTradesSummary.tsx": "Displays a daily summary panel for AI trades showing total PnL (USD and percent), winning/losing trade counts, and reversal guard activation count for the current UTC day.",
  "frontend/src/components/AIDailyTradesTab.tsx": "Tab layout component that composes the AIDailyTradesSection and PerformanceComparisonPanel into a single vertically stacked view.",
  "frontend/src/components/AIInsightsTab.tsx": "Renders AI-driven insights per position including sentiment gauges, trend predictions, and adjustment suggestions, with alerts for positions currently in loss.",
  "frontend/src/components/AITradeCard.tsx": "Card component for a single AI trade showing modality, risk management step progress, TP/SL levels, PnL, reversal guard status, and a live trading toggle.",
  "frontend/src/components/BinanceCredentialsPanel.tsx": "Form panel for saving, clearing, and testing Binance API credentials, with connection status feedback and a 15-second timeout for the test request.",
  "frontend/src/components/CredentialStatusIndicator.tsx": "Memoized badge indicator that reactively shows whether Binance API credentials are saved and whether live trading mode is active, listening to custom DOM events.",
  "frontend/src/components/DashboardTab.tsx": "Renders the main dashboard tab with a capital summary, open positions list, and a conditional button to import live positions from Binance when credentials are available.",
  "frontend/src/components/ExposureChart.tsx": "Displays two cards showing asset allocation percentages and long/short balance as labeled progress bars based on provided exposure and capital data.",
  "frontend/src/components/InstallButton.tsx": "Renders a PWA install button that triggers the native install prompt if available, or shows a manual instructions modal; hidden when the app is already installed.",
  "frontend/src/components/InstallInstructionsModal.tsx": "Shows a dialog with step-by-step PWA installation guides for multiple browsers (Chrome, Safari, Edge, Firefox) on both mobile and desktop.",
  "frontend/src/components/LiveRiskMetricsCard.tsx": "Fetches live prices and leverage bracket data from Binance to compute and display per-position liquidation prices, distances to liquidation, and risk levels (safe/warning/danger).",
  "frontend/src/components/LiveTradingBanner.tsx": "Displays an amber warning banner when live trading is active, reactively updating via custom DOM events without requiring a page reload.",
  "frontend/src/components/LiveTradingToggle.tsx": "Provides a switch to enable/disable live trading mode, showing a confirmation dialog before activation and enforcing a 20-second timeout safety cutoff.",
  "frontend/src/components/PerformanceComparisonPanel.tsx": "Renders a side-by-side performance comparison panel between AI trades and user trades, displaying metrics like win rate, PnL, and trade counts sourced from local trade history storage.",
  "frontend/src/components/PortfolioExposureDashboard.tsx": "Displays a portfolio exposure dashboard card showing total capital deployed, capital at risk, live unrealized PnL, and live exposure metrics, with support for enriched live-price positions.",
  "frontend/src/components/PositionCard.tsx": "Renders an individual trading position card with PnL display, TP/SL proximity alerts, AI insights collapsible section, adjustment suggestions, and a trade outcome modal triggered on deletion.",
  "frontend/src/components/PositionDashboard.tsx": "Renders the active positions dashboard by fetching live price data via usePositionMonitoring and mapping each position to a PositionCard, with empty-state and loading/error handling.",
  "frontend/src/components/PositionEntryForm.tsx": "Provides a form for manually entering a new trading position, fetching Binance perpetual pairs, calculating TP/SL levels from historical kline data, and submitting the constructed position object.",
  "frontend/src/components/PositionRecoveryCard.tsx": "Displays a card for a losing position that fetches and renders recovery strategies (hedge, DCA, partial close, TP/SL adjustment) with risk badges and expandable action steps via an accordion.",
  "frontend/src/components/PositionSizeCalculator.tsx": "Interactive calculator that computes optimal position size based on capital, risk percentage, entry/stop-loss prices, and leverage, with live Binance price fetching and leverage bracket validation.",
  "frontend/src/components/RiskManagementTab.tsx": "Composes the Risk Management tab by rendering LiveRiskMetricsCard, PositionSizeCalculator, PortfolioExposureDashboard, and ScenarioSimulator, with empty-state handling when no positions exist.",
  "frontend/src/components/ScenarioSimulator.tsx": "Allows users to simulate price-change scenarios (including ATR-based presets) across all or individual positions, fetching live prices and klines to display projected PnL results.",
  "frontend/src/components/SentimentGauge.tsx": "Displays a market sentiment card for a given symbol showing bullish/bearish/neutral score, strength progress bar, and top contributing indicator factors.",
  "frontend/src/components/SettingsDialog.tsx": "Modal dialog with three tabs for configuring Binance API credentials, enabling live trading mode, and setting total capital for risk calculations.",
  "frontend/src/components/StopLossRecommendations.tsx": "Displays a stop loss recommendation card showing the stop price, distance from current price, max loss, capital risk percentage, reasoning, and a partial taking strategy alert. Highlights the card when the price is within 2% of the stop loss.",
  "frontend/src/components/TabNavigation.tsx": "Renders a sticky horizontal tab navigation bar with four tabs: Dashboard, AI Daily Trades, AI Insights, and Risk Management. Highlights the active tab and truncates labels on small screens.",
  "frontend/src/components/TakeProfitRecommendations.tsx": "Renders a list of take-profit level cards showing target price, distance from current price, expected profit in USD and percent, and reasoning. Marks levels as 'Reached' when the current price crosses the target.",
  "frontend/src/components/TotalCapitalInput.tsx": "Provides a form card for entering and saving the user's total trading capital to local storage, with validation and a success toast notification. Disables the save button when the value is unchanged or invalid.",
  "frontend/src/components/TotalCapitalSummary.tsx": "Displays a capital summary card showing total, deployed, available, and at-risk capital derived from open positions, with an inline edit mode for updating the total capital value. Listens to a custom DOM event to stay in sync with capital changes made elsewhere.",
  "frontend/src/components/TradeOutcomeModal.tsx": "A dialog modal for recording the outcome of closing a position, allowing the user to select TP Hit, SL Hit, or Manually Closed, enter an exit price, and preview the resulting PnL before saving a trade record.",
  "frontend/src/components/TrendPredictionCard.tsx": "Fetches and displays AI-generated short-term and medium-term trend predictions for a given symbol, showing direction badges and confidence percentages. Shows a loading spinner while data is being fetched.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an ICP backend actor via React Query, using the current Internet Identity, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAdjustmentSuggestions.ts": "React Query hook that fetches recent Binance kline data for each open position and generates trade adjustment suggestions, refreshing every 30 seconds.",
  "frontend/src/hooks/useAITradeGeneration.ts": "React Query hook that generates AI trades for each trading modality and places corresponding live Binance orders (entry, TP, SL) with per-call 10-second timeouts, toasting results and persisting trades locally.",
  "frontend/src/hooks/useAITradeMonitoring.ts": "React Query hook that monitors active AI trades by polling current Binance prices, evaluating TP/SL crossings and reversal signals, updating trade state in localStorage, and triggering live close orders when needed.",
  "frontend/src/hooks/useAITradeStorage.ts": "Utility hook providing CRUD helpers (get, save, clear) for AI trades persisted in localStorage, with backward-compatible default values and no UTC-date-based invalidation.",
  "frontend/src/hooks/useBinancePairs.ts": "Thin React Query hook that fetches and caches the list of Binance perpetual futures pairs for one hour.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY AuthClient login/logout state and exposing the user's identity throughout the React tree.",
  "frontend/src/hooks/useLiveTradingMode.ts": "Hook that manages the live trading toggle state, validates Binance API credentials with a 15-second timeout before enabling, and listens for storage-level change events to keep state in sync.",
  "frontend/src/hooks/usePortfolioExposure.ts": "Custom hook that fetches live prices for portfolio positions every 30 seconds and enriches each position with live exposure, unrealized PnL, liquidation price, and distance-to-liquidation calculations.",
  "frontend/src/hooks/usePositionMonitoring.ts": "Custom hook that polls current prices for all tracked positions every 5 seconds and returns each position enriched with PnL and distance-to-TP/SL metrics.",
  "frontend/src/hooks/usePositionStorage.ts": "Custom hook managing position persistence in localStorage with optional live order placement (entry, TP, SL) via Binance when live trading is enabled, using per-call timeouts and toast notifications.",
  "frontend/src/hooks/usePWAInstall.ts": "Hook that captures the browser's beforeinstallprompt event to expose PWA installability state and an install() trigger function.",
  "frontend/src/hooks/useQueries.ts": "Intentionally empty placeholder module; all data fetching is done directly via Binance API calls rather than a backend canister.",
  "frontend/src/hooks/useSentimentAnalysis.ts": "Custom hook that fetches 100 hourly klines from Binance Futures and runs a sentiment analysis on close prices and volumes, refreshing every 30 seconds.",
  "frontend/src/hooks/useTrendPrediction.ts": "Custom hook that fetches hourly and daily klines from Binance Futures and returns short-term and medium-term trend predictions, refreshing every 5 minutes.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind directives and defines a golden-themed CSS custom property palette for both light and dark modes, including chart, sidebar, sentiment, and warning color tokens.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with TanStack QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/services/binanceApi.ts": "Service module providing typed async functions to fetch perpetual pairs, single/batch ticker prices, klines, and leverage bracket data from the Binance USDT-M Futures REST API.",
  "frontend/src/services/binanceOrderService.ts": "Service for placing Binance USD-M Futures orders (market, take-profit, stop-loss) via the fapi.binance.com API, using HMAC-SHA256 signing with the Web Crypto API.",
  "frontend/src/services/binancePositionService.ts": "Service that fetches open positions from Binance USD-M Futures (/fapi/v2/positionRisk) and maps them to the app's internal Position type with placeholder TP/SL values.",
  "frontend/src/types/adjustment.ts": "Defines types for TP/SL adjustment suggestions and their history, including confidence scores and accept/dismiss actions.",
  "frontend/src/types/aiTrade.ts": "Defines the AITrade and AITradeWithPrice interfaces representing AI-generated trades with TP/SL levels, risk management state, reversal detection, and optional Binance order IDs.",
  "frontend/src/types/binanceApi.ts": "TypeScript interfaces for Binance Futures API responses including account info, position risk, orders, leverage brackets, and related enums/types.",
  "frontend/src/types/calculator.ts": "Defines input and result interfaces for the position size calculator, covering capital, risk, entry/stop prices, leverage, and computed risk/reward metrics.",
  "frontend/src/types/exposure.ts": "Defines types for portfolio exposure analysis including per-asset exposure, long/short balance, correlation risks, and warning flags.",
  "frontend/src/types/position.ts": "Defines the core Position and PositionWithPrice interfaces, along with TakeProfitLevel and StopLossRecommendation types used throughout the app.",
  "frontend/src/types/prediction.ts": "Defines types for trend predictions (direction, confidence, time horizon) and prediction history with optional actual outcome tracking.",
  "frontend/src/types/recovery.ts": "Defines types for position recovery strategies (hedge, DCA, partial close, TP/SL adjustment) including their parameters, risk levels, and actionable steps.",
  "frontend/src/types/reversal.ts": "Defines types for market reversal detection signals and their component indicators: RSI divergence, EMA crossover, candlestick patterns, volatility spikes, and support/resistance violations.",
  "frontend/src/types/scenario.ts": "Defines types for scenario simulation inputs, per-position outcomes (PnL, TP/SL/liquidation hits), aggregate results, and preset scenarios.",
  "frontend/src/types/sentiment.ts": "Defines types for market sentiment analysis including bullish/bearish/neutral scores, contributing factors, and strength metrics.",
  "frontend/src/types/tradeHistory.ts": "Defines types for user and AI trade history records, including outcomes, PnL, modality stats, and overall performance metrics.",
  "frontend/src/utils/adjustmentSuggestions.ts": "Analyzes market conditions (volatility, ATR, support/resistance) for a position and generates actionable stop-loss and take-profit adjustment suggestions with confidence scores.",
  "frontend/src/utils/aiTradeHistoryStorage.ts": "Provides localStorage-backed CRUD utilities for persisting and retrieving AI trade history records, with duplicate-entry prevention.",
  "frontend/src/utils/aiTradeSelection.ts": "Fetches Binance kline data, computes technical indicators (EMA, RSI, ATR, momentum) and SMC analysis, then generates AI trade suggestions per trading modality with entry, stop-loss, and take-profit levels.",
  "frontend/src/utils/binanceAuth.ts": "Provides HMAC-SHA256 request signing and an authenticated fetch wrapper for the Binance API with a 15-second timeout, combined abort signal support, and typed error handling.",
  "frontend/src/utils/exposureCalculations.ts": "Calculates portfolio-level exposure metrics including total capital deployed, weighted leverage, long/short balance, per-asset breakdown, and correlated-position risk flags from a list of positions.",
  "frontend/src/utils/liveTradingStorage.ts": "Manages localStorage persistence for live trading mode, Binance credentials, and per-modality live order toggles, dispatching deferred custom DOM events on each state change.",
  "frontend/src/utils/marketReversalDetector.ts": "Implements an SMC-enhanced market reversal detection algorithm that analyzes Binance kline data using RSI divergence, EMA crossovers, candlestick patterns, ATR volatility spikes, support/resistance violations, CHOCH, breaker blocks, liquidity sweeps, and opposing FVGs across modality-specific timeframes.",
  "frontend/src/utils/performanceCalculations.ts": "Provides utility functions to calculate win rate, total PnL, and performance metrics for both user and AI trade records, including a per-modality breakdown sorted by trading modality order.",
  "frontend/src/utils/pnlCalculations.ts": "Calculates PnL in USD and percentage for leveraged long/short positions given entry and current prices, and computes the percentage distance between current and target prices.",
  "frontend/src/utils/positionRecoveryEngine.ts": "Generates recovery strategies (hedge, DCA, partial close, TP/SL adjustment) for losing positions by analyzing ATR, support/resistance levels, and current PnL percentage.",
  "frontend/src/utils/positionSizeCalculator.ts": "Calculates optimal position size, number of contracts, risk/reward amounts, and risk-reward ratio based on capital, risk percentage, stop-loss distance, entry price, and leverage.",
  "frontend/src/utils/registerServiceWorker.ts": "Registers a service worker for PWA support, handles update detection with a user confirmation prompt, and schedules hourly update checks.",
  "frontend/src/utils/scenarioSimulator.ts": "Simulates the impact of price change scenarios (e.g., market crash, bull run) on a portfolio of positions, computing projected PnL, TP/SL hits, and liquidation risk for each position.",
  "frontend/src/utils/sentimentAnalysis.ts": "Performs market sentiment analysis on Binance kline data by computing RSI, MACD, volume trends, price action, momentum, and SMC-based indicators like swing points, BOS, FVGs, and Wyckoff phase.",
  "frontend/src/utils/smcAnalysis.ts": "Core Smart Money Concepts (SMC) analysis library that provides detection utilities for swing points, BOS, CHOCH, order blocks, fair value gaps, liquidity zones, Wyckoff phases, and manipulation signals using Binance kline data.",
  "frontend/src/utils/stopLossCalculator.ts": "Calculates institutional stop-loss prices for long/short positions using SMC analysis (order blocks, swept liquidity zones, ATR), then enforces a capital risk cap of 0.5%–2% of investment.",
  "frontend/src/utils/takeProfitCalculator.ts": "Calculates three tiered take-profit levels for a position using SMC structures (FVGs, order blocks, swing highs/lows) with ATR-based fallbacks and volatility-adjusted multipliers.",
  "frontend/src/utils/technicalAnalysis.ts": "Provides basic technical analysis helpers including ATR calculation, volatility (std dev of returns), support/resistance clustering, and risk/reward ratio computation.",
  "frontend/src/utils/totalCapitalStorage.ts": "Manages total trading capital persistence in localStorage and dispatches a custom DOM event ('total-capital-change') on every write to enable reactive UI updates.",
  "frontend/src/utils/tradeHistoryStorage.ts": "Handles CRUD operations for user trade history records stored in localStorage, supporting get, save, and clear operations.",
  "frontend/src/utils/trendPrediction.ts": "Predicts short-term (1–24h) and medium-term (1–7d) price trend direction and confidence using moving averages, momentum, and volatility from hourly and daily price arrays.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode support, oklch-based design token colors (including sidebar and chart palettes), custom fonts, golden glow shadows, accordion animations, and typography/container-queries plugins.",
  "project_state.json": "Tracks the project state (version 61) for a crypto trading monitoring app built with React/TypeScript/Tailwind, including architectural notes, known issues, and a list of existing features with their requirement IDs."
}