{
  "backend/main.mo": "Empty Motoko actor serving as the backend canister placeholder with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting the always-visible PWA 'Download App' button feature, linking it to InstallButton.tsx and InstallInstructionsModal.tsx with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing the purpose and recent changes of each component, hook, and utility in the project.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, primary, sidebar, and chart colors.",
  "frontend/index.html": "HTML entry point for the Crypto Position Monitor PWA, including manifest link, theme color, Apple/mobile web app meta tags, and favicon configuration.",
  "frontend/public/manifest.json": "PWA web app manifest for Crypto Position Monitor defining name, icons, display mode, theme colors, categories, and an 'Add Position' shortcut.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first for static assets, network-first for HTML and Binance API calls, with install/activate lifecycle management and old cache cleanup.",
  "frontend/src/App.tsx": "Root React component rendering the full app layout including a sticky header with logo and InstallButton, and collapsible sections for position entry, dashboard, calculator, exposure, and simulator.",
  "frontend/src/components/AdjustmentSuggestionCard.tsx": "Card component that displays an AI-generated take-profit or stop-loss adjustment suggestion with current vs. proposed levels, confidence badge, and accept/dismiss actions.",
  "frontend/src/components/ExposureChart.tsx": "Renders two cards showing asset allocation and long/short balance as progress bars with percentage breakdowns based on portfolio exposure data.",
  "frontend/src/components/InstallButton.tsx": "A PWA install button that triggers the native install prompt if available, or shows a manual instructions modal as a fallback; hidden when already installed.",
  "frontend/src/components/InstallInstructionsModal.tsx": "A dialog modal displaying step-by-step PWA installation instructions for multiple browsers (Chrome, Safari, Edge, Firefox) with browser-specific icons and steps.",
  "frontend/src/components/PortfolioExposureDashboard.tsx": "Dashboard card displaying portfolio exposure metrics (deployed capital, total exposure, capital at risk, available capital) with percentage calculations relative to a user-configurable total capital, plus warnings for high deployment or risk.",
  "frontend/src/components/PositionCard.tsx": "Card component for a single trading position showing PnL, proximity to take-profit/stop-loss levels, AI insights (sentiment, trend prediction, adjustment suggestions), and delete/update actions.",
  "frontend/src/components/PositionDashboard.tsx": "Dashboard that lists all active trading positions using PositionCard components with real-time price monitoring, showing an empty state with an add-position prompt when no positions exist.",
  "frontend/src/components/PositionEntryForm.tsx": "A form component for entering a new trading position, collecting symbol, position type, leverage, entry price, and investment amount, then computing take-profit levels and stop-loss via utility functions before calling onSubmit.",
  "frontend/src/components/PositionSizeCalculator.tsx": "A calculator card component that computes recommended position size based on capital, risk percentage, entry price, stop-loss price, and leverage, with an optional callback to apply the result to a parent form.",
  "frontend/src/components/ScenarioSimulator.tsx": "A card component that simulates portfolio P&L impact for a given price change percentage across all open positions, supporting preset scenarios and a custom slider, with liquidation risk and high-loss warnings.",
  "frontend/src/components/SentimentGauge.tsx": "Displays market sentiment (bullish/bearish/neutral) for a given symbol using the useSentimentAnalysis hook, showing a score badge, strength progress bar, and contributing indicator factors.",
  "frontend/src/components/StopLossRecommendations.tsx": "Renders a stop-loss recommendation card showing the stop price, distance from current price, max loss in USD and percent, capital risk, reasoning, and a partial-taking strategy alert.",
  "frontend/src/components/TakeProfitRecommendations.tsx": "Renders a list of take-profit level cards, each showing the target price, distance from current price, expected profit in USD and percent, and reasoning, with visual highlighting when a level has been reached.",
  "frontend/src/components/TotalCapitalInput.tsx": "A card component that allows users to input and save their total trading capital, with validation and success feedback using localStorage for persistence.",
  "frontend/src/components/TotalCapitalSummary.tsx": "A card component that displays a capital overview (deployed, at-risk, and available capital) calculated from active positions, with an edit dialog to update total capital.",
  "frontend/src/components/TrendPredictionCard.tsx": "A card component that displays AI-generated short-term and medium-term trend predictions (direction and confidence) for a given trading symbol.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an ICP backend actor using the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAdjustmentSuggestions.ts": "A hook that fetches recent Binance price data for each position and generates trade adjustment suggestions, refreshing every 30 seconds.",
  "frontend/src/hooks/useBinancePairs.ts": "A hook that fetches and caches the list of Binance perpetual trading pairs, with a 1-hour stale time and 3 retries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/usePortfolioExposure.ts": "A memoized hook that computes portfolio exposure metrics from a list of positions using the calculatePortfolioExposure utility.",
  "frontend/src/hooks/usePositionMonitoring.ts": "A hook that polls Binance every 5 seconds to fetch current prices for all positions and computes PnL and distance-to-TP/SL metrics.",
  "frontend/src/hooks/usePositionStorage.ts": "A hook that persists and manages trading positions in localStorage, exposing add, update, and delete operations.",
  "frontend/src/hooks/usePWAInstall.ts": "A hook that manages PWA installation state by capturing the beforeinstallprompt event and exposing an install function and installability/installed flags.",
  "frontend/src/hooks/useQueries.ts": "A placeholder file noting that all backend operations use direct Binance API calls and the ICP backend canister is unused.",
  "frontend/src/hooks/useSentimentAnalysis.ts": "React Query hook that fetches 1-hour Binance futures klines for a given symbol and runs sentiment analysis on close prices and volumes, refreshing every 30 seconds.",
  "frontend/src/hooks/useTrendPrediction.ts": "React Query hook that fetches hourly and daily Binance futures klines for a symbol and returns short-term and medium-term trend predictions, refreshing every 5 minutes.",
  "frontend/src/index.css": "Global stylesheet using Tailwind CSS with a golden-themed design system defining CSS custom properties for light and dark modes, including chart, sentiment, and sidebar color tokens.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in React Query's QueryClientProvider and a custom InternetIdentityProvider.",
  "frontend/src/services/binanceApi.ts": "Service module providing functions to fetch Binance Futures perpetual trading pairs, current prices, and kline (candlestick) close prices via the Binance Futures REST API.",
  "frontend/src/types/adjustment.ts": "TypeScript types defining the shape of take-profit/stop-loss adjustment suggestions and their acceptance history.",
  "frontend/src/types/calculator.ts": "TypeScript interfaces for position size calculator inputs (capital, risk, prices, leverage) and the resulting computed values.",
  "frontend/src/types/exposure.ts": "TypeScript interfaces modeling portfolio exposure data including per-asset breakdown, long/short balance, correlation risks, and warning flags.",
  "frontend/src/types/position.ts": "TypeScript interfaces defining the core Position entity with take-profit levels, stop-loss recommendation, and an extended PositionWithPrice that includes live PnL and distance metrics.",
  "frontend/src/types/prediction.ts": "TypeScript types for trend prediction results, including direction, confidence, time horizon, and optional historical accuracy tracking.",
  "frontend/src/types/scenario.ts": "TypeScript interfaces for what-if scenario simulation inputs, per-position outcomes (PnL, TP/SL hit, liquidation risk), and preset scenario definitions.",
  "frontend/src/types/sentiment.ts": "TypeScript types representing a sentiment analysis result with a bullish/bearish/neutral score, strength value, and contributing indicator factors.",
  "frontend/src/utils/adjustmentSuggestions.ts": "Utility that analyzes market conditions (ATR, volatility, support/resistance) for a position and generates stop-loss or take-profit adjustment suggestions with confidence scores.",
  "frontend/src/utils/exposureCalculations.ts": "Utility that computes full portfolio exposure metrics from a list of positions, including leverage totals, long/short balance, per-asset breakdown, correlated-pair risk detection, and warning flags.",
  "frontend/src/utils/pnlCalculations.ts": "Utility functions to calculate leveraged PnL in USD and percent for long/short positions, and the percentage distance between two price levels.",
  "frontend/src/utils/positionSizeCalculator.ts": "Utility that computes optimal position size, contract count, risk amount, and reward amount given capital, risk percentage, entry/stop-loss prices, and leverage.",
  "frontend/src/utils/registerServiceWorker.ts": "Registers a PWA service worker, listens for updates, prompts the user to reload on new versions, and schedules hourly update checks.",
  "frontend/src/utils/scenarioSimulator.ts": "Defines preset market scenarios (crash, bull run, volatility) and a `simulateScenario` function that projects P&L, TP/SL hits, and liquidation risk for a list of positions given a percentage price change.",
  "frontend/src/utils/sentimentAnalysis.ts": "Implements technical indicator calculations (RSI, MACD, EMA, price action, volume trend, momentum) and an `analyzeSentiment` function that aggregates bullish/bearish signals into a `SentimentAnalysis` result.",
  "frontend/src/utils/stopLossCalculator.ts": "Calculates a recommended stop-loss price and associated loss metrics using ATR, support/resistance levels, and leverage-adjusted risk percentages, returning a `StopLossRecommendation` with reasoning and partial-taking strategy.",
  "frontend/src/utils/takeProfitCalculator.ts": "Generates three take-profit levels (conservative, moderate, aggressive) for a position by combining volatility, leverage factors, and support/resistance levels, returning an array of `TakeProfitLevel` objects with profit calculations and reasoning.",
  "frontend/src/utils/technicalAnalysis.ts": "Provides core technical analysis utilities: ATR calculation, volatility (std dev of returns), support/resistance detection via price clustering, and risk/reward ratio computation.",
  "frontend/src/utils/totalCapitalStorage.ts": "Handles reading, writing, and validating a total capital value in localStorage, exposing `getTotalCapital`, `setTotalCapital`, and `validateTotalCapital` helpers.",
  "frontend/src/utils/trendPrediction.ts": "Computes short-term (1–24 hour) and medium-term (1–7 day) trend predictions by analyzing price trend, momentum, and volatility indicators from hourly and daily price arrays, returning direction and confidence values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens (primary, secondary, sidebar, chart, etc.), border radius, box shadow, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state manifest (version 17) describing a crypto trading monitoring app with manual position entry, Binance Futures API integration, AI-powered TP/SL recommendations, PWA support, and a known issue with PWA installation reliability."
}