{
  "backend/main.mo": "Empty Motoko actor serving as the backend canister placeholder with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report listing implemented features with their IDs, titles, associated files, components, test IDs, and confidence levels for the market reversal detection algorithm and related AITrade type extensions.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short summaries describing each file's purpose, used as a build planning reference for the frontend codebase.",
  "frontend/index.css": "Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes including colors for background, foreground, card, chart, and sidebar tokens.",
  "frontend/index.html": "HTML entry point for the Crypto Position Monitor PWA, including manifest link, theme color, Apple touch icon, and mobile web app meta tags.",
  "frontend/public/manifest.json": "PWA manifest for Crypto Position Monitor defining app name, icons, display mode, theme color, categories, and an 'Add Position' shortcut.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first for static assets, network-first for HTML and Binance API calls, with install/activate lifecycle handlers to manage versioned caches.",
  "frontend/src/App.tsx": "Root React component rendering a sticky header with logo and social links, tab navigation, and tab-specific content (Dashboard, AI Daily Trades, AI Insights, Risk Management) using position storage and monitoring hooks.",
  "frontend/src/components/AdjustmentSuggestionCard.tsx": "Alert-style card that presents an AI-generated stop-loss or take-profit adjustment suggestion with accept and dismiss actions.",
  "frontend/src/components/AIDailyTradesSection.tsx": "Collapsible section component that displays AI-generated daily trades using generation, monitoring, and storage hooks, with loading skeletons, error state, and a force-refresh button.",
  "frontend/src/components/AIDailyTradesSummary.tsx": "Summary panel showing aggregated AI portfolio PnL, win/loss counts, and reversal guard activations for the current day's AI trades.",
  "frontend/src/components/AIDailyTradesTab.tsx": "Tab layout component that composes AIDailyTradesSection and PerformanceComparisonPanel into a single view.",
  "frontend/src/components/AIInsightsTab.tsx": "Tab that renders per-position AI insights including sentiment gauges, trend predictions, and dismissible adjustment suggestions for a list of positions.",
  "frontend/src/components/AITradeCard.tsx": "Card component that displays a single AI trade's details including modality badge, PnL, take-profit progress bars, risk management step tracker, and status badges including reversal guard.",
  "frontend/src/components/DashboardTab.tsx": "Main dashboard tab that composes the capital summary, position entry form, and position dashboard into a single layout.",
  "frontend/src/components/ExposureChart.tsx": "Renders two cards showing asset allocation and long/short balance as progress bars, calculated from exposure and capital props.",
  "frontend/src/components/InstallButton.tsx": "A PWA install button that triggers the native install prompt if available, or shows a manual instructions modal otherwise; hidden when already installed.",
  "frontend/src/components/InstallInstructionsModal.tsx": "A dialog modal displaying step-by-step PWA installation instructions for multiple browsers (Chrome, Safari, Edge, Firefox) with browser-specific icons.",
  "frontend/src/components/PerformanceComparisonPanel.tsx": "Displays a side-by-side performance comparison panel between AI-generated trades and user trades, showing metrics like win rate, PnL, and trade counts from stored history.",
  "frontend/src/components/PortfolioExposureDashboard.tsx": "Dashboard card showing portfolio exposure metrics (deployed capital, leverage, capital at risk) with percentage breakdowns relative to a user-configurable total capital, plus warnings for high deployment or risk.",
  "frontend/src/components/PositionCard.tsx": "Card component for an individual trading position displaying PnL, TP/SL proximity, AI insights, adjustment suggestions, and a trade outcome modal triggered on deletion.",
  "frontend/src/components/PositionDashboard.tsx": "Displays a dashboard of active trading positions using real-time price monitoring, showing either an empty state with an 'Add Position' prompt or a list of PositionCard components with error handling.",
  "frontend/src/components/PositionEntryForm.tsx": "A form component for creating new trading positions that fetches Binance perpetual pairs, accepts entry details, and calculates take-profit levels and stop-loss using historical kline data.",
  "frontend/src/components/PositionSizeCalculator.tsx": "A calculator component that computes recommended position sizes based on capital, risk percentage, entry price, stop-loss price, and leverage, with an optional apply callback.",
  "frontend/src/components/RiskManagementTab.tsx": "A tab layout component that composes the PositionSizeCalculator, PortfolioExposureDashboard, and ScenarioSimulator into a single risk management view.",
  "frontend/src/components/ScenarioSimulator.tsx": "Simulates portfolio P&L impact for custom or preset market price change scenarios using a slider and preset buttons, with liquidation risk and high-loss warnings.",
  "frontend/src/components/SentimentGauge.tsx": "Displays a market sentiment card for a given symbol showing bullish/bearish/neutral score, strength percentage, and contributing indicator factors fetched via useSentimentAnalysis.",
  "frontend/src/components/StopLossRecommendations.tsx": "Displays a stop loss recommendation card showing price, distance from current price, max loss, capital risk percentage, reasoning, and a partial taking strategy alert. Highlights the card when price is within 2% of the stop loss.",
  "frontend/src/components/TabNavigation.tsx": "Renders a sticky horizontal tab navigation bar with four tabs: Dashboard, AI Daily Trades, AI Insights, and Risk Management. Highlights the active tab with a golden glow style.",
  "frontend/src/components/TakeProfitRecommendations.tsx": "Renders a list of take profit level cards showing target price, distance from current price, profit in USD and percent, and reasoning. Marks levels as reached based on position type and current price.",
  "frontend/src/components/TotalCapitalInput.tsx": "Provides a form card for entering and saving total trading capital to local storage, with validation, success feedback, and a toast notification system.",
  "frontend/src/components/TotalCapitalSummary.tsx": "Displays a capital overview card showing total, deployed, at-risk, and available capital derived from open positions. Prompts the user to set total capital if not yet configured, with an edit dialog.",
  "frontend/src/components/TradeOutcomeModal.tsx": "A dialog modal for closing a position by recording the trade outcome (TP Hit, SL Hit, or Manually Closed), exit price, and previewing PnL before saving a UserTradeRecord.",
  "frontend/src/components/TrendPredictionCard.tsx": "Displays AI-generated short-term and medium-term trend predictions for a given symbol, showing direction badges and confidence percentages fetched via the useTrendPrediction hook.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an ICP backend actor, using the current Internet Identity, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAdjustmentSuggestions.ts": "React Query hook that fetches hourly Binance kline data for each position and generates trading adjustment suggestions, refreshing every 30 seconds.",
  "frontend/src/hooks/useAITradeGeneration.ts": "React Query hook that generates daily AI trades for four trading modalities, using localStorage-cached trades when available and regenerating on daily reset or capital changes.",
  "frontend/src/hooks/useAITradeMonitoring.ts": "React Query hook that polls current prices for active AI trades, tracks TP/SL crossings, manages risk management step transitions, detects market reversals, and triggers trade regeneration when positions close.",
  "frontend/src/hooks/useAITradeStorage.ts": "Custom hook providing localStorage CRUD helpers for daily AI trades, including date-based cache invalidation and backward-compatible default values for execution-state fields.",
  "frontend/src/hooks/useBinancePairs.ts": "React Query hook that fetches and caches the list of Binance perpetual trading pairs for one hour.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, and identity persistence across page reloads.",
  "frontend/src/hooks/usePortfolioExposure.ts": "Memoized hook that computes portfolio exposure metrics from a list of positions with current prices.",
  "frontend/src/hooks/usePositionMonitoring.ts": "React Query hook that polls current prices every 5 seconds for all positions and computes PnL and distance-to-TP/SL for each.",
  "frontend/src/hooks/usePositionStorage.ts": "Hook that persists and manages trading positions in localStorage, exposing add, update, and delete operations.",
  "frontend/src/hooks/usePWAInstall.ts": "Hook that captures the browser's beforeinstallprompt event and exposes install state and an install trigger function for PWA installation.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module indicating that backend canister queries are unused; all data comes from direct Binance API calls.",
  "frontend/src/hooks/useSentimentAnalysis.ts": "React Query hook that fetches 100 hourly Binance klines for a symbol and runs sentiment analysis, refreshing every 30 seconds.",
  "frontend/src/hooks/useTrendPrediction.ts": "React Query hook that fetches hourly and daily Binance klines for a symbol and returns short-term and medium-term trend predictions, refreshing every 5 minutes.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines a golden-themed design system with CSS custom properties for both light and dark modes, including colors for UI components, charts, sentiment indicators, and utility classes.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/services/binanceApi.ts": "Service module for the Binance Futures API that provides functions to fetch perpetual trading pairs, current prices (single and batch), and OHLCV kline data.",
  "frontend/src/types/adjustment.ts": "TypeScript types for TP/SL adjustment suggestions, defining AdjustmentSuggestion and AdjustmentHistory interfaces with fields for proposed levels, reasoning, and confidence.",
  "frontend/src/types/aiTrade.ts": "TypeScript types for AI-managed trades, defining AITrade and AITradeWithPrice interfaces covering entry/exit levels, TP execution state, risk management steps, and reversal detection fields.",
  "frontend/src/types/calculator.ts": "TypeScript interfaces for position size calculator inputs (capital, risk %, entry/SL prices, leverage) and computed results (position size, contracts, risk/reward).",
  "frontend/src/types/exposure.ts": "TypeScript interfaces for portfolio exposure analysis, including per-asset exposure, long/short balance, correlation risk, and warning flags.",
  "frontend/src/types/position.ts": "TypeScript interfaces for trading positions, including take-profit levels, stop-loss recommendations, and a live PositionWithPrice view with PnL and distance metrics.",
  "frontend/src/types/prediction.ts": "TypeScript types for trend predictions, defining TrendPrediction with direction, confidence, and time horizon, plus a PredictionHistory interface for tracking accuracy.",
  "frontend/src/types/reversal.ts": "TypeScript interfaces for market reversal detection signals, covering RSI divergence, EMA crossovers, candlestick patterns, volatility spikes, and support/resistance violations.",
  "frontend/src/types/scenario.ts": "TypeScript interfaces for what-if scenario analysis, defining inputs, per-position outcomes (PnL, TP/SL/liquidation hits), aggregate results, and preset scenarios.",
  "frontend/src/types/sentiment.ts": "TypeScript types for market sentiment analysis, defining SentimentAnalysis with a bullish/bearish/neutral score, strength value, and contributing factors.",
  "frontend/src/types/tradeHistory.ts": "TypeScript interfaces for trade history records for both user and AI trades, plus performance metrics and per-modality statistics.",
  "frontend/src/utils/adjustmentSuggestions.ts": "Utility that analyzes market conditions (ATR, volatility, support/resistance) for a position and generates TP/SL adjustment suggestions based on those conditions.",
  "frontend/src/utils/aiTradeHistoryStorage.ts": "LocalStorage utility for persisting AI trade history records, with functions to get, save (deduplicating by id+outcome), and clear records.",
  "frontend/src/utils/aiTradeSelection.ts": "Computes technical indicators (EMA, RSI, ATR, momentum) from Binance kline data and uses them to generate AI trade signals with entry, take-profit, and stop-loss levels per trading modality.",
  "frontend/src/utils/exposureCalculations.ts": "Calculates portfolio-level exposure metrics including total capital deployed, weighted leverage, long/short balance, per-asset breakdown, and correlation risks with warning flags.",
  "frontend/src/utils/marketReversalDetector.ts": "Detects market trend reversals by analyzing Binance kline data using RSI divergence, EMA crossovers, candlestick patterns, ATR volatility spikes, and support/resistance violations per trading modality.",
  "frontend/src/utils/performanceCalculations.ts": "Calculates win rate, total PnL, and performance metrics for user and AI trade records, including a per-modality breakdown for AI trades.",
  "frontend/src/utils/pnlCalculations.ts": "Provides utility functions to calculate leveraged PnL in USD and percent for long/short positions, and the percentage distance between two prices.",
  "frontend/src/utils/positionSizeCalculator.ts": "Calculates position size, contract count, risk amount, and reward amount based on capital, risk percentage, stop-loss distance, entry price, and leverage.",
  "frontend/src/utils/registerServiceWorker.ts": "Registers a service worker for PWA support, handles update detection with a user prompt to reload, and schedules hourly update checks.",
  "frontend/src/utils/scenarioSimulator.ts": "Simulates portfolio outcomes under hypothetical price change scenarios, determining projected PnL, TP/SL hits, and liquidation risk for each position.",
  "frontend/src/utils/sentimentAnalysis.ts": "Calculates market sentiment (bullish/bearish/neutral) from close prices and volumes using RSI, MACD, price action, volume trend, and momentum indicators, returning a scored SentimentAnalysis object with contributing factors.",
  "frontend/src/utils/stopLossCalculator.ts": "Computes a stop-loss price and associated risk metrics for a leveraged position using ATR, support/resistance levels, and a leverage-adjusted base risk percentage, returning a StopLossRecommendation with reasoning and partial-taking strategy.",
  "frontend/src/utils/takeProfitCalculator.ts": "Generates three take-profit levels (conservative, moderate, aggressive) for a leveraged position based on volatility, support/resistance clusters, and leverage-adjusted multipliers, returning profit USD and percent for each level.",
  "frontend/src/utils/technicalAnalysis.ts": "Provides core technical analysis helpers: ATR calculation, volatility (std dev of returns), support/resistance detection via price clustering, and risk/reward ratio computation.",
  "frontend/src/utils/totalCapitalStorage.ts": "Manages persisting and retrieving a total capital value in localStorage, with validation to ensure the stored number is positive and non-NaN.",
  "frontend/src/utils/tradeHistoryStorage.ts": "Handles CRUD operations for user trade history records in localStorage, exposing functions to get, save, and clear UserTradeRecord entries.",
  "frontend/src/utils/trendPrediction.ts": "Predicts short-term (1–24 hour) and medium-term (1–7 day) price trend direction and confidence using moving averages, momentum, and volatility derived from hourly and daily price arrays.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens (including sidebar and chart palettes), extended border radii, box shadows, accordion keyframe animations, and the typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the project state (version 29) for a crypto trading monitoring app built with React/TypeScript/Tailwind, documenting architectural notes, known issues, and a detailed list of existing and planned features."
}