{
  "backend/main.mo": "Empty Motoko actor serving as the backend canister placeholder with no implemented methods.",
  "feature_evidence.json": "Feature evidence report documenting the requirement to populate the PositionSizeCalculator asset selector with all Binance USD-M Futures perpetual pairs via the useBinancePairs hook, including loading/error states.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing the purpose and key details of each component, hook, utility, and service in the project.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark theme tokens including colors, borders, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the React app with PWA manifest, theme color, favicon, Apple touch icon, and mobile web app meta tags configured.",
  "frontend/public/manifest.json": "PWA manifest for Crypto Position Monitor defining app name, icons, display mode, theme color, categories, and an 'Add Position' shortcut.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first for static assets, network-first for HTML and Binance API calls, with separate static and dynamic caches and old cache cleanup on activation.",
  "frontend/src/App.tsx": "Root React component managing tab navigation, position storage, monitoring, and portfolio exposure, rendering Dashboard, AI Daily Trades, AI Insights, Risk Management tabs, and a settings dialog.",
  "frontend/src/components/AdjustmentSuggestionCard.tsx": "Alert-style card that presents an AI-generated stop-loss or take-profit adjustment suggestion with current vs. proposed levels, confidence badge, and accept/dismiss actions.",
  "frontend/src/components/AIDailyTradesSection.tsx": "Collapsible section component that displays AI-generated daily trade cards with loading skeletons, live price monitoring, last-updated timestamp, and a force-refresh button.",
  "frontend/src/components/AIDailyTradesSummary.tsx": "Displays a summary panel for today's AI trading portfolio, showing total PnL (USD and percent), winning/losing trade counts, and the number of reversal guard activations pulled from trade history storage.",
  "frontend/src/components/AIDailyTradesTab.tsx": "Tab layout component that composes the AIDailyTradesSection and PerformanceComparisonPanel into a single vertically stacked view.",
  "frontend/src/components/AIInsightsTab.tsx": "Renders AI-driven insights for each open position, including sentiment gauges, trend predictions, and dismissible adjustment suggestions for stop-loss and take-profit levels.",
  "frontend/src/components/AITradeCard.tsx": "Card component for displaying a single AI trade's details including modality, PnL, take-profit progress bars, risk management step tracker, reversal guard status, and a live-trading toggle.",
  "frontend/src/components/BinanceCredentialsPanel.tsx": "Form panel for saving, clearing, and testing Binance API credentials, with connection status feedback (connected, invalid, timeout, error) and masked secret display.",
  "frontend/src/components/CredentialStatusIndicator.tsx": "Memoized badge indicator that reactively shows whether Binance API credentials are stored and whether live trading mode is active, listening to custom DOM events for updates.",
  "frontend/src/components/DashboardTab.tsx": "Renders the main dashboard tab with a capital summary, open positions list, and a button to import live positions from Binance when credentials are available.",
  "frontend/src/components/ExposureChart.tsx": "Displays two cards showing asset allocation percentages and long/short balance as progress bars based on provided exposure and capital data.",
  "frontend/src/components/InstallButton.tsx": "Renders a PWA install button that triggers the native install prompt if available, or shows a manual instructions modal otherwise; hidden when already installed.",
  "frontend/src/components/InstallInstructionsModal.tsx": "Shows a dialog with step-by-step PWA installation instructions for multiple browsers (Chrome, Safari, Edge, Firefox) on both mobile and desktop.",
  "frontend/src/components/LiveRiskMetricsCard.tsx": "Fetches live prices and leverage bracket data from Binance to compute and display per-position liquidation prices, distances, and risk levels (safe/warning/danger).",
  "frontend/src/components/LiveTradingBanner.tsx": "Displays an amber warning banner when live trading mode is active, reactively updating via custom DOM events without page reload.",
  "frontend/src/components/LiveTradingToggle.tsx": "Provides a switch to enable/disable live trading mode, showing a confirmation dialog before activation and a timeout safety mechanism that auto-disables after 20 seconds.",
  "frontend/src/components/PerformanceComparisonPanel.tsx": "Renders a side-by-side performance comparison panel between AI trades and user trades, displaying metrics like win rate, PnL, and trade counts sourced from local storage utilities.",
  "frontend/src/components/PortfolioExposureDashboard.tsx": "Displays a portfolio exposure dashboard card showing total capital deployed, capital at risk, live unrealized PnL, and live exposure, with support for enriched live-price positions.",
  "frontend/src/components/PositionCard.tsx": "Renders an individual trading position card with PnL display, TP/SL proximity alerts, AI insights collapsible section, adjustment suggestions, and a trade outcome modal triggered on deletion.",
  "frontend/src/components/PositionDashboard.tsx": "Renders the active positions dashboard by fetching live price data via a monitoring hook and mapping each position to a PositionCard, with loading, error, and empty-state handling.",
  "frontend/src/components/PositionEntryForm.tsx": "Provides a form for manually entering a new trading position, fetching historical klines to auto-calculate take-profit levels and stop-loss, then submitting the constructed position object.",
  "frontend/src/components/PositionSizeCalculator.tsx": "A React component that calculates optimal position sizes for crypto futures trades using inputs like capital, risk percentage, entry/stop-loss prices, and leverage, with live Binance price and leverage bracket data fetched via React Query.",
  "frontend/src/components/RiskManagementTab.tsx": "A tab layout component that composes the LiveRiskMetricsCard, PositionSizeCalculator, PortfolioExposureDashboard, and ScenarioSimulator into a single Risk Management view, conditionally rendering exposure and metrics only when positions exist.",
  "frontend/src/components/ScenarioSimulator.tsx": "A component that simulates portfolio P&L impact under user-defined or preset percentage price changes, enriching positions with live Binance prices and computing ATR-based scenario presets from historical kline data.",
  "frontend/src/components/SentimentGauge.tsx": "Displays a market sentiment card for a given symbol showing bullish/bearish/neutral score, strength percentage, and contributing indicator factors sourced from the useSentimentAnalysis hook.",
  "frontend/src/components/SettingsDialog.tsx": "A modal dialog with three tabs for configuring Binance API credentials, enabling live trading mode, and setting total capital, using sub-components for each settings section.",
  "frontend/src/components/StopLossRecommendations.tsx": "Renders a stop-loss recommendation card showing the stop price, distance from current price, max loss in USD/percent, capital risk percentage, reasoning, and a partial-taking strategy alert.",
  "frontend/src/components/TabNavigation.tsx": "A sticky top navigation bar component that renders four app tabs (Dashboard, AI Daily Trades, AI Insights, Risk Management) with active-state highlighting and responsive label truncation.",
  "frontend/src/components/TakeProfitRecommendations.tsx": "Renders a list of take-profit level cards for a position, showing target price, distance from current price, expected profit, and whether each level has been reached.",
  "frontend/src/components/TotalCapitalInput.tsx": "A form card that lets the user enter and save their total trading capital to local storage, with validation and a success indicator.",
  "frontend/src/components/TotalCapitalSummary.tsx": "Displays a capital summary card showing total, deployed, available, and at-risk capital across all positions, with inline editing support and reactivity to capital changes via a custom DOM event.",
  "frontend/src/components/TradeOutcomeModal.tsx": "A dialog modal for closing a position by selecting a trade outcome (TP hit, SL hit, or manual close), entering an exit price, and saving a trade record with calculated PnL.",
  "frontend/src/components/TrendPredictionCard.tsx": "Displays AI-generated short-term and medium-term trend predictions (direction and confidence) for a given symbol using the useTrendPrediction hook.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) via React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAdjustmentSuggestions.ts": "Fetches hourly Binance kline data for each position and returns AI-generated adjustment suggestions, refreshing every 30 seconds.",
  "frontend/src/hooks/useAITradeGeneration.ts": "A React Query hook that generates AI trades for each trading modality, optionally placing live Binance market, take-profit, and stop-loss orders with per-call timeouts and toast notifications.",
  "frontend/src/hooks/useAITradeMonitoring.ts": "Polls current prices for AI trades and updates trade state (TP/SL execution, reversal detection, risk management steps) via React Query, persisting changes to localStorage and optionally placing live Binance orders.",
  "frontend/src/hooks/useAITradeStorage.ts": "Provides CRUD helpers for persisting AI daily trades in localStorage, applying default values for execution-state fields and skipping date-based invalidation.",
  "frontend/src/hooks/useBinancePairs.ts": "Fetches and caches the list of Binance perpetual futures pairs, refreshing every hour with up to 3 retries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login/logout, status tracking, and persistent identity loading via DFINITY's AuthClient.",
  "frontend/src/hooks/useLiveTradingMode.ts": "Manages live trading toggle state, validating Binance API credentials with a timeout before enabling and syncing state via custom window events.",
  "frontend/src/hooks/usePortfolioExposure.ts": "Enriches portfolio positions with live Binance prices, computing live exposure, unrealized PnL, liquidation price, and distance to liquidation, refreshed every 30 seconds.",
  "frontend/src/hooks/usePositionMonitoring.ts": "React Query hook that polls Binance every 5 seconds to fetch current prices for all tracked positions and computes PnL, distance to TP1, and distance to stop-loss for each.",
  "frontend/src/hooks/usePositionStorage.ts": "Hook managing position persistence in localStorage with optional live order placement (market, TP, SL) via Binance Futures API when live trading is enabled, using per-order timeouts and toast notifications.",
  "frontend/src/hooks/usePWAInstall.ts": "Tracks PWA installability and installation state, exposing an install function that triggers the browser's native install prompt.",
  "frontend/src/hooks/useQueries.ts": "Placeholder/stub file noting that backend canister operations are unused; exports nothing meaningful.",
  "frontend/src/hooks/useSentimentAnalysis.ts": "React Query hook that fetches 100 hourly klines from Binance Futures and runs a sentiment analysis utility, refreshing every 30 seconds.",
  "frontend/src/hooks/useTrendPrediction.ts": "React Query hook that fetches hourly and daily klines from Binance Futures and returns short-term and medium-term trend predictions, refreshing every 5 minutes.",
  "frontend/src/index.css": "Global Tailwind CSS entry point defining a golden-themed design system with OKLCH CSS custom properties for both light and dark modes, plus utility classes for animations, glow effects, and PWA adjustments.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/services/binanceApi.ts": "Service module wrapping Binance USD-M Futures public REST endpoints to fetch perpetual pairs, current prices, ticker prices, leverage brackets, and OHLCV klines.",
  "frontend/src/services/binanceOrderService.ts": "Service module for placing signed Binance Futures orders (market, take-profit, stop-loss) using HMAC-SHA256 via the Web Crypto API with a configurable request timeout.",
  "frontend/src/services/binancePositionService.ts": "Fetches open positions from Binance USD-M Futures API (/fapi/v2/positionRisk) using HMAC-SHA256 signing and maps them to the app's internal Position type with placeholder TP/SL values.",
  "frontend/src/types/adjustment.ts": "Defines TypeScript types for position adjustment suggestions (take-profit or stop-loss) and their acceptance/dismissal history.",
  "frontend/src/types/aiTrade.ts": "Defines types for AI-generated trades including trade status, modality, TP/SL levels, risk management steps, reversal detection state, and a price-enriched variant for UI consumption.",
  "frontend/src/types/binanceApi.ts": "Defines TypeScript interfaces for Binance API responses including account info, position risk, orders, credentials, and related enums/types.",
  "frontend/src/types/calculator.ts": "Defines input and result types for the position size calculator, covering capital, risk percentage, entry/stop prices, leverage, and computed metrics.",
  "frontend/src/types/exposure.ts": "Defines types for portfolio exposure analysis including per-asset exposure, long/short balance, correlation risk, and warning flags.",
  "frontend/src/types/position.ts": "Defines core position types including TakeProfitLevel, StopLossRecommendation, Position, and a price-enriched PositionWithPrice variant with PnL and distance metrics.",
  "frontend/src/types/prediction.ts": "Defines types for trend predictions (direction, confidence, time horizon) and their historical records with optional actual outcomes.",
  "frontend/src/types/reversal.ts": "Defines types for market reversal detection signals and sub-indicators including RSI divergence, EMA crossover, candlestick patterns, volatility spikes, and support/resistance violations.",
  "frontend/src/types/scenario.ts": "Defines types for scenario simulation inputs, per-position outcomes (PnL, TP/SL/liquidation hit), aggregated scenario results, and preset scenarios.",
  "frontend/src/types/sentiment.ts": "Defines types for market sentiment analysis including bullish/bearish/neutral scores, contributing factors, and strength metrics.",
  "frontend/src/types/tradeHistory.ts": "Defines types for user and AI trade history records, trade outcomes, and performance metrics including per-modality win rate and PnL breakdowns.",
  "frontend/src/utils/adjustmentSuggestions.ts": "Generates TP/SL adjustment suggestions for open positions based on market conditions such as volatility, ATR, and proximity to support/resistance levels.",
  "frontend/src/utils/aiTradeHistoryStorage.ts": "Provides localStorage-backed CRUD utilities for persisting and retrieving AI trade history records, with duplicate prevention.",
  "frontend/src/utils/aiTradeSelection.ts": "Computes technical indicators (RSI, ATR, EMA, momentum) from Binance kline data and uses per-modality configs to generate AI trade signals with TP/SL levels.",
  "frontend/src/utils/binanceAuth.ts": "Provides HMAC-SHA256 signing and an authenticated fetch wrapper for the Binance API, enforcing a 15-second timeout and throwing a typed `BinanceApiError` on timeout or failure.",
  "frontend/src/utils/exposureCalculations.ts": "Calculates portfolio exposure metrics (capital deployed, leverage, long/short balance, correlation risks, warning flags) from a list of positions with prices.",
  "frontend/src/utils/liveTradingStorage.ts": "Manages live trading mode, Binance API credentials, and per-modality live order toggles in localStorage, dispatching deferred custom DOM events on changes.",
  "frontend/src/utils/marketReversalDetector.ts": "Detects market trend reversals by analyzing Binance kline data using RSI divergence, EMA crossovers, candlestick patterns, ATR volatility spikes, and support/resistance violations across modality-specific timeframes.",
  "frontend/src/utils/performanceCalculations.ts": "Computes win rate, total PnL, and performance metrics for user and AI trade records, with per-modality breakdowns for AI trades.",
  "frontend/src/utils/pnlCalculations.ts": "Calculates leveraged PnL in USD and percentage for long/short positions, and computes the percentage distance between two price levels.",
  "frontend/src/utils/positionSizeCalculator.ts": "Calculates position size, contract count, risk amount, and reward amount based on capital, risk percentage, stop-loss, entry price, and leverage inputs.",
  "frontend/src/utils/registerServiceWorker.ts": "Registers a service worker, listens for updates with a user confirmation prompt to reload, and schedules hourly update checks.",
  "frontend/src/utils/scenarioSimulator.ts": "Defines preset market scenarios (crash, bull run, volatility) and a `simulateScenario` function that projects P&L, TP/SL hits, and liquidation risk for a list of positions given a percentage price change.",
  "frontend/src/utils/sentimentAnalysis.ts": "Implements technical indicator calculations (RSI, MACD, EMA, price action, volume trend, momentum) and an `analyzeSentiment` function that aggregates them into a structured `SentimentAnalysis` result with bullish/bearish factors.",
  "frontend/src/utils/stopLossCalculator.ts": "Calculates a recommended stop-loss price and associated loss metrics using ATR, support/resistance levels, and leverage-adjusted risk percentages, returning a `StopLossRecommendation` with reasoning and a partial-taking strategy.",
  "frontend/src/utils/takeProfitCalculator.ts": "Generates three take-profit levels (conservative, moderate, aggressive) for a position by combining volatility, leverage, and support/resistance data, returning profit amounts and reasoning for each level.",
  "frontend/src/utils/technicalAnalysis.ts": "Provides core technical analysis utilities: ATR calculation, volatility (standard deviation of returns), support/resistance detection via price clustering, and risk/reward ratio computation.",
  "frontend/src/utils/totalCapitalStorage.ts": "Manages persistence of total trading capital in localStorage and dispatches a `total-capital-change` custom DOM event on writes to enable reactive updates across components.",
  "frontend/src/utils/tradeHistoryStorage.ts": "Provides CRUD helpers for persisting user trade records (`UserTradeRecord[]`) in localStorage, including get, save (append), and clear operations.",
  "frontend/src/utils/trendPrediction.ts": "Predicts short-term (1–24 hour) and medium-term (1–7 day) price trend direction and confidence using moving averages, momentum, and volatility derived from hourly and daily price arrays.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom OKLCH-based color tokens, border radii, box shadows, accordion keyframe animations, and enabling the typography, container-queries, and animate plugins.",
  "project_state.json": "Project state document (version 53) describing a crypto trading monitoring app built with React/TypeScript/Tailwind, listing architectural notes, known bugs (frozen live trade mode, missing import button, unresponsive settings icon, etc.), and the full catalogue of existing and planned features."
}