{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend canister with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs (auto-import on load, credentials onboarding flow, periodic background sync, etc.) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of every frontend source file, used as a build-planning reference for the project's frontend architecture.",
  "frontend/index.css": "Root Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes covering background, foreground, card, sidebar, chart, and destructive color tokens.",
  "frontend/index.html": "HTML shell for the React app titled 'Crypto Position Monitor', including PWA manifest link, theme color, favicon, Apple touch icon, and mobile web app meta tags.",
  "frontend/public/manifest.json": "PWA manifest for 'Crypto Position Monitor' defining app name, icons, display mode, theme/background colors, categories, and an 'Add Position' shortcut.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first for static assets, network-first for HTML and Binance API calls, with install/activate lifecycle handlers that manage three named caches and clean up stale ones.",
  "frontend/src/App.tsx": "Root React component orchestrating tab navigation, settings dialog, and three session-scoped side effects: auto-importing Binance open positions on mount (REQ-113), auto-filling total capital from Binance account balance (REQ-117), and running a 60-second background sync interval when credentials and Live Trading mode are active.",
  "frontend/src/components/AdjustmentSuggestionCard.tsx": "Alert-style card that presents an AI-generated stop-loss or take-profit adjustment suggestion with current vs. proposed levels and accept/dismiss actions.",
  "frontend/src/components/AIDailyTradesSection.tsx": "Collapsible section component that orchestrates AI trade generation, monitoring, and display using custom hooks, showing loading skeletons, trade cards, and a force-refresh button.",
  "frontend/src/components/AIDailyTradesSummary.tsx": "Summary panel displaying aggregated AI portfolio PnL, win/loss counts, reversal guard activations, and last-updated timestamp for the current day's AI trades.",
  "frontend/src/components/AIDailyTradesTab.tsx": "Tab layout component that composes AIDailyTradesSection and PerformanceComparisonPanel into a single view.",
  "frontend/src/components/AIInsightsTab.tsx": "Tab that renders per-position AI insights including sentiment gauges, trend predictions, and dismissible adjustment suggestions for stop-loss and take-profit levels.",
  "frontend/src/components/AITradeCard.tsx": "Card component for a single AI trade showing modality badge, entry/current price, PnL, TP progress bars, risk management step tracker, reversal guard status, and live trading toggle.",
  "frontend/src/components/BinanceCredentialsPanel.tsx": "Settings panel for entering, saving, clearing, and testing Binance API credentials, with automatic position import and connection status feedback on save.",
  "frontend/src/components/CredentialStatusIndicator.tsx": "A memoized React component that displays badge indicators for API key presence and live trading mode, reactively updating via custom DOM events ('credential-change', 'live-trading-change') registered once on mount.",
  "frontend/src/components/DashboardTab.tsx": "The main dashboard tab component that renders capital summary, positions, and an onboarding alert when no Binance credentials are configured, with a button to import open positions from Binance Futures.",
  "frontend/src/components/ExposureChart.tsx": "Renders two cards showing asset allocation percentages as progress bars and a long/short balance breakdown for the current portfolio positions.",
  "frontend/src/components/InstallButton.tsx": "A PWA install button that triggers the native install prompt if available, or shows a manual instructions modal; hidden when the app is already installed as a standalone PWA.",
  "frontend/src/components/InstallInstructionsModal.tsx": "A dialog modal providing step-by-step PWA installation instructions for multiple browsers (Chrome, Safari, Edge, Firefox) on both mobile and desktop platforms.",
  "frontend/src/components/LiveRiskMetricsCard.tsx": "Displays live risk metrics per position including liquidation price and distance-to-liquidation, fetching real-time prices and leverage bracket data from Binance API via React Query with 30-second refresh intervals.",
  "frontend/src/components/LiveTradingBanner.tsx": "A memoized amber warning banner that appears at the top of the page when live trading is active, reactively listening to custom DOM events registered once on mount.",
  "frontend/src/components/LiveTradingToggle.tsx": "A toggle switch component for enabling/disabling live trading mode, featuring a confirmation dialog before activation, a 20-second outer timeout safety mechanism, and loading state indicators.",
  "frontend/src/components/PerformanceComparisonPanel.tsx": "A panel that displays side-by-side performance metrics comparing AI trades versus user trades, including win rate, PnL, and trade counts calculated from stored trade history.",
  "frontend/src/components/PortfolioExposureDashboard.tsx": "A dashboard card showing portfolio exposure metrics such as total capital deployed, capital at risk, live unrealized PnL, and live exposure, with support for enriched live-price positions.",
  "frontend/src/components/PositionCard.tsx": "A card component for displaying an individual trading position with PnL, TP/SL distances, AI-generated adjustment suggestions, sentiment gauge, trend prediction, and a trade outcome modal on deletion.",
  "frontend/src/components/PositionDashboard.tsx": "A dashboard component that renders a list of active trading positions using real-time price monitoring, showing a loading state, error alerts, or an empty state prompt to import from Binance.",
  "frontend/src/components/PositionEntryForm.tsx": "A form component for entering new trading positions, collecting symbol, type, leverage, entry price, and investment amount, then fetching historical klines to calculate take-profit levels and stop-loss before submitting a Position object.",
  "frontend/src/components/PositionRecoveryCard.tsx": "Displays recovery strategies for a losing position by calling analyzePositionRecovery, rendering each strategy with risk badges, estimated recovery percentage, and actionable steps in an accordion layout.",
  "frontend/src/components/PositionSizeCalculator.tsx": "An interactive calculator that computes optimal position size based on capital, risk percentage, entry/stop-loss prices, and leverage, with live Binance price fetching and leverage bracket validation for a selected perpetual pair.",
  "frontend/src/components/RiskManagementTab.tsx": "A tab layout component that composes LiveRiskMetricsCard, PositionSizeCalculator, PortfolioExposureDashboard, and ScenarioSimulator, conditionally showing portfolio-dependent sections only when positions exist.",
  "frontend/src/components/ScenarioSimulator.tsx": "Simulates P&L outcomes for selected or all positions under a user-defined percentage price change, with ATR-based presets derived from live klines and real-time price data fetched from Binance.",
  "frontend/src/components/SentimentGauge.tsx": "Renders a market sentiment card for a given symbol using the useSentimentAnalysis hook, displaying a bullish/bearish/neutral score, strength progress bar, and top contributing indicator factors.",
  "frontend/src/components/SettingsDialog.tsx": "A modal dialog component with three tabs (API credentials, live trading toggle, and capital input) for configuring application settings.",
  "frontend/src/components/StopLossRecommendations.tsx": "Displays stop loss details for a position including price, distance from current price, max loss, capital risk percentage, reasoning, and a partial taking strategy alert.",
  "frontend/src/components/TabNavigation.tsx": "A sticky tab navigation bar with four tabs (Dashboard, AI Daily Trades, AI Insights, Risk Management) that highlights the active tab and calls a callback on tab change.",
  "frontend/src/components/TakeProfitRecommendations.tsx": "Renders a list of take-profit level cards showing target price, distance from current price, expected profit, and reasoning, with visual indication when a level is reached.",
  "frontend/src/components/TotalCapitalInput.tsx": "A form card that lets users enter and save their total trading capital to local storage, with validation and a success toast notification.",
  "frontend/src/components/TotalCapitalSummary.tsx": "Displays a capital summary card showing total, deployed, available, and at-risk capital derived from open positions, with an inline edit mode for updating the total capital value.",
  "frontend/src/components/TradeOutcomeModal.tsx": "A dialog modal for closing a position that lets the user select a trade outcome (TP Hit, SL Hit, Manually Closed), enter an exit price, preview PnL, and save a trade record.",
  "frontend/src/components/TrendPredictionCard.tsx": "React component that displays AI-generated short-term and medium-term trend predictions (direction, confidence) for a given trading symbol using styled cards and badges.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an ICP backend actor (authenticated or anonymous) based on the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAdjustmentSuggestions.ts": "React Query hook that fetches recent hourly Binance kline data for each open position and generates trade adjustment suggestions, refreshing every 30 seconds.",
  "frontend/src/hooks/useAITradeGeneration.ts": "React Query hook that generates AI trades for multiple trading modalities, persists them, and optionally places live Binance market/TP/SL orders with per-call timeouts and toast notifications.",
  "frontend/src/hooks/useAITradeMonitoring.ts": "React Query hook that monitors active AI trades by polling current Binance prices, evaluating TP/SL crossings and reversal signals, updating trade state, and triggering trade regeneration or live orders as needed.",
  "frontend/src/hooks/useAITradeStorage.ts": "Custom hook providing localStorage CRUD operations for AI daily trades, including default-value migration for new execution-state fields and a check for whether initial trade generation is needed.",
  "frontend/src/hooks/useBinancePairs.ts": "React Query hook that fetches and caches the list of Binance perpetual trading pairs, refreshing every hour with up to 3 retries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and persisted identity state via AuthClient.",
  "frontend/src/hooks/useLiveTradingMode.ts": "React hook that manages live trading mode state, validates Binance API credentials with a timeout, and exposes a toggle function that shows toast notifications for success/failure.",
  "frontend/src/hooks/usePortfolioExposure.ts": "React hook that fetches live prices for all position symbols every 30 seconds and computes enriched position data including live exposure, unrealized PnL, liquidation price, and distance to liquidation.",
  "frontend/src/hooks/usePositionMonitoring.ts": "React hook using React Query to poll current prices for all tracked positions every 5 seconds and compute PnL and distance-to-TP/SL metrics for each.",
  "frontend/src/hooks/usePositionStorage.ts": "React hook that persists positions to localStorage and, when live trading is enabled, fires Binance Futures orders (entry, TP, SL) with per-call timeouts and toast feedback.",
  "frontend/src/hooks/usePWAInstall.ts": "React hook that tracks PWA installability and installation state, capturing the browser's beforeinstallprompt event and exposing an install() function to trigger the native prompt.",
  "frontend/src/hooks/useQueries.ts": "Placeholder/stub file that exports nothing, noting that all backend operations are handled via direct Binance API calls and no backend canister is used.",
  "frontend/src/hooks/useSentimentAnalysis.ts": "React Query hook that fetches 100 hourly klines from Binance Futures for a given symbol and returns a sentiment analysis result, refreshing every 30 seconds.",
  "frontend/src/hooks/useTrendPrediction.ts": "React Query hook that fetches hourly and daily klines from Binance Futures and returns short-term and medium-term trend predictions, refreshing every 5 minutes.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind directives and defines a golden-themed CSS custom property palette for both light and dark modes, including chart, sidebar, sentiment, and warning color tokens.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and InternetIdentity providers wrapping the root App component.",
  "frontend/src/services/binanceApi.ts": "Provides functions to interact with the Binance USD-M Futures public REST API, including fetching perpetual pairs, current prices, klines, ticker prices, and leverage bracket data.",
  "frontend/src/services/binanceOrderService.ts": "Handles placing market, take-profit, and stop-loss orders on Binance USD-M Futures using HMAC-SHA256 signed requests via the Web Crypto API.",
  "frontend/src/services/binancePositionService.ts": "Fetches open positions from the Binance USD-M Futures account via /fapi/v2/positionRisk and maps them to the app's internal Position type with placeholder TP/SL values.",
  "frontend/src/types/adjustment.ts": "Defines types for AI-suggested take-profit and stop-loss adjustment proposals, including suggestion details and history of accepted or dismissed actions.",
  "frontend/src/types/aiTrade.ts": "Defines the AITrade and AITradeWithPrice interfaces representing AI-generated trades with TP/SL levels, execution state, reversal detection, and optional Binance order IDs.",
  "frontend/src/types/binanceApi.ts": "Contains TypeScript interfaces and types for Binance API responses, including account info, position risk, orders, credentials, leverage brackets, and order IDs.",
  "frontend/src/types/calculator.ts": "Defines input and result interfaces for the position size calculator, covering capital, risk percentage, entry/stop prices, leverage, and computed risk/reward metrics.",
  "frontend/src/types/exposure.ts": "Defines types for portfolio exposure analysis, including per-asset exposure, long/short balance, correlation risks, and warning flags.",
  "frontend/src/types/position.ts": "Defines the core Position and PositionWithPrice interfaces used throughout the app, including take-profit levels, stop-loss recommendations, and live price/PnL data.",
  "frontend/src/types/prediction.ts": "Defines types for market trend predictions, including direction, confidence, time horizon, and historical prediction outcomes.",
  "frontend/src/types/recovery.ts": "Defines types for position recovery strategies (hedge, DCA, partial close, TP/SL adjustment) with associated parameters, risk levels, and actionable steps.",
  "frontend/src/types/reversal.ts": "Defines types for market reversal detection signals, including RSI divergence, EMA crossover, candlestick patterns, volatility spikes, and support/resistance violations.",
  "frontend/src/types/scenario.ts": "Defines types for what-if scenario simulation, including price change inputs, per-position outcomes (PnL, TP/SL/liquidation hits), and aggregate scenario results.",
  "frontend/src/types/sentiment.ts": "Defines types for market sentiment analysis, including bullish/bearish/neutral scores, contributing factors, and sentiment strength.",
  "frontend/src/types/tradeHistory.ts": "Defines TypeScript interfaces and types for trade history records, including UserTradeRecord, AITradeRecord, ModalityStats, and PerformanceMetrics.",
  "frontend/src/utils/adjustmentSuggestions.ts": "Analyzes market conditions (volatility, ATR, support/resistance) for open positions and generates stop-loss or take-profit adjustment suggestions with confidence scores.",
  "frontend/src/utils/aiTradeHistoryStorage.ts": "Provides localStorage CRUD helpers for persisting and retrieving AI trade history records, with duplicate-entry prevention.",
  "frontend/src/utils/aiTradeSelection.ts": "Selects and constructs AI trade signals by computing technical indicators (EMA, RSI, ATR, momentum) and SMC analysis per trading modality, with per-modality configuration for leverage, intervals, and TP/SL multipliers.",
  "frontend/src/utils/binanceAuth.ts": "Provides HMAC-SHA256 signing and an authenticated fetch wrapper for the Binance API, enforcing a 15-second timeout and throwing typed BinanceApiError on failures.",
  "frontend/src/utils/exposureCalculations.ts": "Calculates portfolio exposure metrics (capital deployed, leverage, long/short balance, correlation risks, warning flags) from a list of positions with current prices.",
  "frontend/src/utils/liveTradingStorage.ts": "Manages live trading mode, Binance credentials, and per-modality live order toggles in localStorage, dispatching deferred custom DOM events on changes.",
  "frontend/src/utils/marketReversalDetector.ts": "Detects market trend reversals using SMC-enhanced analysis including RSI divergence, EMA crossovers, candlestick patterns, ATR volatility spikes, support/resistance violations, CHOCH, breaker blocks, liquidity sweeps, and opposing FVGs across modality-specific timeframes.",
  "frontend/src/utils/performanceCalculations.ts": "Calculates win rate, total PnL, and performance metrics for user and AI trade records, including a per-modality breakdown sorted by trading modality order.",
  "frontend/src/utils/pnlCalculations.ts": "Provides utility functions to calculate leveraged PnL (USD and percent) for long/short positions and the percentage distance between current and target prices.",
  "frontend/src/utils/positionRecoveryEngine.ts": "Generates recovery strategies (hedge, DCA, partial close, TP/SL adjustment) for losing positions using ATR and support/resistance levels fetched from Binance kline data.",
  "frontend/src/utils/positionSizeCalculator.ts": "Calculates optimal position size, contract count, risk/reward amounts, and risk-reward ratio based on capital, risk percentage, entry price, stop-loss, and leverage inputs.",
  "frontend/src/utils/registerServiceWorker.ts": "Registers a service worker for the app, handles update detection with a user confirmation prompt, and schedules hourly update checks.",
  "frontend/src/utils/scenarioSimulator.ts": "Simulates the impact of price change scenarios (e.g., market crash, bull run) on a set of positions, computing projected PnL and flagging TP hits, SL hits, and liquidation risk.",
  "frontend/src/utils/sentimentAnalysis.ts": "Analyzes market sentiment by combining technical indicators (RSI, MACD, volume trend, price action, momentum) with SMC concepts like swing points, BOS, FVGs, liquidity zones, and Wyckoff phase estimation.",
  "frontend/src/utils/smcAnalysis.ts": "Core Smart Money Concepts (SMC) analysis library providing detection utilities for swing points, BOS, CHOCH, order blocks, fair value gaps, liquidity zones, Wyckoff phases, and manipulation signals using Binance kline data.",
  "frontend/src/utils/stopLossCalculator.ts": "Calculates institutional-grade stop-loss prices using SMC analysis (swept liquidity zones, order blocks, ATR), then enforces a capital risk cap of 0.5%–2% of investment adjusted for leverage.",
  "frontend/src/utils/takeProfitCalculator.ts": "Calculates three tiered take-profit levels using SMC structures (FVGs, order blocks, swing highs/lows) with ATR-based fallbacks, computing profit in USD and percent for a given position.",
  "frontend/src/utils/technicalAnalysis.ts": "Provides basic technical analysis helpers including ATR calculation, volatility (std dev of returns), support/resistance clustering, and risk-reward ratio computation.",
  "frontend/src/utils/totalCapitalStorage.ts": "Manages total trading capital persistence in localStorage and dispatches a custom DOM event ('total-capital-change') on every write to enable reactive UI updates.",
  "frontend/src/utils/tradeHistoryStorage.ts": "Handles CRUD operations for user trade history records stored in localStorage, supporting retrieval, appending, and clearing of trade records.",
  "frontend/src/utils/trendPrediction.ts": "Predicts short-term (1–24h) and medium-term (1–7d) price trend direction and confidence using moving average trends, momentum, and volatility derived from hourly and daily price arrays.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, custom OKLCH-based color tokens (including sidebar, chart, warning, destructive), border radius, fonts, box shadows, accordion animations, and plugins (tailwindcss-animate, typography, container-queries).",
  "project_state.json": "Project state manifest (version 63) describing a crypto trading monitoring app with AI-powered TP/SL recommendations, listing architectural notes, known issues (frozen live trade mode, missing UI elements, limited pair lists), and existing feature IDs."
}