{
  "backend/main.mo": "Empty Motoko actor serving as the backend canister placeholder with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting the requirement to remove the PositionEntryForm component from DashboardTab.tsx while keeping the file itself, with high confidence and test ID REQ-93.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their roles, key exports, and notable implementation details for build planning reference.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark theme tokens including colors, borders, sidebar, and chart variables.",
  "frontend/index.html": "HTML entry point for the Crypto Position Monitor PWA, including manifest link, theme color, Apple touch icon, and mobile web app meta tags.",
  "frontend/public/manifest.json": "PWA manifest for Crypto Position Monitor defining app name, icons, display mode, theme colors, categories, and an 'Add Position' shortcut.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first for static assets, network-first for HTML and Binance API calls, with install/activate lifecycle cache management.",
  "frontend/src/App.tsx": "Root React component managing tab navigation, position storage, monitoring, and portfolio exposure, rendering Dashboard, AI Trades, AI Insights, Risk Management tabs, and a settings dialog.",
  "frontend/src/components/AdjustmentSuggestionCard.tsx": "Displays an AI-generated stop-loss or take-profit adjustment suggestion with current vs. proposed levels, confidence badge, and accept/dismiss actions.",
  "frontend/src/components/AIDailyTradesSection.tsx": "Collapsible section component that fetches AI-generated daily trades via React Query, monitors live prices, and renders trade cards with loading skeletons and a force-refresh option.",
  "frontend/src/components/AIDailyTradesSummary.tsx": "Displays a summary panel for today's AI trading portfolio, showing total PnL (USD and %), winning/losing trade counts, and the number of reversal guard activations pulled from trade history storage.",
  "frontend/src/components/AIDailyTradesTab.tsx": "A simple tab layout component that renders the AIDailyTradesSection and PerformanceComparisonPanel side by side in a vertical stack.",
  "frontend/src/components/AIInsightsTab.tsx": "Renders AI insights for open positions, including sentiment gauges, trend predictions, and dismissible adjustment suggestions; shows an empty state when no positions exist.",
  "frontend/src/components/AITradeCard.tsx": "A detailed card component for a single AI trade, displaying modality, risk management step progress, TP/SL levels, PnL, reversal guard status, and a live-trading toggle with order state.",
  "frontend/src/components/BinanceCredentialsPanel.tsx": "A settings panel for entering, saving, clearing, and testing Binance API credentials, with connection status feedback and timeout handling.",
  "frontend/src/components/CredentialStatusIndicator.tsx": "A memoized badge indicator that reactively shows whether Binance API credentials are saved and whether live trading mode is active, listening to custom DOM events for updates.",
  "frontend/src/components/DashboardTab.tsx": "Renders the main dashboard tab with a capital summary, open positions list, and a button to import live positions from Binance when credentials are available.",
  "frontend/src/components/ExposureChart.tsx": "Displays two cards showing asset allocation percentages and long/short balance as progress bars based on provided exposure and capital data.",
  "frontend/src/components/InstallButton.tsx": "Renders a PWA install button that triggers the native install prompt if available, or shows a manual instructions modal otherwise; hidden when already installed.",
  "frontend/src/components/InstallInstructionsModal.tsx": "Shows a dialog with step-by-step PWA installation instructions for multiple browsers (Chrome, Safari, Edge, Firefox) on both mobile and desktop.",
  "frontend/src/components/LiveRiskMetricsCard.tsx": "Fetches live prices and leverage bracket data from Binance to compute and display per-position liquidation prices, distances, and risk levels (safe/warning/danger).",
  "frontend/src/components/LiveTradingBanner.tsx": "Displays an amber warning banner when live trading is active, reactively updating via custom DOM events without requiring a page reload.",
  "frontend/src/components/LiveTradingToggle.tsx": "Provides a toggle switch to enable/disable live trading mode, showing a confirmation dialog before activation and enforcing a 20-second timeout safety cutoff.",
  "frontend/src/components/PerformanceComparisonPanel.tsx": "Renders a side-by-side performance comparison panel between AI trades and user trades, displaying metrics like win rate, PnL, and trade counts sourced from local storage utilities.",
  "frontend/src/components/PortfolioExposureDashboard.tsx": "Displays a portfolio exposure dashboard card showing total capital deployed, capital at risk, live unrealized PnL, and live exposure, with support for enriched live-price positions.",
  "frontend/src/components/PositionCard.tsx": "Renders an individual trading position card with PnL display, TP/SL proximity alerts, AI insights collapsible section, adjustment suggestions, and a trade outcome modal triggered on deletion.",
  "frontend/src/components/PositionDashboard.tsx": "Displays the list of active trading positions by fetching live price data via a monitoring hook and rendering a PositionCard for each, with loading, error, and empty-state handling.",
  "frontend/src/components/PositionEntryForm.tsx": "Provides a form for manually entering a new trading position, fetching historical klines to auto-calculate take-profit levels and stop-loss before submitting the constructed position object.",
  "frontend/src/components/PositionSizeCalculator.tsx": "A React component that calculates optimal position sizes based on capital, risk percentage, entry/stop-loss prices, and leverage, with live Binance price fetching and leverage bracket validation.",
  "frontend/src/components/RiskManagementTab.tsx": "A tab layout component that composes LiveRiskMetricsCard, PositionSizeCalculator, PortfolioExposureDashboard, and ScenarioSimulator into a unified risk management view, conditionally rendering exposure data based on whether positions exist.",
  "frontend/src/components/ScenarioSimulator.tsx": "A component that simulates portfolio P&L under user-defined or ATR-based price change scenarios, fetching live prices and kline data from Binance to enrich positions before running the simulation.",
  "frontend/src/components/SentimentGauge.tsx": "Displays a market sentiment card for a given symbol showing bullish/bearish/neutral score, strength percentage, and contributing indicator factors sourced from the useSentimentAnalysis hook.",
  "frontend/src/components/SettingsDialog.tsx": "A modal dialog with three tabs for configuring Binance API credentials, enabling live trading mode, and setting total capital for risk calculations.",
  "frontend/src/components/StopLossRecommendations.tsx": "Renders a stop-loss recommendation card showing the stop price, distance from current price, max loss in USD/percent, capital risk, reasoning, and a partial-taking strategy alert.",
  "frontend/src/components/TabNavigation.tsx": "A sticky top navigation bar that renders four app tabs (Dashboard, AI Daily Trades, AI Insights, Risk Management) with active-state highlighting and responsive label truncation.",
  "frontend/src/components/TakeProfitRecommendations.tsx": "Renders a list of take-profit level cards for a trading position, showing target price, distance from current price, expected profit, and whether each level has been reached.",
  "frontend/src/components/TotalCapitalInput.tsx": "A form card component that lets users enter and save their total trading capital to local storage, with validation and success feedback.",
  "frontend/src/components/TotalCapitalSummary.tsx": "Displays a summary card of total, deployed, available, and at-risk capital across all positions, with inline editing support and reactivity to capital changes via a custom DOM event.",
  "frontend/src/components/TradeOutcomeModal.tsx": "A dialog modal for closing a position by recording its outcome (TP hit, SL hit, or manually closed) and exit price, then computing and saving the resulting PnL as a trade history record.",
  "frontend/src/components/TrendPredictionCard.tsx": "Displays AI-generated short-term and medium-term trend predictions (direction and confidence) for a given symbol using the useTrendPrediction hook.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, invalidating dependent queries whenever the actor changes due to identity updates.",
  "frontend/src/hooks/useAdjustmentSuggestions.ts": "Fetches recent hourly kline data from Binance for each position and generates trade adjustment suggestions, refreshing every 30 seconds.",
  "frontend/src/hooks/useAITradeGeneration.ts": "A React Query hook that generates AI trades for each trading modality, optionally placing live Binance market, take-profit, and stop-loss orders with per-call timeouts, and persists trades to local storage.",
  "frontend/src/hooks/useAITradeMonitoring.ts": "Polls current prices for AI trades and updates trade state (TP/SL execution, reversal detection, risk management steps) via React Query, persisting changes to localStorage and optionally placing live Binance orders.",
  "frontend/src/hooks/useAITradeStorage.ts": "Provides CRUD helpers for persisting AI daily trades in localStorage, applying default values for execution-state fields and checking whether initial trade generation is needed.",
  "frontend/src/hooks/useBinancePairs.ts": "Fetches and caches the list of Binance perpetual futures pairs via React Query with a 1-hour stale time.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login/logout functionality, delegation validation, and status tracking, wrapping DFINITY's AuthClient.",
  "frontend/src/hooks/useLiveTradingMode.ts": "Manages live trading toggle state, validating Binance API credentials with a timeout before enabling, and syncing state via custom window events.",
  "frontend/src/hooks/usePortfolioExposure.ts": "Enriches portfolio positions with live Binance prices to compute live exposure, unrealized PnL, liquidation price, and distance to liquidation, refreshing every 30 seconds.",
  "frontend/src/hooks/usePositionMonitoring.ts": "React Query hook that polls current prices for all tracked positions every 5 seconds and computes PnL, distance to TP1, and distance to stop-loss for each.",
  "frontend/src/hooks/usePositionStorage.ts": "Hook managing position persistence in localStorage with optional live order placement (market, TP, SL) via Binance Futures API when live trading is enabled, using per-order timeouts and toast notifications.",
  "frontend/src/hooks/usePWAInstall.ts": "Tracks PWA installability and installation state by listening to browser beforeinstallprompt and appinstalled events, and exposes an install trigger function.",
  "frontend/src/hooks/useQueries.ts": "Placeholder/empty module acknowledging that no backend canister is used; all data operations go directly to Binance APIs.",
  "frontend/src/hooks/useSentimentAnalysis.ts": "React Query hook that fetches 100 hourly klines from Binance Futures and runs a sentiment analysis utility, refreshing every 30 seconds.",
  "frontend/src/hooks/useTrendPrediction.ts": "React Query hook that fetches hourly and daily klines from Binance Futures and returns short-term and medium-term trend predictions, refreshing every 5 minutes.",
  "frontend/src/index.css": "Global stylesheet configuring Tailwind base/components/utilities, defining a golden OKLCH color theme with light and dark mode CSS variables, and adding PWA/utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/services/binanceApi.ts": "Service module wrapping Binance USD-M Futures public REST endpoints for fetching perpetual pairs, current prices, ticker prices, leverage brackets, and OHLCV klines.",
  "frontend/src/services/binanceOrderService.ts": "Service module for placing signed Binance Futures orders (market, take-profit, stop-loss) using HMAC-SHA256 via Web Crypto API with a configurable request timeout.",
  "frontend/src/services/binancePositionService.ts": "Fetches open USD-M Futures positions from Binance's /fapi/v2/positionRisk endpoint using HMAC-SHA256 signing, then maps the results to the app's internal Position type with placeholder TP/SL values.",
  "frontend/src/types/adjustment.ts": "Defines TypeScript types for position adjustment suggestions (take-profit or stop-loss) and their acceptance/dismissal history.",
  "frontend/src/types/aiTrade.ts": "Defines types for AI-generated trades including status, trading modality, TP/SL levels, risk management steps, reversal detection state, and an enriched variant with live price and PnL data.",
  "frontend/src/types/binanceApi.ts": "Defines TypeScript interfaces for Binance Futures API responses including account info, position risk, orders, leverage brackets, and related enums/types.",
  "frontend/src/types/calculator.ts": "Defines input and result types for a position size calculator covering capital, risk percentage, entry/stop prices, leverage, and computed risk/reward metrics.",
  "frontend/src/types/exposure.ts": "Defines types for portfolio exposure analysis including per-asset exposure, long/short balance, correlation risk, and aggregate portfolio metrics with warning flags.",
  "frontend/src/types/position.ts": "Defines core Position types including take-profit levels, stop-loss recommendations, and a price-enriched variant with PnL and distance-to-TP/SL fields.",
  "frontend/src/types/prediction.ts": "Defines types for trend predictions (direction, confidence, time horizon) and their historical records with optional actual outcomes.",
  "frontend/src/types/reversal.ts": "Defines types for market reversal detection signals and supporting indicators including RSI divergence, EMA crossover, candlestick patterns, volatility spikes, and support/resistance violations.",
  "frontend/src/types/scenario.ts": "Defines types for what-if scenario analysis, including inputs, per-position outcomes (PnL, TP/SL/liquidation hit), aggregate results, and named scenario presets.",
  "frontend/src/types/sentiment.ts": "Defines types for market sentiment analysis including a bullish/bearish/neutral score, strength value, and contributing indicator factors.",
  "frontend/src/types/tradeHistory.ts": "Defines types for user and AI trade history records, including outcomes, PnL, and performance metrics with optional per-modality breakdowns.",
  "frontend/src/utils/adjustmentSuggestions.ts": "Generates dynamic TP/SL adjustment suggestions for open positions based on ATR-derived volatility, support/resistance proximity, and price movement analysis.",
  "frontend/src/utils/aiTradeHistoryStorage.ts": "Provides localStorage-backed CRUD utilities for persisting and retrieving AI trade history records, with duplicate-entry prevention.",
  "frontend/src/utils/aiTradeSelection.ts": "Selects and constructs AI trade signals for various trading modalities by computing technical indicators (RSI, EMA, ATR, momentum) from Binance kline data and applying per-modality TP/SL multipliers.",
  "frontend/src/utils/binanceAuth.ts": "Provides HMAC-SHA256 signing and an authenticated fetch wrapper for the Binance API, enforcing a 15-second timeout and throwing a typed `BinanceApiError` on timeout or failure.",
  "frontend/src/utils/exposureCalculations.ts": "Calculates portfolio exposure metrics (capital deployed, leverage, PnL, long/short balance, correlation risks, and warning flags) from a list of positions with prices.",
  "frontend/src/utils/liveTradingStorage.ts": "Manages live trading mode, Binance API credentials, and per-modality live order toggles in localStorage, dispatching deferred custom DOM events on changes.",
  "frontend/src/utils/marketReversalDetector.ts": "Detects market trend reversals by analyzing Binance kline data using RSI divergence, EMA crossovers, candlestick patterns, ATR volatility spikes, and support/resistance violations across modality-specific timeframes.",
  "frontend/src/utils/performanceCalculations.ts": "Computes win rate, total PnL, and performance metrics for user and AI trade records, with per-modality breakdowns for AI trades.",
  "frontend/src/utils/pnlCalculations.ts": "Calculates leveraged PnL in USD and percentage for long/short positions, and computes the percentage distance between two price levels.",
  "frontend/src/utils/positionSizeCalculator.ts": "Calculates position size, contract count, risk/reward amounts, and risk-reward ratio given capital, risk percentage, stop-loss, entry price, and leverage.",
  "frontend/src/utils/registerServiceWorker.ts": "Registers a service worker, listens for updates with a user confirmation prompt to reload, and schedules hourly update checks.",
  "frontend/src/utils/scenarioSimulator.ts": "Defines preset market scenarios (crash, bull run, volatility) and a `simulateScenario` function that projects P&L, TP/SL hits, and liquidation risk for a list of positions given a percentage price change.",
  "frontend/src/utils/sentimentAnalysis.ts": "Implements technical indicator calculations (RSI, MACD, EMA, price action, volume trend, momentum) and an `analyzeSentiment` function that aggregates them into a `SentimentAnalysis` result with bullish/bearish factors.",
  "frontend/src/utils/stopLossCalculator.ts": "Calculates a recommended stop-loss price and associated loss metrics using ATR, support/resistance levels, and leverage-adjusted risk percentages, returning a `StopLossRecommendation` with reasoning and partial-taking strategy.",
  "frontend/src/utils/takeProfitCalculator.ts": "Generates three take-profit levels (conservative, moderate, aggressive) for a position by combining volatility, support/resistance levels, and leverage factors, returning an array of `TakeProfitLevel` objects with profit calculations and reasoning.",
  "frontend/src/utils/technicalAnalysis.ts": "Provides core technical analysis helpers: ATR calculation, volatility (std dev of returns), support/resistance detection via price clustering, and risk/reward ratio computation.",
  "frontend/src/utils/totalCapitalStorage.ts": "Manages persistence of total trading capital in localStorage and dispatches a `total-capital-change` custom DOM event on writes to enable reactive UI updates.",
  "frontend/src/utils/tradeHistoryStorage.ts": "Provides CRUD helpers for persisting user trade records (`UserTradeRecord`) in localStorage, including get, save (append), and clear operations.",
  "frontend/src/utils/trendPrediction.ts": "Predicts short-term (1–24 hour) and medium-term (1–7 day) price trend direction and confidence using moving averages, momentum, and volatility derived from hourly and daily price arrays.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom colors (using oklch variables), border radii, box shadows, accordion animations, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state tracking file (version 51) describing a crypto trading monitoring app built with React/TypeScript/Tailwind, documenting architectural notes, known issues, and a list of existing implemented features."
}