{
  "backend/main.mo": "Empty Motoko actor serving as the backend canister placeholder with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report listing implemented features with their associated files, components, test IDs, and confidence levels for the crypto trading app.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short descriptions summarizing each file's purpose and key exports.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, chart, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the Crypto Position Monitor PWA, including manifest link, theme color, Apple touch icon, and mobile web app meta tags.",
  "frontend/public/manifest.json": "PWA manifest for Crypto Position Monitor defining app name, icons, display mode, theme color, and an 'Add Position' shortcut.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first for static assets, network-first for HTML and Binance API calls, and cache cleanup on activation.",
  "frontend/src/App.tsx": "Root React component managing tab navigation, settings dialog open state via useState, position storage/monitoring hooks, and rendering the header, banners, and tab content areas.",
  "frontend/src/components/AdjustmentSuggestionCard.tsx": "Alert-style card that presents an AI-generated stop-loss or take-profit adjustment suggestion with accept and dismiss actions.",
  "frontend/src/components/AIDailyTradesSection.tsx": "Collapsible section component that displays AI-generated daily trades using React Query hooks for trade generation, monitoring, and storage, with loading skeletons and a force-refresh button.",
  "frontend/src/components/AIDailyTradesSummary.tsx": "Summary panel showing aggregated AI portfolio PnL, win/loss counts, and reversal guard activations for the current day based on active trades and trade history.",
  "frontend/src/components/AIDailyTradesTab.tsx": "Tab layout component that composes AIDailyTradesSection and PerformanceComparisonPanel into a single view.",
  "frontend/src/components/AIInsightsTab.tsx": "Tab component that renders per-position AI insights including sentiment gauges, trend predictions, and dismissible adjustment suggestions for a list of positions.",
  "frontend/src/components/AITradeCard.tsx": "Card component that displays detailed information for a single AI trade, including modality badge, risk management step progress, TP/SL levels, PnL, and status badges including reversal guard.",
  "frontend/src/components/BinanceCredentialsPanel.tsx": "Form panel for saving, clearing, and testing Binance API credentials, with connection status feedback and a timeout-aware authenticated test request to the Binance Futures API.",
  "frontend/src/components/CredentialStatusIndicator.tsx": "A memoized React component that displays badge indicators for API key presence and live trading mode, reactively updating via custom DOM events ('credential-change', 'live-trading-change') without page reload.",
  "frontend/src/components/DashboardTab.tsx": "The main dashboard tab component that renders capital summary, open positions, and a position entry form, with a Binance import button that appears when API credentials are available.",
  "frontend/src/components/ExposureChart.tsx": "Renders two cards showing asset allocation percentages and long/short balance as progress bars, based on exposure and capital data passed as props.",
  "frontend/src/components/InstallButton.tsx": "A PWA install button that triggers the native install prompt if available, or shows a manual instructions modal for browsers that don't support it; hidden when the app is already installed.",
  "frontend/src/components/InstallInstructionsModal.tsx": "A dialog modal that provides step-by-step PWA installation instructions for multiple browsers (Chrome, Safari, Edge, Firefox), each with icons and numbered steps.",
  "frontend/src/components/LiveTradingBanner.tsx": "A memoized amber warning banner that appears at the top of the page when live trading is active, listening to custom DOM events to update reactively.",
  "frontend/src/components/LiveTradingToggle.tsx": "A toggle switch component for enabling/disabling live trading mode, featuring a confirmation dialog before activation, a loading state with a 20-second outer timeout safety guard, and toast error notifications.",
  "frontend/src/components/PerformanceComparisonPanel.tsx": "Renders a side-by-side performance comparison panel between AI trades and user trades, displaying metrics like win rate, PnL, and trade counts sourced from local storage utilities.",
  "frontend/src/components/PortfolioExposureDashboard.tsx": "Displays a portfolio exposure dashboard card showing deployed capital percentage and capital-at-risk metrics, reactively updating when total capital changes via a custom DOM event.",
  "frontend/src/components/PositionCard.tsx": "Renders an individual trading position card with PnL display, TP/SL proximity indicators, AI insights collapsible section, adjustment suggestions, and a trade outcome modal triggered on deletion.",
  "frontend/src/components/PositionDashboard.tsx": "Manages and displays the list of active trading positions using real-time price monitoring, showing an empty state prompt or a grid of PositionCard components with add/delete/update controls.",
  "frontend/src/components/PositionEntryForm.tsx": "Provides a form for creating a new trading position by collecting symbol, type, leverage, entry price, and investment amount, then fetching historical klines to auto-calculate take-profit and stop-loss levels.",
  "frontend/src/components/PositionSizeCalculator.tsx": "A React component that calculates optimal position sizes based on capital, risk percentage, entry price, stop loss price, and leverage, with results displayed in real-time and an optional apply callback.",
  "frontend/src/components/RiskManagementTab.tsx": "A tab layout component that composes the PositionSizeCalculator, PortfolioExposureDashboard, and ScenarioSimulator into a single risk management view, showing a placeholder when no positions exist.",
  "frontend/src/components/ScenarioSimulator.tsx": "A component that simulates portfolio P&L impact for custom or preset market price change scenarios using a slider and preset buttons, with liquidation risk and high-loss warnings.",
  "frontend/src/components/SentimentGauge.tsx": "Displays market sentiment (bullish/bearish/neutral) for a given symbol using a score badge, strength progress bar, and a list of contributing indicator factors fetched via a custom hook.",
  "frontend/src/components/SettingsDialog.tsx": "A modal dialog with three tabs for configuring Binance API credentials, enabling live trading mode, and setting total capital for risk calculations.",
  "frontend/src/components/StopLossRecommendations.tsx": "Renders stop loss details for a position including price, distance percentage, max loss, capital risk, reasoning, and a partial-taking strategy, with a visual warning when price is near the stop loss.",
  "frontend/src/components/TabNavigation.tsx": "A sticky top navigation bar that renders four app tabs (Dashboard, AI Daily Trades, AI Insights, Risk Management) with active state highlighting and responsive label truncation.",
  "frontend/src/components/TakeProfitRecommendations.tsx": "Renders a list of take-profit level cards showing target price, distance from current price, expected profit, and whether each level has been reached, for a given position type.",
  "frontend/src/components/TotalCapitalInput.tsx": "A form card that lets the user enter and save their total trading capital to local storage, with validation and a success toast notification.",
  "frontend/src/components/TotalCapitalSummary.tsx": "Displays a capital summary card showing total, deployed, available, and at-risk capital across all positions, with inline editing support and reactivity to capital changes via a custom DOM event.",
  "frontend/src/components/TradeOutcomeModal.tsx": "A dialog modal for closing a position by selecting a trade outcome (TP hit, SL hit, or manual close), entering an exit price, and saving a computed PnL record to trade history.",
  "frontend/src/components/TrendPredictionCard.tsx": "Displays AI-generated short-term and medium-term trend predictions (direction and confidence) for a given symbol using the useTrendPrediction hook.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an ICP backend actor via React Query, using the current Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAdjustmentSuggestions.ts": "React Query hook that fetches hourly Binance kline data for each position and generates trade adjustment suggestions, refreshing every 30 seconds.",
  "frontend/src/hooks/useAITradeGeneration.ts": "A React Query hook that generates AI trades for each trading modality, persists them via storage, and optionally places live Binance market, take-profit, and stop-loss orders with per-call timeouts and toast feedback.",
  "frontend/src/hooks/useAITradeMonitoring.ts": "React Query hook that polls current prices for AI trades, updates TP/SL execution state, detects market reversals, and persists trade state to localStorage with daily scoping.",
  "frontend/src/hooks/useAITradeStorage.ts": "Hook providing CRUD helpers (getTrades, saveTrades, clearTrades, checkAndResetDaily) for persisting AI trades in localStorage, with backward-compatible default field values.",
  "frontend/src/hooks/useBinancePairs.ts": "Thin React Query hook that fetches and caches Binance perpetual futures pairs for one hour with up to 3 retries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY AuthClient login/logout state and persisting identity across page reloads.",
  "frontend/src/hooks/useLiveTradingMode.ts": "Hook that manages live trading toggle state, validates Binance Futures API credentials with a timeout before enabling, and syncs state via custom window events.",
  "frontend/src/hooks/usePortfolioExposure.ts": "Memoized hook that computes portfolio exposure metrics from a list of positions with prices using calculatePortfolioExposure.",
  "frontend/src/hooks/usePositionMonitoring.ts": "React Query hook that fetches live prices for all positions every 5 seconds and computes PnL and distance-to-TP/SL for each.",
  "frontend/src/hooks/usePositionStorage.ts": "Custom hook that persists trading positions to localStorage and optionally places live market, take-profit, and stop-loss orders on Binance Futures with per-call timeouts and toast notifications.",
  "frontend/src/hooks/usePWAInstall.ts": "Hook that captures the browser's beforeinstallprompt event to expose PWA installability state and an install() trigger function.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file that exports nothing; notes that all backend operations are handled via direct Binance API calls and the backend canister is unused.",
  "frontend/src/hooks/useSentimentAnalysis.ts": "React Query hook that fetches 100 hourly klines from Binance Futures and returns a sentiment analysis result, refreshing every 30 seconds.",
  "frontend/src/hooks/useTrendPrediction.ts": "React Query hook that fetches hourly and daily klines from Binance Futures and returns short-term and medium-term trend predictions, refreshing every 5 minutes.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind directives, defines light and dark golden-themed CSS custom properties (OKLCH), and adds utility classes for animations, glow effects, and PWA standalone mode.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/services/binanceApi.ts": "Service module providing functions to fetch Binance USD-M Futures perpetual pairs, current prices, and OHLCV klines, plus a helper to extract close prices from kline data.",
  "frontend/src/services/binanceOrderService.ts": "Service that places MARKET, TAKE_PROFIT_MARKET, and STOP_MARKET orders on Binance USD-M Futures using HMAC-SHA256 signing via the Web Crypto API with a 15-second request timeout.",
  "frontend/src/services/binancePositionService.ts": "Service that fetches open positions from Binance USD-M Futures (/fapi/v2/positionRisk), signs requests with HMAC-SHA256, and maps non-zero positions to the app's internal Position type with placeholder TP/SL levels.",
  "frontend/src/types/adjustment.ts": "TypeScript type definitions for trade adjustment suggestions (take-profit or stop-loss) and their acceptance/dismissal history.",
  "frontend/src/types/aiTrade.ts": "Defines TypeScript types for AI-managed trades, including trade status, trading modality, risk management steps, TP/SL execution state, reversal detection state, and a price-enriched variant for UI consumption.",
  "frontend/src/types/binanceApi.ts": "Defines TypeScript interfaces and types for Binance Futures API responses, including account info, positions, orders, assets, and order ID tracking.",
  "frontend/src/types/calculator.ts": "Defines input and result interfaces for a position size calculator, covering capital, risk, entry/stop prices, leverage, and computed risk/reward metrics.",
  "frontend/src/types/exposure.ts": "Defines interfaces for portfolio exposure analysis, including per-asset exposure, long/short balance, correlation risk, and warning flags.",
  "frontend/src/types/position.ts": "Defines interfaces for trading positions, including take-profit levels, stop-loss recommendations, and a price-enriched variant with PnL and distance metrics.",
  "frontend/src/types/prediction.ts": "Defines types for trend predictions, including direction, confidence, time horizon, and historical prediction records with optional actual outcomes.",
  "frontend/src/types/reversal.ts": "Defines TypeScript interfaces for market reversal detection signals and supporting indicators such as RSI divergence, EMA crossover, candlestick patterns, volatility spikes, and support/resistance violations.",
  "frontend/src/types/scenario.ts": "Defines interfaces for scenario analysis, including percentage-change inputs, per-position outcome projections, aggregate scenario results, and preset scenarios.",
  "frontend/src/types/sentiment.ts": "Defines types for market sentiment analysis, including sentiment score, individual contributing factors, and an aggregate analysis with strength and timestamp.",
  "frontend/src/types/tradeHistory.ts": "Defines interfaces for user and AI trade history records, modality-level statistics, and overall performance metrics including win rate and PnL.",
  "frontend/src/utils/adjustmentSuggestions.ts": "Generates stop-loss and take-profit adjustment suggestions for open positions based on ATR-derived volatility, 24h price change, and proximity to support/resistance levels.",
  "frontend/src/utils/aiTradeHistoryStorage.ts": "Provides localStorage-backed CRUD utilities for persisting AI trade history records, with duplicate-entry prevention on save.",
  "frontend/src/utils/aiTradeSelection.ts": "Computes technical indicators (EMA, RSI, ATR, momentum) from Binance kline data and uses modality-specific configs to generate AI trade signals with TP/SL levels.",
  "frontend/src/utils/binanceAuth.ts": "Provides HMAC-SHA256 signed authenticated fetch for the Binance API with a 15-second timeout, combined abort signal support, and a typed BinanceApiError for timeout and failure cases.",
  "frontend/src/utils/exposureCalculations.ts": "Calculates portfolio-level exposure metrics including total capital deployed, weighted average leverage, long/short balance, per-asset exposure breakdown, correlated position risks, and warning flags from a list of positions with prices.",
  "frontend/src/utils/liveTradingStorage.ts": "Manages live trading mode toggle and Binance API credentials in localStorage, dispatching deferred custom DOM events on changes and providing legacy aliases for backward compatibility.",
  "frontend/src/utils/marketReversalDetector.ts": "Detects market trend reversals by analyzing Binance kline data using RSI divergence, EMA crossovers, candlestick patterns, ATR volatility spikes, and support/resistance violations, with timeframes configured per trading modality.",
  "frontend/src/utils/performanceCalculations.ts": "Computes win rate, total PnL, and performance metrics for user and AI trade records, with the AI variant also producing a per-modality breakdown sorted in a defined order.",
  "frontend/src/utils/pnlCalculations.ts": "Provides two pure functions: one to calculate leveraged PnL in USD and percent for long or short positions, and one to calculate the percentage distance between a current price and a target price.",
  "frontend/src/utils/positionSizeCalculator.ts": "Calculates position size, contract count, risk amount, reward amount, and risk-reward ratio from capital, risk percentage, stop-loss price, entry price, and leverage inputs.",
  "frontend/src/utils/registerServiceWorker.ts": "Registers a service worker at '/service-worker.js', listens for updates and prompts the user to reload, and schedules hourly update checks.",
  "frontend/src/utils/scenarioSimulator.ts": "Simulates the impact of a percentage price change across all open positions, determining projected PnL, TP/SL hits, and liquidation risk for each position, and aggregating total portfolio impact.",
  "frontend/src/utils/sentimentAnalysis.ts": "Derives market sentiment (bullish/bearish/neutral) from close prices and volumes by computing RSI, MACD, price action trend, volume trend, and momentum, then aggregating the signals into a weighted sentiment score with contributing factors.",
  "frontend/src/utils/stopLossCalculator.ts": "Calculates a stop-loss price and associated risk metrics for a leveraged position using ATR, support/resistance levels, and a base risk percentage that tightens with higher leverage.",
  "frontend/src/utils/takeProfitCalculator.ts": "Generates three take-profit levels for a leveraged position by combining volatility, support/resistance clusters, and leverage-adjusted multipliers, returning price, profit USD, and reasoning for each level.",
  "frontend/src/utils/technicalAnalysis.ts": "Provides core technical analysis helpers: ATR calculation, volatility (std dev of returns), support/resistance detection via price clustering, and risk/reward ratio computation.",
  "frontend/src/utils/totalCapitalStorage.ts": "Manages total trading capital in localStorage and dispatches a custom DOM event ('total-capital-change') on every write so dependent components can reactively update.",
  "frontend/src/utils/tradeHistoryStorage.ts": "Provides CRUD helpers for persisting user trade records in localStorage, including get, save (append), and clear operations.",
  "frontend/src/utils/trendPrediction.ts": "Predicts short-term (1–24 h) and medium-term (1–7 day) price trend direction and confidence using moving averages, momentum, and volatility derived from hourly and daily price arrays.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based design tokens (colors, border radius, shadows, animations), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state manifest (version 45) documenting the app's architecture, existing features, and known bugs including unresponsive settings UI, Live Trade Mode freeze, and missing Import from Binance button."
}