{
  "backend/main.mo": "Empty Motoko actor serving as the backend canister placeholder with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report listing implemented features with their IDs, titles, associated source files, components, test IDs, and confidence levels for the AI trading monitor and related UI functionality.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short summaries describing each file's purpose, used as a build planning reference for the frontend codebase.",
  "frontend/index.css": "Root Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes including colors, borders, charts, and sidebar tokens.",
  "frontend/index.html": "HTML entry point for the Crypto Position Monitor PWA, setting up viewport, manifest, theme color, icons, and mounting the React app at #root.",
  "frontend/public/manifest.json": "PWA web app manifest defining the app name, icons, display mode, theme/background colors, categories, and an 'Add Position' shortcut.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first for static assets, network-first for HTML and Binance API calls, with install/activate lifecycle handlers and dynamic cache management.",
  "frontend/src/App.tsx": "Root React component managing tab navigation, settings dialog, auto-import of Binance open positions, auto-fill of total capital from account balance, and wiring position storage/monitoring hooks to child tab components.",
  "frontend/src/components/AdjustmentSuggestionCard.tsx": "Card component that presents a single AI-generated take-profit or stop-loss adjustment suggestion with current vs. proposed levels, confidence badge, reasoning, and accept/dismiss actions.",
  "frontend/src/components/AIDailyTradesSection.tsx": "Renders the AI Daily Trades section with a list of trade cards, handling loading states, real-time price monitoring via events, and a manual refresh button.",
  "frontend/src/components/AIDailyTradesSummary.tsx": "Displays a summary panel for the AI trade portfolio showing total PnL, winning/losing trade counts, and reversal guard activations for the current day.",
  "frontend/src/components/AIDailyTradesTab.tsx": "Tab layout component that composes AIDailyTradesSection and PerformanceComparisonPanel into a single view.",
  "frontend/src/components/AIInsightsTab.tsx": "Renders the AI Insights tab showing sentiment analysis, trend predictions, and adjustment suggestions for open positions, with accept/dismiss logic and optional live order execution.",
  "frontend/src/components/AITradeCard.tsx": "Displays a detailed card for a single AI trade including entry/current price, PnL, take-profit progress bars, risk management step indicator, reversal guard status, and live order toggle.",
  "frontend/src/components/BinanceCredentialsPanel.tsx": "A React panel component for entering, saving, clearing, and testing Binance API credentials, with automatic position import on save and connection status feedback.",
  "frontend/src/components/CredentialStatusIndicator.tsx": "A memoized React component that displays badge indicators for API key presence and live trading mode, updating reactively via custom DOM events.",
  "frontend/src/components/DashboardTab.tsx": "The main dashboard tab component that renders capital summary, positions, and an onboarding banner when no credentials are set, with a manual Binance position import button.",
  "frontend/src/components/ExposureChart.tsx": "Renders two cards showing asset allocation percentages and long/short balance as progress bars using exposure data passed via props.",
  "frontend/src/components/InstallButton.tsx": "A button component that triggers PWA installation via the browser prompt or shows a manual instructions modal if the prompt is unavailable, hiding itself when already installed.",
  "frontend/src/components/InstallInstructionsModal.tsx": "A dialog modal that displays step-by-step PWA installation instructions for multiple browsers and platforms (Chrome, Safari, Edge, Firefox).",
  "frontend/src/components/LiveRiskMetricsCard.tsx": "A card component that fetches live prices and leverage bracket data to compute and display liquidation prices and risk levels (safe/warning/danger) for each open position.",
  "frontend/src/components/LiveTradingBanner.tsx": "Displays an amber warning banner when live trading is active, reactively updating via custom DOM events ('live-trading-change' and 'liveTradingChanged') registered once on mount.",
  "frontend/src/components/LiveTradingToggle.tsx": "A toggle switch component for enabling/disabling live trading mode, showing a confirmation dialog before activation and a loading state with a 20-second safety timeout.",
  "frontend/src/components/PerformanceComparisonPanel.tsx": "Renders a side-by-side performance comparison panel between AI trades and user trades, displaying metrics like win rate, PnL, and trade counts from local storage histories.",
  "frontend/src/components/PortfolioExposureDashboard.tsx": "Displays a portfolio exposure dashboard card with metrics such as deployed capital percentage, capital at risk, live unrealized PnL, and an exposure chart derived from open positions.",
  "frontend/src/components/PositionCard.tsx": "Renders a collapsible card for a single trading position showing symbol, direction, leverage, PnL, and adjustment suggestions, with delete triggering a trade outcome modal.",
  "frontend/src/components/PositionDashboard.tsx": "Renders the list of active position cards with real-time price monitoring, showing loading/error states and an empty-state prompt to import positions from Binance.",
  "frontend/src/components/PositionEntryForm.tsx": "A form component for entering new trading positions, collecting symbol, type, leverage, entry price, and investment amount, then fetching historical klines to calculate take-profit levels and stop-loss before submitting a Position object.",
  "frontend/src/components/PositionRecoveryCard.tsx": "Displays recovery strategies for losing positions by calling analyzePositionRecovery and rendering each strategy (hedge, DCA, partial close, TP/SL adjustment) in an accordion with risk badges and actionable steps.",
  "frontend/src/components/PositionSizeCalculator.tsx": "An interactive calculator that computes optimal position size based on capital, risk percentage, entry/stop-loss prices, and leverage, with live Binance price fetching and leverage bracket validation for a selected perpetual pair.",
  "frontend/src/components/RiskManagementTab.tsx": "A tab layout component that composes LiveRiskMetricsCard, PositionSizeCalculator, PortfolioExposureDashboard, and ScenarioSimulator, conditionally showing exposure and risk metrics only when positions exist.",
  "frontend/src/components/ScenarioSimulator.tsx": "Simulates portfolio P&L under user-defined or ATR-based price change scenarios for selected or all positions, fetching live prices and klines to compute and display scenario results.",
  "frontend/src/components/SentimentGauge.tsx": "Renders a market sentiment card for a given symbol using the useSentimentAnalysis hook, displaying a bullish/bearish/neutral score, strength progress bar, and top contributing indicator factors.",
  "frontend/src/components/SettingsDialog.tsx": "A modal dialog with three tabs (API credentials, live trading toggle, and capital input) for configuring application settings.",
  "frontend/src/components/StopLossRecommendations.tsx": "Displays a stop-loss recommendation card showing price, distance from current price, max loss, capital risk percentage, reasoning, and a partial-taking strategy alert.",
  "frontend/src/components/TabNavigation.tsx": "Sticky tab navigation bar with four tabs (Dashboard, AI Daily Trades, AI Insights, Risk Management) that highlights the active tab and calls a callback on tab change.",
  "frontend/src/components/TakeProfitRecommendations.tsx": "Renders a list of take-profit level cards showing target price, distance from current price, profit in USD/percent, and reasoning for each level.",
  "frontend/src/components/TotalCapitalInput.tsx": "A form card that reads, validates, and persists the user's total trading capital to local storage, showing a success state on save.",
  "frontend/src/components/TotalCapitalSummary.tsx": "Displays a capital summary card showing total, deployed, available, and at-risk capital derived from open positions, with an inline edit mode for updating the total capital.",
  "frontend/src/components/TradeOutcomeModal.tsx": "A dialog for closing a position that lets the user select an outcome (TP Hit, SL Hit, Manually Closed), enter an exit price, previews PnL, and saves a trade record.",
  "frontend/src/components/TrendPredictionCard.tsx": "React component that displays AI-generated short-term and medium-term trend predictions (direction and confidence) for a given trading symbol using data from the useTrendPrediction hook.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) based on the current Internet Identity, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAdjustmentSuggestions.ts": "Custom hook that fetches recent hourly Binance kline data for each position and generates position adjustment suggestions, refreshing every 30 seconds.",
  "frontend/src/hooks/useAITradeGeneration.ts": "Custom hook that generates AI trades for each trading modality (Scalping, DayTrading, SwingTrading, TrendFollowing) if no active trade exists, persists them via useAITradeStorage, and optionally places live Binance orders (entry, TP, SL) asynchronously.",
  "frontend/src/hooks/useAITradeMonitoring.ts": "Custom hook that monitors open AI trades on an interval, detects TP/SL hits and market reversals using live Binance prices, updates trade state, and optionally executes live close/cancel orders on Binance.",
  "frontend/src/hooks/useAITradeStorage.ts": "Custom hook providing CRUD helpers for persisting AI trades in localStorage, including daily reset logic and custom event dispatching; also exports standalone helper functions for use outside React components.",
  "frontend/src/hooks/useBinancePairs.ts": "Custom hook that fetches and caches the list of Binance perpetual trading pairs, refreshing every hour with up to 3 retries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and persisting identity across page reloads via AuthClient.",
  "frontend/src/hooks/useLiveTradingMode.ts": "Custom hook that manages live trading mode state, validates Binance API credentials with a timeout, and exposes a toggle function with appropriate toast notifications.",
  "frontend/src/hooks/usePortfolioExposure.ts": "Custom hook that fetches live prices for all position symbols every 30 seconds and computes enriched position data including live exposure, unrealized PnL, and estimated liquidation prices.",
  "frontend/src/hooks/usePositionMonitoring.ts": "Custom hook that polls current prices for all open positions every 5 seconds and returns enriched position data with PnL and distance-to-TP/SL calculations.",
  "frontend/src/hooks/usePositionStorage.ts": "Custom hook that manages position CRUD operations in localStorage and, when Binance credentials are present, automatically places take-profit and stop-loss orders on the exchange when positions are added or removed.",
  "frontend/src/hooks/usePWAInstall.ts": "Custom hook that tracks PWA installability and installation state, and exposes an install function that triggers the browser's native install prompt.",
  "frontend/src/hooks/useQueries.ts": "Placeholder/empty module indicating that all data operations are handled via direct Binance API calls rather than a backend canister.",
  "frontend/src/hooks/useSentimentAnalysis.ts": "Custom hook that fetches 100 hourly klines from Binance Futures and returns a sentiment analysis result, refreshing every 30 seconds.",
  "frontend/src/hooks/useTrendPrediction.ts": "Custom hook that fetches hourly and daily klines from Binance Futures and returns short-term and medium-term trend predictions, refreshing every 5 minutes.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind directives and defines a golden-themed CSS custom property palette for both light and dark modes, including chart, sidebar, sentiment, and warning color tokens.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with TanStack QueryClientProvider and a custom InternetIdentityProvider.",
  "frontend/src/services/binanceApi.ts": "Provides functions to interact with the Binance USD-M Futures public REST API, including fetching perpetual pairs, current prices, ticker prices, leverage brackets, and OHLCV klines.",
  "frontend/src/services/binanceOrderService.ts": "Handles authenticated Binance Futures order operations (market, limit, stop-market orders) using HMAC-SHA256 signed requests with timeout support.",
  "frontend/src/services/binancePositionService.ts": "Fetches open positions from the Binance USD-M Futures account via /fapi/v2/positionRisk and maps them to the app's internal Position type with placeholder TP/SL values.",
  "frontend/src/types/adjustment.ts": "Defines types for AI-suggested take-profit and stop-loss adjustment proposals, including suggestion details and a history record of accepted or dismissed actions.",
  "frontend/src/types/aiTrade.ts": "Defines the AITrade and AITradeWithPrice interfaces representing AI-generated trades with TP/SL levels, execution state, reversal detection, and optional live Binance order IDs.",
  "frontend/src/types/binanceApi.ts": "Contains TypeScript interfaces and types for Binance API responses including account info, position risk, orders, credentials, leverage brackets, and order ID tracking.",
  "frontend/src/types/calculator.ts": "Defines input and result interfaces for the position size calculator, covering capital, risk percentage, entry/stop prices, leverage, and computed risk/reward metrics.",
  "frontend/src/types/exposure.ts": "Defines types for portfolio exposure analysis, including per-asset exposure, long/short balance, correlation risks, and warning flags for high exposure or imbalance.",
  "frontend/src/types/position.ts": "Defines the core Position and PositionWithPrice interfaces used throughout the app, including take-profit levels, stop-loss recommendations, and live price/PnL data.",
  "frontend/src/types/prediction.ts": "Defines types for trend direction predictions with confidence scores and time horizons, plus a history record linking predictions to actual outcomes.",
  "frontend/src/types/recovery.ts": "Defines types for position recovery strategies (hedge, DCA, partial close, TP/SL adjustment) including their parameters, risk levels, and actionable steps.",
  "frontend/src/types/reversal.ts": "Defines types for market reversal detection signals, including RSI divergence, EMA crossovers, candlestick patterns, volatility spikes, and support/resistance violations.",
  "frontend/src/types/scenario.ts": "Defines types for scenario simulation, modeling the impact of a percentage price change on all positions with per-position PnL, TP/SL hit flags, and liquidation risk.",
  "frontend/src/types/sentiment.ts": "Defines types for market sentiment analysis results, including a bullish/bearish/neutral score, strength value, and contributing indicator factors.",
  "frontend/src/types/tradeHistory.ts": "Defines TypeScript interfaces and types for trade history records, including UserTradeRecord, AITradeRecord, ModalityStats, and PerformanceMetrics.",
  "frontend/src/utils/adjustmentSuggestions.ts": "Generates position adjustment suggestions (stop-loss widening, take-profit adjustments) based on market conditions like volatility, ATR, and proximity to support/resistance levels.",
  "frontend/src/utils/aiTradeHistoryStorage.ts": "Provides localStorage-backed CRUD utilities for AI trade history records, storing up to 500 entries and preventing duplicate entries by id and outcome.",
  "frontend/src/utils/aiTradeSelection.ts": "Selects and constructs AI trades by computing technical indicators (RSI, EMA, ATR, momentum) and SMC analysis per trading modality, with per-modality configuration for leverage, TP/SL multipliers, and timeframes.",
  "frontend/src/utils/binanceAuth.ts": "Provides HMAC-SHA256 signed authenticated fetch requests to the Binance API with a 15-second timeout, combined abort signal support, and a typed BinanceApiError for timeout and failure cases.",
  "frontend/src/utils/exposureCalculations.ts": "Calculates portfolio exposure metrics including total capital deployed, leverage, long/short balance, per-asset breakdown, correlation risks, and warning flags from a list of positions.",
  "frontend/src/utils/liveTradingStorage.ts": "Manages live trading mode, Binance credentials, and per-modality live order toggles in localStorage, dispatching deferred custom DOM events on changes to prevent re-render cascades.",
  "frontend/src/utils/marketReversalDetector.ts": "Detects market trend reversals using SMC-enhanced analysis including RSI divergence, EMA crossovers, candlestick patterns, ATR volatility spikes, support/resistance violations, CHOCH, breaker blocks, liquidity sweeps, and opposing FVGs across modality-specific timeframes.",
  "frontend/src/utils/performanceCalculations.ts": "Calculates win rate, total PnL, and performance metrics for user and AI trade records, including a per-modality breakdown sorted by trading modality order.",
  "frontend/src/utils/pnlCalculations.ts": "Provides utility functions to calculate leveraged PnL (USD and percent) for long/short positions and the percentage distance between current and target prices.",
  "frontend/src/utils/positionRecoveryEngine.ts": "Generates recovery strategies (hedge, DCA, partial close, TP/SL adjustment) for losing positions using ATR and support/resistance levels fetched from Binance kline data.",
  "frontend/src/utils/positionSizeCalculator.ts": "Calculates optimal position size, contract count, risk/reward amounts, and risk-reward ratio based on capital, risk percentage, entry price, stop-loss, and leverage inputs.",
  "frontend/src/utils/registerServiceWorker.ts": "Registers a service worker for PWA support, handles update detection with a user confirmation prompt, and schedules hourly update checks.",
  "frontend/src/utils/scenarioSimulator.ts": "Simulates the impact of price change scenarios (e.g., market crash, bull run) on a portfolio of positions, computing projected PnL and flagging TP hits, SL hits, and liquidation risks.",
  "frontend/src/utils/sentimentAnalysis.ts": "Analyzes market sentiment by combining technical indicators (RSI, MACD, volume trend, price action, momentum) with SMC concepts like swing points, BOS, FVGs, liquidity zones, and Wyckoff phase estimation.",
  "frontend/src/utils/smcAnalysis.ts": "Core Smart Money Concepts (SMC) analysis library that provides utilities for detecting institutional market structure including swing points, BOS, CHOCH, Order Blocks, Fair Value Gaps, liquidity zones, Wyckoff phases, and manipulation signals from Binance kline data.",
  "frontend/src/utils/stopLossCalculator.ts": "Calculates institutional-grade stop-loss prices using SMC analysis (swept liquidity zones, Order Blocks, ATR) while enforcing a capital risk cap of 0.5%–2% based on leverage and position type.",
  "frontend/src/utils/takeProfitCalculator.ts": "Calculates three tiered take-profit levels using SMC indicators (FVGs, Order Blocks, swing points) with ATR-based fallbacks, adjusted for leverage and position direction.",
  "frontend/src/utils/technicalAnalysis.ts": "Provides basic technical analysis utilities including ATR calculation, volatility measurement, support/resistance clustering, and risk/reward ratio computation from price arrays.",
  "frontend/src/utils/totalCapitalStorage.ts": "Manages total trading capital persistence in localStorage and dispatches a custom DOM event ('total-capital-change') on writes to enable reactive UI updates.",
  "frontend/src/utils/tradeHistoryStorage.ts": "Handles CRUD operations for user trade history records stored in localStorage, supporting retrieval, appending, and clearing of trade records.",
  "frontend/src/utils/trendPrediction.ts": "Predicts short-term (1–24h) and medium-term (1–7d) price trend direction and confidence using moving averages, momentum, and volatility derived from hourly and daily price arrays.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, extended theme tokens (colors via oklch CSS variables, border radius, fonts, shadows, keyframes), and plugins for animation, typography, and container queries.",
  "project_state.json": "Project state manifest (version 65) describing a crypto trading monitoring app with AI-powered TP/SL recommendations, listing architectural notes, known issues, and existing features for build planning."
}