{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend canister with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report describing two high-confidence features: fixing P&L calculation in AIDailyTradesSection.tsx to guard against zero/undefined prices before computing PnL, and fixing AITradeCard.tsx to show a loading indicator when currentPrice is invalid.",
  "frontend-file-summaries.txt": "Truncated JSON document summarizing each frontend source file's purpose, covering components, hooks, utilities, and configuration files in the React frontend.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes including colors for background, foreground, cards, charts, and sidebar.",
  "frontend/index.html": "HTML entry point for the Crypto Position Monitor PWA, including meta tags for PWA support, Apple touch icons, theme color, and the root div with the main.tsx module script.",
  "frontend/public/manifest.json": "PWA manifest for Crypto Position Monitor defining app name, icons, theme colors, display mode, categories, and an 'Add Position' shortcut.",
  "frontend/public/service-worker.js": "Service worker implementing cache strategies: static asset caching on install, old cache cleanup on activate, cache-first for static assets, network-first with cache fallback for HTML/API calls, and special handling for Binance API requests.",
  "frontend/src/App.tsx": "Root React component managing tab navigation, position storage/monitoring, auto-import of Binance open positions on mount, and auto-fill of total capital from Binance account balance.",
  "frontend/src/components/AdjustmentSuggestionCard.tsx": "Card component that presents a single AI-generated take-profit or stop-loss adjustment suggestion with current vs. proposed levels, confidence badge, reasoning text, and accept/dismiss action buttons.",
  "frontend/src/components/AIDailyTradesSection.tsx": "Main section component that fetches live prices from Binance, enriches stored AI trades with current prices and PnL calculations, and renders trade cards with a summary panel. Manages periodic price refresh and listens for storage events to keep trades up to date.",
  "frontend/src/components/AIDailyTradesSummary.tsx": "Displays an aggregated summary banner for the AI daily trades portfolio, showing total PnL in USDT and percent, win/loss counts, reversal guard activations, and last updated time.",
  "frontend/src/components/AIDailyTradesTab.tsx": "Simple tab layout component that composes AIDailyTradesSection and PerformanceComparisonPanel into a single vertically stacked view.",
  "frontend/src/components/AIInsightsTab.tsx": "Tab component that displays AI-driven market insights including sentiment analysis, trend predictions, and adjustment suggestions for open positions, with support for accepting or dismissing suggestions and optionally executing live orders on Binance.",
  "frontend/src/components/AITradeCard.tsx": "Card component that renders detailed information for a single AI trade, including entry/current price, PnL, take-profit progress bars, stop-loss proximity warnings, risk management step tracker, reversal guard status, and a live-order toggle.",
  "frontend/src/components/BinanceCredentialsPanel.tsx": "A React panel component for entering, saving, clearing, and testing Binance API credentials, with automatic position import on save and connection status feedback.",
  "frontend/src/components/CredentialStatusIndicator.tsx": "A memoized React component that displays badge indicators for API key presence and live trading mode, reactively updating via custom DOM events.",
  "frontend/src/components/DashboardTab.tsx": "The main dashboard tab component that renders capital summary, positions, and an onboarding banner when no credentials are set, with a manual Binance position import button.",
  "frontend/src/components/ExposureChart.tsx": "A visualization component that renders asset allocation and long/short balance as progress-bar-style charts using exposure data.",
  "frontend/src/components/InstallButton.tsx": "A button component that triggers PWA installation via the browser prompt or shows manual install instructions if the prompt is unavailable, hiding itself when already installed.",
  "frontend/src/components/InstallInstructionsModal.tsx": "A dialog modal that provides step-by-step PWA installation instructions for multiple browsers and platforms (Chrome, Safari, Edge, Firefox).",
  "frontend/src/components/LiveRiskMetricsCard.tsx": "A card component that fetches live prices and leverage bracket data to compute and display liquidation prices and risk levels (safe/warning/danger) for each open position.",
  "frontend/src/components/LiveTradingBanner.tsx": "Displays an amber warning banner when live trading is active, reactively updating via custom DOM events ('live-trading-change' and 'liveTradingChanged') registered once on mount.",
  "frontend/src/components/LiveTradingToggle.tsx": "A toggle switch component for enabling/disabling live trading mode, showing a confirmation dialog before activation and a loading state with a 20-second safety timeout.",
  "frontend/src/components/PerformanceComparisonPanel.tsx": "Renders a side-by-side performance comparison panel between AI trades and user trades, displaying metrics like win rate, PnL, and trade counts from local storage histories.",
  "frontend/src/components/PortfolioExposureDashboard.tsx": "Displays a portfolio exposure dashboard card with metrics such as deployed capital percentage, capital at risk, live unrealized PnL, and an exposure chart derived from open positions.",
  "frontend/src/components/PositionCard.tsx": "Renders a collapsible card for a single trading position showing symbol, direction, leverage, PnL, and adjustment suggestions, with delete triggering a trade outcome modal.",
  "frontend/src/components/PositionDashboard.tsx": "Displays all active trading positions using real-time price monitoring, rendering a list of PositionCards or an empty state prompting Binance import when no positions exist.",
  "frontend/src/components/PositionEntryForm.tsx": "A form component for entering new trading positions, allowing users to select a symbol, position type, leverage, entry price, and investment amount. On submission it fetches historical klines, calculates take-profit levels and stop-loss, then calls the onSubmit callback with the constructed Position object.",
  "frontend/src/components/PositionRecoveryCard.tsx": "Displays recovery strategies for a losing position by calling analyzePositionRecovery and rendering each strategy in an accordion with risk badges and actionable steps. Includes a manual refresh button and only shows content when the position is in a loss.",
  "frontend/src/components/PositionSizeCalculator.tsx": "An interactive calculator that computes recommended position size based on capital, risk percentage, entry/stop-loss prices, and leverage, with live Binance price fetching and leverage bracket validation. Supports a searchable perpetual-pairs dropdown and an optional onApply callback to pass results to a parent component.",
  "frontend/src/components/RiskManagementTab.tsx": "A tab layout component that composes LiveRiskMetricsCard, PositionSizeCalculator, PortfolioExposureDashboard, and ScenarioSimulator into a single risk management view. Shows placeholder UI when no positions are present.",
  "frontend/src/components/ScenarioSimulator.tsx": "Simulates portfolio P&L impact for a user-defined percentage price change across all or a selected position's symbol, using live prices and ATR-based presets. Renders scenario results and supports preset quick-select buttons derived from ATR calculations.",
  "frontend/src/components/SentimentGauge.tsx": "Displays a market sentiment card for a given symbol using the useSentimentAnalysis hook, showing a bullish/bearish/neutral score, strength progress bar, and top contributing indicator factors.",
  "frontend/src/components/SettingsDialog.tsx": "A modal dialog component with three tabs (API credentials, live trading toggle, and capital input) for configuring application settings.",
  "frontend/src/components/StopLossRecommendations.tsx": "Displays stop loss details for a position including price, distance from current price, max loss, capital risk percentage, reasoning, and a partial taking strategy alert.",
  "frontend/src/components/TabNavigation.tsx": "A sticky tab navigation bar with four tabs (Dashboard, AI Daily Trades, AI Insights, Risk Management) that highlights the active tab and calls a callback on tab change.",
  "frontend/src/components/TakeProfitRecommendations.tsx": "Renders a list of take-profit level cards showing target price, distance from current price, expected profit, and reasoning, with visual indication when a level is reached.",
  "frontend/src/components/TotalCapitalInput.tsx": "A form card that reads, validates, and persists the user's total trading capital to local storage, showing a success state after saving.",
  "frontend/src/components/TotalCapitalSummary.tsx": "Displays a capital summary card showing total, deployed, available, and at-risk capital derived from open positions, with an inline edit mode for updating the total capital value.",
  "frontend/src/components/TradeOutcomeModal.tsx": "A dialog for closing a position by selecting a trade outcome (TP Hit, SL Hit, Manually Closed), entering an exit price, previewing PnL, and saving a trade record.",
  "frontend/src/components/TrendPredictionCard.tsx": "React component that displays AI-generated short-term and medium-term trend predictions (direction, confidence) for a given trading symbol using data from the useTrendPrediction hook.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using the current Internet Identity, returning an anonymous actor when unauthenticated and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useAdjustmentSuggestions.ts": "Custom hook that fetches hourly Binance kline data for each position and generates position adjustment suggestions, refreshing every 30 seconds.",
  "frontend/src/hooks/useAITradeGeneration.ts": "Custom hook that generates AI trades for each trading modality (Scalping, DayTrading, SwingTrading, TrendFollowing) if no active trade exists, persists them via useAITradeStorage, and optionally places live Binance orders for new trades.",
  "frontend/src/hooks/useAITradeMonitoring.ts": "Custom hook that polls open AI trades every 5 seconds, checks for TP/SL hits and market reversals using live Binance prices, updates trade state, and archives closed trades to history storage.",
  "frontend/src/hooks/useAITradeStorage.ts": "Custom hook providing CRUD helpers for persisting AI trades in localStorage, including daily reset logic and custom event dispatching; also exports standalone helper functions for use outside React components.",
  "frontend/src/hooks/useBinancePairs.ts": "Custom hook that fetches and caches the list of Binance perpetual trading pairs, refreshing every hour with up to 3 retries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useLiveTradingMode.ts": "Custom hook that manages live trading mode state, validates Binance API credentials with a timeout, and exposes a toggle function with toast notifications.",
  "frontend/src/hooks/usePortfolioExposure.ts": "Custom hook that fetches live prices for all position symbols every 30 seconds and enriches positions with live exposure, unrealized PnL, liquidation price, and staleness indicators.",
  "frontend/src/hooks/usePositionMonitoring.ts": "Custom hook that polls current prices for all positions every 5 seconds and returns enriched position data including PnL and distances to take-profit and stop-loss levels.",
  "frontend/src/hooks/usePositionStorage.ts": "Custom hook that manages position CRUD operations in localStorage and, when Binance credentials are present, automatically places take-profit and stop-loss orders on the exchange.",
  "frontend/src/hooks/usePWAInstall.ts": "Custom hook that tracks PWA installability and installation state, and exposes an install function that triggers the browser's native install prompt.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module that exports nothing, noting that all backend operations are handled via direct Binance API calls and no backend canister is used.",
  "frontend/src/hooks/useSentimentAnalysis.ts": "Custom hook that fetches 100 hourly klines from Binance Futures and returns a sentiment analysis result, refreshing every 30 seconds.",
  "frontend/src/hooks/useTrendPrediction.ts": "Custom hook that fetches hourly and daily klines from Binance Futures and returns short-term and medium-term trend predictions, refreshing every 5 minutes.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind directives and defines a golden-themed CSS variable palette for both light and dark modes, including chart, sidebar, sentiment, and warning colors.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with TanStack QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/services/binanceApi.ts": "Provides functions to interact with the Binance USD-M Futures public REST API, including fetching perpetual pairs, current prices, ticker prices, leverage brackets, and OHLCV klines.",
  "frontend/src/services/binanceOrderService.ts": "Handles authenticated Binance Futures order operations (market, limit, stop-market orders) using HMAC-SHA256 signed requests with timeout support.",
  "frontend/src/services/binancePositionService.ts": "Fetches open positions from the Binance USD-M Futures account via /fapi/v2/positionRisk and maps them to the app's internal Position type with placeholder TP/SL values.",
  "frontend/src/types/adjustment.ts": "Defines types for AI-suggested take-profit and stop-loss adjustment proposals, including suggestion details and a history record of accepted or dismissed actions.",
  "frontend/src/types/aiTrade.ts": "Defines the AITrade and AITradeWithPrice interfaces representing AI-generated trades with TP/SL levels, execution state, reversal detection, and optional live Binance order IDs.",
  "frontend/src/types/binanceApi.ts": "Contains TypeScript interfaces and types for Binance API responses including account info, position risk, orders, credentials, leverage brackets, and order IDs.",
  "frontend/src/types/calculator.ts": "Defines input and result interfaces for the position size calculator, covering capital, risk percentage, entry/stop prices, leverage, and computed risk/reward metrics.",
  "frontend/src/types/exposure.ts": "Defines types for portfolio exposure analysis, including per-asset exposure, long/short balance, correlation risks, and warning flags for high exposure or imbalance.",
  "frontend/src/types/position.ts": "Defines the core Position and PositionWithPrice interfaces used throughout the app, including take-profit levels, stop-loss recommendations, and live price/PnL data.",
  "frontend/src/types/prediction.ts": "Defines types for trend direction predictions with confidence scores and time horizons, plus a history record linking predictions to actual outcomes.",
  "frontend/src/types/recovery.ts": "Defines types for position recovery strategies (hedge, DCA, partial close, TP/SL adjustment) including their parameters, risk levels, and actionable steps.",
  "frontend/src/types/reversal.ts": "Defines types for market reversal detection signals, including RSI divergence, EMA crossover, candlestick patterns, volatility spikes, and support/resistance violations.",
  "frontend/src/types/scenario.ts": "Defines types for what-if scenario simulation, including price change inputs, per-position outcomes (PnL, TP/SL/liquidation hits), and aggregate scenario results.",
  "frontend/src/types/sentiment.ts": "Defines types for market sentiment analysis, including bullish/bearish/neutral scores, contributing factors with impact labels, and a timestamped analysis result.",
  "frontend/src/types/tradeHistory.ts": "Defines TypeScript interfaces and types for trade history records, including UserTradeRecord, AITradeRecord, ModalityStats, and PerformanceMetrics.",
  "frontend/src/utils/adjustmentSuggestions.ts": "Generates position adjustment suggestions (stop-loss widening, take-profit adjustments) based on calculated market conditions like ATR, volatility, and support/resistance proximity.",
  "frontend/src/utils/aiTradeHistoryStorage.ts": "Provides localStorage-backed CRUD utilities for AI trade history records, with duplicate prevention and a 500-record cap.",
  "frontend/src/utils/aiTradeSelection.ts": "Selects and constructs AI trades by computing technical indicators (RSI, EMA, ATR, momentum) and SMC analysis across multiple trading modalities with per-modality configuration.",
  "frontend/src/utils/binanceAuth.ts": "Provides HMAC-SHA256 signed authenticated fetch requests to the Binance API with a 15-second timeout, combined abort signal support, and a typed BinanceApiError class.",
  "frontend/src/utils/exposureCalculations.ts": "Calculates portfolio exposure metrics including total capital, leverage, long/short balance, per-asset breakdown, correlated position risks, and warning flags from a list of positions.",
  "frontend/src/utils/liveTradingStorage.ts": "Manages live trading mode, Binance credentials, and per-modality live order toggles in localStorage, dispatching deferred custom DOM events on changes.",
  "frontend/src/utils/marketReversalDetector.ts": "Detects market trend reversals using SMC-enhanced analysis including RSI divergence, EMA crossovers, candlestick patterns, ATR volatility spikes, support/resistance violations, CHOCH, breaker blocks, liquidity sweeps, and opposing FVGs across modality-specific timeframes.",
  "frontend/src/utils/performanceCalculations.ts": "Calculates win rate, total PnL, and performance metrics for user and AI trade records, including a per-modality breakdown for AI trades sorted by a predefined order.",
  "frontend/src/utils/pnlCalculations.ts": "Provides two PnL calculation functions (legacy and nullable variant) for long/short leveraged positions, plus a helper to calculate percentage distance between two prices.",
  "frontend/src/utils/positionRecoveryEngine.ts": "Generates recovery strategies (hedge, DCA, partial close, TP/SL adjustment) for losing positions using ATR and support/resistance levels fetched from Binance kline data.",
  "frontend/src/utils/positionSizeCalculator.ts": "Calculates position size, contract count, risk/reward amounts, and risk-reward ratio based on capital, risk percentage, stop-loss price, entry price, and leverage.",
  "frontend/src/utils/registerServiceWorker.ts": "Registers a service worker, listens for updates with a user prompt to reload, and schedules hourly update checks.",
  "frontend/src/utils/scenarioSimulator.ts": "Simulates the impact of price percentage changes on a set of positions, computing projected PnL, TP/SL hit status, and liquidation risk for each position and in aggregate.",
  "frontend/src/utils/sentimentAnalysis.ts": "Analyzes market sentiment by combining technical indicators (RSI, MACD, volume trend, price action, momentum) with SMC-based signals like swing points, BOS, FVGs, liquidity zones, and Wyckoff phase estimation.",
  "frontend/src/utils/smcAnalysis.ts": "Core Smart Money Concepts (SMC) analysis library providing detection utilities for swing points, BOS, CHOCH, Order Blocks, Fair Value Gaps, liquidity zones, Wyckoff phases, and manipulation signals using Binance kline data.",
  "frontend/src/utils/stopLossCalculator.ts": "Calculates institutional stop-loss prices using SMC analysis (swept liquidity zones, Order Blocks, ATR) while enforcing a capital risk cap of 0.5%–2% adjusted for leverage.",
  "frontend/src/utils/takeProfitCalculator.ts": "Calculates three tiered take-profit levels using SMC structures (FVGs, Order Blocks, swing highs/lows) with ATR-based fallbacks, adjusted for leverage and position direction.",
  "frontend/src/utils/technicalAnalysis.ts": "Provides basic technical analysis helpers including ATR calculation, volatility measurement, support/resistance clustering, and risk/reward ratio computation.",
  "frontend/src/utils/totalCapitalStorage.ts": "Manages total trading capital persistence in localStorage and dispatches a custom DOM event ('total-capital-change') on every write to enable reactive UI updates.",
  "frontend/src/utils/tradeHistoryStorage.ts": "Handles CRUD operations for user trade history records stored in localStorage, supporting retrieval, appending, and clearing of trade records.",
  "frontend/src/utils/trendPrediction.ts": "Predicts short-term (1–24h) and medium-term (1–7d) price trend direction and confidence using moving averages, momentum, and volatility derived from hourly and daily price arrays.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the theme with oklch CSS variable-based colors, custom fonts (Inter, JetBrains Mono), border radii, box shadows, accordion animations, and plugins for animate, typography, and container queries.",
  "project_state.json": "Project state tracking file (version 71) describing the crypto trading monitoring app's architecture, existing features, and known issues including broken UI interactions, duplicate AI trade cards, missing P&L calculations, and incomplete live trade mode functionality."
}