{
  "backend/main.mo": "Empty Motoko actor serving as the backend canister placeholder with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs and titles to their associated source files, components, test IDs, and confidence levels for the tab-based navigation refactor and related UI features.",
  "frontend-file-summaries.txt": "JSON document providing short descriptions of each frontend source file, serving as a reference summary of the purpose and key exports of every module in the project.",
  "frontend/index.css": "Root CSS file that imports Tailwind directives and defines OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, chart, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the React app, configuring PWA metadata (manifest, theme color, Apple touch icons) and mounting the root div with the main.tsx module script.",
  "frontend/public/manifest.json": "PWA web app manifest defining the app name, icons, display mode, theme/background colors, categories, and an 'Add Position' shortcut for the Crypto Position Monitor.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first for static assets, network-first for HTML and Binance API calls, with install/activate lifecycle handlers to manage versioned caches.",
  "frontend/src/App.tsx": "Main React application component that renders a sticky header with logo and install/social buttons, a tab navigation bar, and conditionally renders one of four tab components (Dashboard, AI Daily Trades, AI Insights, Risk Management) based on active tab state.",
  "frontend/src/components/AdjustmentSuggestionCard.tsx": "Alert-style card that presents an AI stop-loss or take-profit adjustment suggestion with current vs. proposed levels and accept/dismiss actions.",
  "frontend/src/components/AIDailyTradesSection.tsx": "Collapsible section component that orchestrates AI daily trade generation, monitoring, and display, showing loading/error states and a grid of AITradeCards with a force-refresh option.",
  "frontend/src/components/AIDailyTradesSummary.tsx": "Summary banner component displaying aggregated AI portfolio PnL (USD and percent), winning/losing/total trade counts, and a live timestamp for the AI daily trades.",
  "frontend/src/components/AIDailyTradesTab.tsx": "Thin tab wrapper component that renders AIDailyTradesSection inside a spaced container.",
  "frontend/src/components/AIInsightsTab.tsx": "Tab component that renders per-position AI insights including sentiment gauges, trend predictions, and dismissible adjustment suggestions for each open position.",
  "frontend/src/components/AITradeCard.tsx": "Card component displaying a single AI-generated trade with modality badge, entry/current/SL/TP prices, PnL, TP progress bars, and a near-SL warning indicator.",
  "frontend/src/components/DashboardTab.tsx": "Main dashboard tab that composes the capital summary, position entry form, and position dashboard into a single layout.",
  "frontend/src/components/ExposureChart.tsx": "Displays two cards showing asset allocation percentages as progress bars and the long/short capital balance for the current portfolio.",
  "frontend/src/components/InstallButton.tsx": "Renders a PWA install button that triggers the native install prompt if available, or shows a manual instructions modal if not. Hidden when the app is already installed as a standalone PWA.",
  "frontend/src/components/InstallInstructionsModal.tsx": "Displays a dialog with step-by-step PWA installation instructions for multiple browsers (Chrome/Edge Android, Safari iOS, Chrome/Edge/Firefox desktop). Each browser guide includes an icon and ordered steps.",
  "frontend/src/components/PortfolioExposureDashboard.tsx": "Dashboard card showing portfolio-level exposure metrics (capital deployed, total leverage exposure, capital at risk) with optional total capital context and warning flags for high deployment or risk percentages.",
  "frontend/src/components/PositionCard.tsx": "Card component for a single trading position displaying PnL, proximity to take-profit/stop-loss levels, AI adjustment suggestions, and collapsible AI insights including sentiment, trend prediction, and recommendations.",
  "frontend/src/components/PositionDashboard.tsx": "Container component that fetches live prices for all positions via a monitoring hook and renders a list of PositionCards, or an empty-state prompt with an add button when no positions exist.",
  "frontend/src/components/PositionEntryForm.tsx": "Form for creating a new trading position; collects symbol, type, leverage, entry price, and investment amount, then fetches historical klines to auto-calculate take-profit levels and stop-loss before submitting.",
  "frontend/src/components/PositionSizeCalculator.tsx": "A React component that calculates optimal position sizes based on capital, risk percentage, entry price, stop loss, and leverage inputs, with results displayed and an optional apply callback.",
  "frontend/src/components/RiskManagementTab.tsx": "A tab layout component that composes the PositionSizeCalculator, PortfolioExposureDashboard, and ScenarioSimulator into a single risk management view, showing a placeholder when no positions exist.",
  "frontend/src/components/ScenarioSimulator.tsx": "A component that simulates portfolio P&L impact for custom or preset market price change scenarios using a slider and preset buttons, with liquidation risk and capital loss warnings.",
  "frontend/src/components/SentimentGauge.tsx": "Displays market sentiment (bullish/bearish/neutral) for a given symbol using a score badge, strength progress bar, and a list of contributing indicator factors fetched via a custom hook.",
  "frontend/src/components/StopLossRecommendations.tsx": "Renders a stop loss card showing price, distance from current price, max loss, capital risk percentage, reasoning, and a partial-taking strategy alert, with visual warnings when price is near the stop.",
  "frontend/src/components/TabNavigation.tsx": "A sticky top navigation bar with four tabs (Dashboard, AI Daily Trades, AI Insights, Risk Management) that highlights the active tab and calls a callback on tab change.",
  "frontend/src/components/TakeProfitRecommendations.tsx": "Renders a list of take-profit level cards showing target price, distance from current price, expected profit in USD and percent, and reasoning, with visual highlighting when a level is reached.",
  "frontend/src/components/TotalCapitalInput.tsx": "A form card component that lets users input and save their total trading capital to local storage, with validation and success feedback via toast notifications.",
  "frontend/src/components/TotalCapitalSummary.tsx": "A card component that displays a capital overview (deployed, at-risk, and available capital percentages) based on stored total capital and current positions, with an edit dialog to update the capital value.",
  "frontend/src/components/TrendPredictionCard.tsx": "A card component that displays AI-generated short-term and medium-term trend predictions (direction and confidence) for a given trading symbol.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an ICP backend actor using the current Internet Identity, invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useAdjustmentSuggestions.ts": "A React Query hook that fetches hourly Binance kline data for each position and generates trade adjustment suggestions, refreshing every 30 seconds.",
  "frontend/src/hooks/useAITradeGeneration.ts": "A React Query hook that generates or retrieves daily AI trades for four trading modalities, caching them for 24 hours and resetting them each UTC day.",
  "frontend/src/hooks/useAITradeMonitoring.ts": "A React Query hook that fetches live prices for AI trades every 5 seconds and computes PnL and status (Open, TPHit, SLHit) for each trade.",
  "frontend/src/hooks/useAITradeStorage.ts": "A utility hook providing localStorage read/write/clear operations for daily AI trades, keyed by UTC date to ensure daily resets.",
  "frontend/src/hooks/useBinancePairs.ts": "A React Query hook that fetches and caches the list of Binance perpetual trading pairs for one hour.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider for ICP, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/usePortfolioExposure.ts": "React hook that memoizes portfolio exposure calculations by calling `calculatePortfolioExposure` on an array of positions with prices.",
  "frontend/src/hooks/usePositionMonitoring.ts": "React Query hook that polls Binance every 5 seconds to fetch current prices for all tracked positions and computes PnL, distance to TP1, and distance to stop-loss for each.",
  "frontend/src/hooks/usePositionStorage.ts": "React hook that persists and retrieves trading positions from localStorage, exposing add, update, and delete operations.",
  "frontend/src/hooks/usePWAInstall.ts": "React hook that manages PWA installation state by listening to `beforeinstallprompt` and `appinstalled` browser events, and exposes an `install()` function to trigger the native install prompt.",
  "frontend/src/hooks/useQueries.ts": "Placeholder/empty module noting that all data operations go directly to the Binance API and the backend canister is unused.",
  "frontend/src/hooks/useSentimentAnalysis.ts": "React Query hook that fetches 100 hourly klines from Binance Futures and runs `analyzeSentiment` on close prices and volumes, refreshing every 30 seconds.",
  "frontend/src/hooks/useTrendPrediction.ts": "React Query hook that fetches hourly and daily klines from Binance Futures and returns short-term and medium-term trend predictions via `predictTrend`, refreshing every 5 minutes.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines a golden-themed OKLCH CSS variable palette for both light and dark modes, and adds PWA standalone-mode adjustments and utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in `QueryClientProvider` and `InternetIdentityProvider`.",
  "frontend/src/services/binanceApi.ts": "Service module providing typed functions to fetch perpetual pairs, current prices (single and batch), and OHLCV klines from the Binance Futures REST API.",
  "frontend/src/types/adjustment.ts": "TypeScript types for TP/SL adjustment suggestions and their acceptance history.",
  "frontend/src/types/aiTrade.ts": "TypeScript types for AI-generated trades, including trading modality, status, entry/exit levels, and a price-enriched variant.",
  "frontend/src/types/calculator.ts": "TypeScript types for position-size calculator inputs (capital, risk %, entry/SL prices, leverage) and the resulting size, contracts, and risk/reward output.",
  "frontend/src/types/exposure.ts": "TypeScript types describing portfolio exposure metrics including per-asset breakdown, long/short balance, correlation risks, and warning flags.",
  "frontend/src/types/position.ts": "TypeScript types for trading positions, including take-profit levels, stop-loss recommendations, and a price-enriched variant with PnL and distance fields.",
  "frontend/src/types/prediction.ts": "TypeScript types for trend predictions (direction, confidence, time horizon) and their historical accuracy records.",
  "frontend/src/types/scenario.ts": "TypeScript types for what-if scenario analysis, covering inputs, per-position outcomes (PnL, TP/SL/liquidation flags), aggregate results, and preset scenarios.",
  "frontend/src/types/sentiment.ts": "TypeScript types for market sentiment analysis results, including a bullish/bearish/neutral score, strength value, and contributing indicator factors.",
  "frontend/src/utils/adjustmentSuggestions.ts": "Utility that analyzes market conditions (ATR, volatility, support/resistance) for a position and generates TP/SL adjustment suggestions with confidence scores and reasoning.",
  "frontend/src/utils/aiTradeSelection.ts": "Computes technical indicators (EMA, RSI, ATR, momentum) from Binance kline data and uses modality-specific configs (Scalping, DayTrading, SwingTrading) to generate AI trade signals with entry, take-profit, and stop-loss levels.",
  "frontend/src/utils/exposureCalculations.ts": "Calculates portfolio-level exposure metrics including total capital deployed, weighted average leverage, long/short balance, per-asset exposure percentages, correlated position risks, and warning flags.",
  "frontend/src/utils/pnlCalculations.ts": "Provides utility functions to calculate PnL in USD and percent for long/short leveraged positions, and the percentage distance between current and target prices.",
  "frontend/src/utils/positionSizeCalculator.ts": "Calculates optimal position size, number of contracts, risk amount, and reward amount based on capital, risk percentage, stop-loss distance, entry price, and leverage.",
  "frontend/src/utils/registerServiceWorker.ts": "Registers a service worker for PWA support, handles update detection with a user confirmation prompt, and schedules hourly update checks.",
  "frontend/src/utils/scenarioSimulator.ts": "Simulates portfolio outcomes under hypothetical price change scenarios, determining projected PnL, TP/SL hits, and liquidation risk for each position, with predefined market presets.",
  "frontend/src/utils/sentimentAnalysis.ts": "Analyzes market sentiment from close prices and volumes by computing RSI, MACD, price action trend, volume trend, and momentum, then aggregating bullish/bearish signals into a sentiment score.",
  "frontend/src/utils/stopLossCalculator.ts": "Calculates a recommended stop-loss price for a leveraged position using ATR-based distance, support/resistance levels, and a leverage-adjusted maximum risk percentage, returning loss amounts and reasoning.",
  "frontend/src/utils/takeProfitCalculator.ts": "Calculates three take-profit levels (conservative, moderate, aggressive) for a trading position using volatility, support/resistance, leverage, and position type to determine target prices and expected profit in USD and percentage.",
  "frontend/src/utils/technicalAnalysis.ts": "Provides technical analysis utility functions including ATR calculation, volatility (standard deviation of returns), support/resistance detection via price clustering, and risk/reward ratio computation.",
  "frontend/src/utils/totalCapitalStorage.ts": "Manages persisting and retrieving a total capital value in localStorage, with validation to ensure the stored value is a positive number.",
  "frontend/src/utils/trendPrediction.ts": "Predicts short-term (1–24 hours) and medium-term (1–7 days) price trend direction and confidence using moving averages, momentum, and volatility derived from hourly and daily price arrays.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom OKLCH-based color tokens, extended border radii, box shadows, accordion keyframe animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks the overall project state (version 21) for a crypto trading monitoring app, documenting architecture decisions, existing features, and known issues such as unreliable PWA installation."
}