{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend canister with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report listing implemented features with their associated files, components, test IDs, and confidence levels for Binance API integrations across PositionSizeCalculator, PortfolioExposureDashboard, and ScenarioSimulator components.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short summaries describing each file's role, used as build planning documentation for the frontend codebase.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, chart, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the React app with PWA manifest link, theme color, Apple touch icon, and mobile web app meta tags for the Crypto Position Monitor.",
  "frontend/public/manifest.json": "PWA manifest for Crypto Position Monitor defining app name, icons, display mode, theme colors, categories, and an 'Add Position' shortcut.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first for static assets, network-first for HTML and Binance API calls, with install/activate lifecycle handlers for cache versioning and cleanup.",
  "frontend/src/App.tsx": "Root React component that composes position storage, monitoring, and portfolio exposure hooks, renders the header, tab navigation, and routes between Dashboard, AI Daily Trades, AI Insights, and Risk Management tabs.",
  "frontend/src/components/AdjustmentSuggestionCard.tsx": "Alert-style card that presents an AI-generated stop-loss or take-profit adjustment suggestion with accept and dismiss actions.",
  "frontend/src/components/AIDailyTradesSection.tsx": "Collapsible section component that displays AI-generated daily trades using React Query hooks for trade generation, monitoring, and storage, with loading skeletons and a force-refresh button.",
  "frontend/src/components/AIDailyTradesSummary.tsx": "Summary panel showing aggregated AI portfolio PnL, win/loss counts, and reversal guard activations for the current day's AI trades.",
  "frontend/src/components/AIDailyTradesTab.tsx": "Tab layout component that composes AIDailyTradesSection and PerformanceComparisonPanel into a single view.",
  "frontend/src/components/AIInsightsTab.tsx": "Tab component that renders per-position AI insights including sentiment gauges, trend predictions, and adjustment suggestions, with an empty state when no positions exist.",
  "frontend/src/components/AITradeCard.tsx": "Card component for displaying a single AI trade with real-time price, PnL, TP/SL progress bars, risk management step tracker, reversal guard status, and live trading toggle.",
  "frontend/src/components/BinanceCredentialsPanel.tsx": "Form panel for saving, clearing, and testing Binance API credentials, with connection status feedback and a masked secret field.",
  "frontend/src/components/CredentialStatusIndicator.tsx": "A memoized React component that displays badge indicators for API key presence and live trading mode, reactively updating via custom DOM events ('credential-change', 'live-trading-change') without page reload.",
  "frontend/src/components/DashboardTab.tsx": "The main dashboard tab component that renders capital summary, open positions, and a position entry form, with a Binance import button that appears reactively when API credentials are available.",
  "frontend/src/components/ExposureChart.tsx": "Renders two cards showing asset allocation percentages as progress bars and a long/short balance breakdown for the current portfolio positions.",
  "frontend/src/components/InstallButton.tsx": "A PWA install button that triggers the native browser install prompt if available, or shows a manual instructions modal as a fallback; hidden when the app is already installed.",
  "frontend/src/components/InstallInstructionsModal.tsx": "A dialog modal providing step-by-step PWA installation instructions for multiple browsers (Chrome, Safari, Edge, Firefox), each with icons and numbered steps.",
  "frontend/src/components/LiveRiskMetricsCard.tsx": "Fetches live prices and leverage bracket data via React Query to compute and display per-position liquidation prices, distance-to-liquidation, and risk levels (safe/warning/danger) for all open positions.",
  "frontend/src/components/LiveTradingBanner.tsx": "A memoized amber warning banner that appears at the top of the page when live trading is enabled, reactively toggling via custom DOM events without requiring a page reload.",
  "frontend/src/components/LiveTradingToggle.tsx": "A toggle switch component for enabling/disabling live trading mode, featuring a confirmation dialog before activation, a 20-second outer timeout safety mechanism, and loading state indicators.",
  "frontend/src/components/PerformanceComparisonPanel.tsx": "A side-by-side performance comparison panel that displays metrics (win rate, PnL, total trades) for AI-generated trades versus user trades, pulling data from their respective history storage utilities.",
  "frontend/src/components/PortfolioExposureDashboard.tsx": "A dashboard card that visualizes portfolio exposure metrics including total capital deployed, capital at risk, live unrealized PnL, and live exposure, with support for enriched live-price positions.",
  "frontend/src/components/PositionCard.tsx": "A collapsible card component for a single trading position that displays PnL, TP/SL distances, AI adjustment suggestions, sentiment gauge, trend prediction, and triggers a trade outcome modal on deletion.",
  "frontend/src/components/PositionDashboard.tsx": "A dashboard component that renders a list of active trading positions using real-time price monitoring, showing an empty state with an add-position prompt when no positions exist.",
  "frontend/src/components/PositionEntryForm.tsx": "A form component for entering a new trading position, collecting symbol, type, leverage, entry price, and investment amount, then fetching historical klines to calculate take-profit levels and stop-loss before calling onSubmit with the constructed Position object.",
  "frontend/src/components/PositionSizeCalculator.tsx": "A calculator component that computes recommended position size based on capital, risk percentage, entry price, stop-loss price, and leverage, with live Binance price fetching and leverage bracket validation for a selected symbol.",
  "frontend/src/components/RiskManagementTab.tsx": "A tab layout component that composes LiveRiskMetricsCard, PositionSizeCalculator, PortfolioExposureDashboard, and ScenarioSimulator into a single risk management view, conditionally rendering exposure and metrics only when positions exist.",
  "frontend/src/components/ScenarioSimulator.tsx": "A component that simulates portfolio P&L under user-defined or preset percentage-change scenarios, enriching positions with live Binance prices and computing ATR-based presets from fetched klines data.",
  "frontend/src/components/SentimentGauge.tsx": "A card component that displays market sentiment (bullish/bearish/neutral) for a given symbol, showing a strength progress bar and up to three contributing indicator factors sourced from the useSentimentAnalysis hook.",
  "frontend/src/components/SettingsDialog.tsx": "A modal dialog with three tabs—Binance API credentials, live trading toggle, and total capital input—providing a centralized settings UI for the application.",
  "frontend/src/components/StopLossRecommendations.tsx": "Displays a stop loss recommendation card showing the stop price, distance from current price, max loss, capital risk percentage, reasoning, and a partial taking strategy alert. Highlights the card when price is within 2% of the stop loss.",
  "frontend/src/components/TabNavigation.tsx": "Renders a sticky horizontal tab navigation bar with four tabs: Dashboard, AI Daily Trades, AI Insights, and Risk Management. Highlights the active tab with a golden glow style.",
  "frontend/src/components/TakeProfitRecommendations.tsx": "Renders a list of take profit level cards showing target price, distance from current price, profit in USD and percent, and reasoning. Cards are highlighted when the target price has been reached.",
  "frontend/src/components/TotalCapitalInput.tsx": "Provides a form card for entering and saving the user's total trading capital to local storage. Validates input, shows a success state, and notifies via toast on save.",
  "frontend/src/components/TotalCapitalSummary.tsx": "Displays a summary card of total, deployed, available, and at-risk capital derived from the user's positions and stored total capital. Supports inline editing of the total capital value and listens for cross-component capital change events.",
  "frontend/src/components/TradeOutcomeModal.tsx": "A dialog modal for closing a position by recording the trade outcome (TP Hit, SL Hit, or Manually Closed) and exit price. Calculates and previews PnL before saving a UserTradeRecord.",
  "frontend/src/components/TrendPredictionCard.tsx": "Displays AI-generated short-term and medium-term trend predictions (direction and confidence) for a given symbol using the useTrendPrediction hook. Shows directional icons and badges with appropriate color coding.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an ICP backend actor via React Query, using the current Internet Identity, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAdjustmentSuggestions.ts": "React Query hook that fetches recent hourly Binance kline data for each open position and generates trade adjustment suggestions, refreshing every 30 seconds.",
  "frontend/src/hooks/useAITradeGeneration.ts": "React Query hook that generates AI trades for each trading modality and places corresponding live Binance orders (entry, TP, SL) with per-call 10-second timeouts, toasting results and persisting trades locally.",
  "frontend/src/hooks/useAITradeMonitoring.ts": "React Query hook that monitors active AI trades by polling current Binance prices, evaluating TP/SL crossings and reversal detection, updating trade state in localStorage, and triggering live close orders when needed.",
  "frontend/src/hooks/useAITradeStorage.ts": "Utility hook providing CRUD helpers (get, save, clear) for AI trades persisted in localStorage, with backward-compatible default values and no UTC-date-based invalidation.",
  "frontend/src/hooks/useBinancePairs.ts": "Thin React Query hook that fetches and caches the list of Binance perpetual futures pairs for one hour.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY AuthClient login, logout, and identity state with configurable options.",
  "frontend/src/hooks/useLiveTradingMode.ts": "Hook that manages the live trading toggle state, validates Binance API credentials with a 15-second timeout before enabling, and listens for storage-level change events.",
  "frontend/src/hooks/usePortfolioExposure.ts": "Custom hook that fetches live prices for portfolio positions every 30 seconds and enriches each position with live exposure, unrealized PnL, liquidation price, and distance-to-liquidation calculations.",
  "frontend/src/hooks/usePositionMonitoring.ts": "Custom hook that polls current prices for all tracked positions every 5 seconds and returns each position enriched with PnL and distance-to-TP/SL metrics.",
  "frontend/src/hooks/usePositionStorage.ts": "Custom hook managing position persistence in localStorage, with optional fire-and-forget live order placement (entry, TP, SL) via Binance when live trading is enabled, each call wrapped in a 10-second timeout.",
  "frontend/src/hooks/usePWAInstall.ts": "Hook that captures the browser's beforeinstallprompt event to expose PWA installability state and an install() trigger function.",
  "frontend/src/hooks/useQueries.ts": "Intentionally empty placeholder module; all data fetching is done directly via Binance API calls rather than a backend canister.",
  "frontend/src/hooks/useSentimentAnalysis.ts": "Custom hook that fetches 100 hourly klines from Binance Futures and runs a sentiment analysis on close prices and volumes, refreshing every 30 seconds.",
  "frontend/src/hooks/useTrendPrediction.ts": "Custom hook that fetches hourly and daily klines from Binance Futures and returns short-term and medium-term trend predictions, refreshing every 5 minutes.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind directives and defines a golden-themed CSS custom property palette for both light and dark modes, including chart, sidebar, sentiment, and PWA-specific styles.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with TanStack QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/services/binanceApi.ts": "Service module providing typed async functions to call the Binance USDT-M Futures REST API, including fetching perpetual pairs, single/batch prices, klines, ticker prices, and leverage bracket data.",
  "frontend/src/services/binanceOrderService.ts": "Service for placing Binance USD-M Futures orders (market, take-profit, stop-loss) via the fapi.binance.com API, using HMAC-SHA256 signing with the Web Crypto API.",
  "frontend/src/services/binancePositionService.ts": "Fetches open positions from Binance USD-M Futures (/fapi/v2/positionRisk) and maps them to the app's internal Position type, adding placeholder TP/SL values.",
  "frontend/src/types/adjustment.ts": "Defines TypeScript types for position adjustment suggestions (take-profit or stop-loss) and their acceptance/dismissal history.",
  "frontend/src/types/aiTrade.ts": "Defines types for AI-generated trades including status, modality, TP/SL levels, risk management steps, reversal detection state, and live Binance order IDs.",
  "frontend/src/types/binanceApi.ts": "TypeScript interfaces for Binance Futures API responses including account info, position risk, orders, leverage brackets, and order ID tracking.",
  "frontend/src/types/calculator.ts": "Defines input and result types for the position size calculator, covering capital, risk, entry/stop prices, leverage, and computed risk/reward metrics.",
  "frontend/src/types/exposure.ts": "Defines types for portfolio exposure analysis including per-asset exposure, long/short balance, correlation risk, and warning flags.",
  "frontend/src/types/position.ts": "Defines core Position types including take-profit levels, stop-loss recommendations, and a price-enriched PositionWithPrice variant with PnL and distance metrics.",
  "frontend/src/types/prediction.ts": "Defines types for trend predictions (direction, confidence, time horizon) and their historical accuracy tracking.",
  "frontend/src/types/reversal.ts": "Defines types for market reversal detection signals including RSI divergence, EMA crossover, candlestick patterns, volatility spikes, and support/resistance violations.",
  "frontend/src/types/scenario.ts": "Defines types for scenario analysis simulating price changes across positions, including per-position outcomes and aggregate portfolio impact.",
  "frontend/src/types/sentiment.ts": "Defines types for market sentiment analysis including bullish/bearish/neutral scores, contributing factors, and strength metrics.",
  "frontend/src/types/tradeHistory.ts": "Defines types for user and AI trade records, trade outcomes, modality performance statistics, and overall performance metrics.",
  "frontend/src/utils/adjustmentSuggestions.ts": "Generates TP/SL adjustment suggestions for open positions based on ATR-derived volatility, 24h price change, and proximity to support/resistance levels.",
  "frontend/src/utils/aiTradeHistoryStorage.ts": "Provides localStorage-backed CRUD utilities for persisting AI trade history records, with duplicate-entry prevention.",
  "frontend/src/utils/aiTradeSelection.ts": "Computes technical indicators (EMA, RSI, ATR, momentum) from Binance kline data and uses per-modality configuration to generate AI trade signals with entry, take-profit, and stop-loss levels.",
  "frontend/src/utils/binanceAuth.ts": "Provides HMAC-SHA256 signed authenticated fetch requests to the Binance API with a 15-second timeout, combined abort signal handling, and a custom BinanceApiError class.",
  "frontend/src/utils/exposureCalculations.ts": "Calculates portfolio exposure metrics including total capital deployed, weighted average leverage, long/short balance, per-asset breakdown, and correlation risks with warning flags.",
  "frontend/src/utils/liveTradingStorage.ts": "Manages live trading mode, Binance credentials, and per-modality live order toggles in localStorage, dispatching deferred custom DOM events on changes.",
  "frontend/src/utils/marketReversalDetector.ts": "Detects market trend reversals by analyzing Binance kline data using RSI divergence, EMA crossovers, candlestick patterns, ATR volatility spikes, and support/resistance violations across modality-specific timeframes.",
  "frontend/src/utils/performanceCalculations.ts": "Calculates win rate, total PnL, and performance metrics for both user and AI trade records, with per-modality breakdown for AI trades.",
  "frontend/src/utils/pnlCalculations.ts": "Calculates leveraged PnL in USD and percentage for long/short positions, and computes the percentage distance between current and target prices.",
  "frontend/src/utils/positionSizeCalculator.ts": "Calculates position size, number of contracts, risk/reward amounts, and risk-reward ratio based on capital, risk percentage, stop-loss price, entry price, and leverage inputs.",
  "frontend/src/utils/registerServiceWorker.ts": "Registers a service worker, listens for updates and prompts the user to reload, and schedules hourly update checks.",
  "frontend/src/utils/scenarioSimulator.ts": "Simulates portfolio impact under price change scenarios by projecting P&L, TP/SL hits, and liquidation risk for each position, and provides preset market scenarios.",
  "frontend/src/utils/sentimentAnalysis.ts": "Computes market sentiment by calculating technical indicators (RSI, MACD, volume trend, price action, momentum) from price and volume data and aggregating bullish/bearish signals.",
  "frontend/src/utils/stopLossCalculator.ts": "Calculates a recommended stop-loss price using ATR, support/resistance levels, and leverage-adjusted risk percentages, returning loss amounts and a partial-taking strategy description.",
  "frontend/src/utils/takeProfitCalculator.ts": "Generates three take-profit levels (conservative, moderate, aggressive) based on volatility, support/resistance, and leverage, with profit amounts and reasoning for each level.",
  "frontend/src/utils/technicalAnalysis.ts": "Provides core technical analysis utilities: ATR calculation, volatility measurement, support/resistance detection via price clustering, and risk-reward ratio computation.",
  "frontend/src/utils/totalCapitalStorage.ts": "Manages total trading capital in localStorage with get, set, and validate functions, dispatching a custom DOM event on changes for reactive updates.",
  "frontend/src/utils/tradeHistoryStorage.ts": "Handles CRUD operations for user trade history records persisted in localStorage, with functions to retrieve, save, and clear records.",
  "frontend/src/utils/trendPrediction.ts": "Predicts short-term (1-24 hours) and medium-term (1-7 days) price trend direction and confidence using moving averages, momentum, and volatility from hourly and daily price data.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom colors (using oklch variables), border radii, box shadows, accordion animations, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata file tracking version 49 of a crypto trading monitoring app, documenting architectural notes, known issues, and a list of existing implemented features."
}