{
  "kind": "build_request",
  "title": "Fix AI Daily Trades P&L showing 0.00 — live price not applied to trade cards",
  "projectName": "Crypto Position Monitor",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-133",
      "text": "Fix the AI Daily Trades P&L calculation in AIDailyTradesSection.tsx so that the live current price fetched from https://fapi.binance.com/fapi/v1/ticker/price is reliably obtained before any PnL calculation runs. Audit the polling mechanism inside AIDailyTradesSection: ensure the price fetch completes and returns a non-zero, non-undefined value before buildng the enriched trade objects passed to AITradeCard. If the price is still loading (0 or undefined), pass a loading flag to AITradeCard instead of a zero price so PnL is not computed with an invalid baseline.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "1 - prioridade",
          "AI Daily Trades P&L values show as 0.00 — live current price not being fetched/applied correctly for PnL calculation on trade cards"
        ]
      },
      "acceptanceCriteria": [
        "AIDailyTradesSection fetches current prices from https://fapi.binance.com/fapi/v1/ticker/price for every open AI trade symbol before rendering AITradeCard components.",
        "The enriched trade objects passed to AITradeCard contain a currentPrice value that is a valid non-zero number.",
        "If price data has not yet loaded, AITradeCard renders a loading indicator (e.g., spinner or '--') instead of '0.00' for PnL fields.",
        "Once a valid price is received, PnL in USD and percentage is calculated correctly using pnlCalculations.ts with the correct entry price, current price, leverage, investment, and position type.",
        "PnL values update automatically on each polling cycle without requiring a page refresh."
      ]
    },
    {
      "id": "REQ-134",
      "text": "Fix AITradeCard.tsx so that it guards against a zero or undefined currentPrice before calling the PnL calculation. Inside the card, check that currentPrice is a finite number greater than zero before invoking calculatePnl (or the equivalent function from pnlCalculations.ts). When currentPrice is not yet available, display a loading indicator (e.g., a spinner or '…') in the PnL display area. When currentPrice is valid, display the computed PnL in USD and percentage with correct color coding (green for profit, red for loss).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "AI Daily Trades P&L values show as 0.00 — live current price not being fetched/applied correctly for PnL calculation on trade cards"
        ]
      },
      "acceptanceCriteria": [
        "AITradeCard never displays '0.00' PnL when currentPrice has not loaded — it shows a loading indicator instead.",
        "PnL in USD and percentage is only computed when currentPrice is a finite number greater than zero.",
        "calculatePnl (or pnlCalculations.ts equivalent) is called with all five required arguments: entryPrice, currentPrice, leverage, investment, and positionType.",
        "Green color is applied to positive PnL values and red to negative PnL values.",
        "The daily performance summary header in AIDailyTradesSummary correctly aggregates PnL only from trades that have a valid price loaded."
      ]
    },
    {
      "id": "REQ-135",
      "text": "Fix the duplicate 'Day Trading' modality card in the AI Daily Trades tab. Audit useAITradeGeneration.ts and useAITradeStorage.ts to ensure that exactly four unique modality trades are stored and rendered — one each for 'Scalping', 'Day Trading', 'Swing Trading', and 'Trend Following'. Detect and remove any duplicate entries with the same modality in the stored 'ai_daily_trades' localStorage array. Add a deduplication guard in the storage write path so that if a trade for a modality already exists with status 'Open', no second trade for that same modality is inserted.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "AI Daily Trades tab shows duplicate 'Day Trading' modality card instead of four unique modalities (Scalping, Day Trading, Swing Trading, Trend Following)"
        ]
      },
      "acceptanceCriteria": [
        "The AI Daily Trades tab always renders exactly four trade cards: one for Scalping, one for Day Trading, one for Swing Trading, and one for Trend Following.",
        "No two cards share the same modality label.",
        "If the current localStorage 'ai_daily_trades' array contains duplicate modality entries, the duplicates are removed on next load (keeping the most recently generated trade per modality).",
        "The deduplication guard in the storage write path prevents inserting a second open trade for any modality that already has an open trade."
      ]
    }
  ],
  "constraints": [
    "Do not modify files listed in frontend.immutablePaths.",
    "Do not alter backend/main.mo — no backend changes are required for this fix.",
    "Do not change the existing golden-themed CSS variables or Tailwind configuration.",
    "Fixes must be non-breaking — existing open AI trades in localStorage must continue to render correctly after the fix."
  ],
  "nonGoals": [
    "Adding new features to the AI Daily Trades tab beyond fixing P&L display and duplicate cards.",
    "Changing the trade selection algorithm or modality configuration.",
    "Modifying the PerformanceComparisonPanel or AIDailyTradesSummary aggregation logic beyond what is needed to fix the 0.00 PnL bug."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}