{
  "kind": "build_request",
  "title": "Auto-load and use Binance credentials on app start for seamless credential-driven operation",
  "projectName": "Crypto Position Monitor",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-113",
      "text": "On application load, check whether Binance credentials are present in localStorage (using hasCredentials() from binanceAuth.ts). If credentials are found, automatically trigger an import of the user's open positions from Binance USD-M Futures (via binancePositionService.ts / the existing getOpenPositions function) and merge them into the positions list managed by usePositionStorage, skipping any symbol already tracked. Display a non-blocking toast notification indicating how many positions were imported (e.g., 'Auto-imported 3 positions from Binance') or an error message if the import fails. This auto-import must run once per app session on mount, not on every re-render.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Vamos ajustar para trabalhar com credenciais."
        ]
      },
      "acceptanceCriteria": [
        "On app load, if hasCredentials() returns true, getOpenPositions() is called automatically without any user interaction.",
        "Positions returned from Binance are merged into usePositionStorage, skipping duplicates by symbol.",
        "A toast notification appears confirming the number of imported positions or showing an error.",
        "The auto-import runs only once per mount — not on every re-render or tab switch.",
        "If credentials are absent, no import attempt is made and no error is shown."
      ]
    },
    {
      "id": "REQ-114",
      "text": "Update the Settings onboarding flow so that when the user saves Binance credentials for the first time (in BinanceCredentialsPanel.tsx) and both the API key and secret are non-empty, immediately trigger an automatic position import from Binance after the credentials are saved — without requiring the user to navigate to the Dashboard tab and click 'Import from Binance'. After the import completes, show a toast (e.g., 'Credentials saved — imported N positions from Binance') and switch the active tab to 'Dashboard' so the user can see their positions right away.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Vamos ajustar para trabalhar com credenciais."
        ]
      },
      "acceptanceCriteria": [
        "After the user saves valid credentials in BinanceCredentialsPanel, an automatic position import is triggered immediately.",
        "A combined toast confirms credential save and import result.",
        "The active tab switches to 'Dashboard' after the import completes.",
        "If the import fails, credentials are still saved and an error toast is shown.",
        "The flow does not block the UI — all async steps are non-blocking with proper error handling."
      ]
    },
    {
      "id": "REQ-115",
      "text": "Add a periodic background sync that refreshes the position list from Binance every 60 seconds when credentials are present (hasCredentials() returns true) and Live Trading mode is ON (isLiveTradingEnabled() returns true). On each sync cycle, call getOpenPositions() and merge any new positions into usePositionStorage (skip existing symbols). Remove from the local list any position whose symbol no longer appears in the Binance response (i.e., it has been closed on the exchange). Do not show a toast on routine syncs — only show a toast if new positions are added or existing ones are removed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Vamos ajustar para trabalhar com credenciais."
        ]
      },
      "acceptanceCriteria": [
        "When credentials are present and Live Trading mode is ON, positions are synced from Binance every 60 seconds.",
        "New positions found in Binance that are not in the local list are added automatically.",
        "Positions closed on Binance (positionAmt = 0) are removed from the local list.",
        "No toast is shown for routine syncs with no changes.",
        "A toast is shown only when positions are added or removed.",
        "The sync loop stops when credentials are cleared or Live Trading mode is turned OFF."
      ]
    },
    {
      "id": "REQ-116",
      "text": "Update the Dashboard tab (DashboardTab.tsx) to display a prominent onboarding banner when no Binance credentials are configured (hasCredentials() returns false). The banner must clearly instruct the user to open Settings (gear icon) and enter their Binance API Key and Secret to get started. Include a direct 'Open Settings' button inside the banner that opens the SettingsDialog immediately. The banner must disappear as soon as credentials are saved, reactively responding to the 'credential-change' custom DOM event without requiring a page reload.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Vamos ajustar para trabalhar com credenciais."
        ]
      },
      "acceptanceCriteria": [
        "When no credentials are stored, a prominent onboarding banner is visible in the Dashboard tab.",
        "The banner contains an 'Open Settings' button that opens the SettingsDialog.",
        "The banner disappears immediately after credentials are saved, without a page reload.",
        "When credentials are present, the banner is not rendered.",
        "The banner uses the existing golden-themed card/alert design system."
      ]
    },
    {
      "id": "REQ-117",
      "text": "Update the AI Daily Trades tab to automatically use the user's Binance account balance as the total capital value when credentials are present. On app load (or after credentials are saved), fetch the account's available balance from the Binance USD-M Futures account endpoint (https://fapi.binance.com/fapi/v2/account) using authenticatedFetch from binanceAuth.ts. Extract the totalWalletBalance field and, if the stored total_capital in localStorage is unset or zero, automatically set it via totalCapitalStorage to the fetched wallet balance. If the stored total_capital already has a user-defined value, do not overwrite it — only pre-fill when no value exists. Show a toast 'Total capital set from Binance account: $X' when auto-filled.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Vamos ajustar para trabalhar com credenciais."
        ]
      },
      "acceptanceCriteria": [
        "On app load with credentials present, the Binance account balance is fetched from https://fapi.binance.com/fapi/v2/account.",
        "If total_capital in localStorage is unset or zero, it is auto-filled with totalWalletBalance from the Binance response.",
        "If total_capital already has a user-defined non-zero value, it is not overwritten.",
        "A toast confirms when total capital is auto-filled from Binance.",
        "If the fetch fails, the app continues normally with no error blocking the UI.",
        "The fetched balance is used as the base for AI daily trade investment amounts and risk calculations."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files listed in frontend.immutablePaths.",
    "All async Binance API calls must be non-blocking with proper try/catch/finally and timeouts.",
    "Credential reads must be reactive — use the 'credential-change' custom DOM event, not static one-time reads.",
    "Do not overwrite a user's manually set total_capital value when auto-filling from Binance.",
    "All new UI elements must follow the existing golden-themed design system (CSS variables, Tailwind tokens)."
  ],
  "nonGoals": [
    "Adding any new tabs or restructuring the existing tab layout.",
    "Modifying the backend Motoko canister.",
    "Implementing any new AI analysis algorithms beyond what is already in place.",
    "Changing the HMAC-SHA256 signing logic in binanceAuth.ts beyond what is already implemented."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}