{
  "kind": "build_request",
  "title": "Rebuild App from Scratch with Motoko Proxy for Binance Order Execution",
  "projectName": "Binance Order Terminal",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-138",
      "text": "Implement a Motoko backend canister (backend/main.mo) on the Internet Computer that acts as an authenticated HTTP outcall proxy for Binance USD-M Futures order placement. The canister must expose the following public update methods: (1) placeMarketOrder(apiKey: Text, apiSecret: Text, symbol: Text, side: Text, quantity: Text) — signs and forwards a POST to https://fapi.binance.com/fapi/v1/order with type=MARKET; (2) placeLimitOrder(apiKey: Text, apiSecret: Text, symbol: Text, side: Text, quantity: Text, price: Text) — signs and forwards a POST with type=LIMIT and timeInForce=GTC; (3) placeStopMarketOrder(apiKey: Text, apiSecret: Text, symbol: Text, side: Text, quantity: Text, stopPrice: Text) — signs and forwards with type=STOP_MARKET; (4) placeTakeProfitMarketOrder(apiKey: Text, apiSecret: Text, symbol: Text, side: Text, quantity: Text, stopPrice: Text) — signs and forwards with type=TAKE_PROFIT_MARKET; (5) cancelOrder(apiKey: Text, apiSecret: Text, symbol: Text, orderId: Text) — signs and forwards a DELETE to https://fapi.binance.com/fapi/v1/order. Each method must: append a server-side timestamp parameter, compute the HMAC-SHA256 signature over the full query string using the provided apiSecret, attach the X-MBX-APIKEY header with the apiKey, perform the HTTP outcall, and return the raw JSON response body as Text or a typed error message. The canister must never persist API keys or secrets — they are passed per-call only.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "implemente um backend canister em Motoko para servir de proxy para as chamadas autenticadas da Binance",
          "Vamos usar o próxy apenas para envio de ordens en geral",
          "construa toda a aplicação do zero"
        ]
      },
      "acceptanceCriteria": [
        "The Motoko canister compiles and deploys without errors",
        "placeMarketOrder, placeLimitOrder, placeStopMarketOrder, placeTakeProfitMarketOrder, and cancelOrder methods are all callable from the frontend actor",
        "Each method appends a timestamp, computes HMAC-SHA256 signature, and sets the X-MBX-APIKEY header before making the HTTP outcall to https://fapi.binance.com",
        "API keys are never stored in canister state — they are used only within the scope of a single call",
        "Methods return the raw Binance JSON response or a descriptive error string"
      ]
    },
    {
      "id": "REQ-139",
      "text": "Build the complete React + TypeScript frontend from scratch with a minimal, focused scope. The application must have exactly three views accessible via a tab navigation bar: (1) Dashboard tab — displays open positions imported from Binance with real-time PnL (polled every 5 seconds from https://fapi.binance.com/fapi/v1/ticker/price); (2) Order Terminal tab — a form to place new orders (Market, Limit, Stop Market, Take Profit Market) for any Binance USD-M Futures perpetual pair selected from a dropdown populated via https://fapi.binance.com/fapi/v1/exchangeInfo; (3) Settings tab — Binance API Key and Secret input fields (secret masked), Save/Clear buttons, a Test Connection button that calls https://fapi.binance.com/fapi/v2/account via the Motoko proxy, and a Live Trading mode toggle. All localStorage keys from the previous version must be ignored — start with no persisted data assumptions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "reduza o aplicativo para fazer apenas as funcoes extremamente necessárias para conseguir se comunicar com a binance enviando ordens sem restrições",
          "construa toda a aplicação do zero",
          "tudo do zero"
        ]
      },
      "acceptanceCriteria": [
        "Three tabs render correctly: Dashboard, Order Terminal, and Settings",
        "Dashboard shows imported positions with live PnL updated every 5 seconds",
        "Order Terminal allows selecting any perpetual pair and placing Market, Limit, Stop Market, and Take Profit Market orders",
        "Settings tab saves API Key and Secret to localStorage, has a working Test Connection button, and a Live Trading toggle",
        "No references to the previous application's complex features (SMC, AI trades, recovery engine, etc.) exist in the codebase"
      ]
    },
    {
      "id": "REQ-140",
      "text": "Create a frontend service module (frontend/src/services/binanceProxyService.ts) that calls the Motoko backend canister actor (via the useActor hook) instead of making direct authenticated fetch calls to Binance. Expose the same function signatures as the previous binanceOrderService.ts: placeMarketOrder, placeLimitOrder, placeStopMarketOrder, placeTakeProfitMarketOrder, and cancelOrder. Each function must retrieve the stored API Key and Secret from localStorage (keys: 'binance_api_key' and 'binance_api_secret'), pass them as parameters to the corresponding canister method, and return the parsed JSON response or throw a typed error. If credentials are missing, throw a descriptive error before invoking the canister.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Vamos usar o próxy apenas para envio de ordens en geral",
          "Caso funcione podemos tentar novas funcoes . Posteriormente"
        ]
      },
      "acceptanceCriteria": [
        "binanceProxyService.ts exports placeMarketOrder, placeLimitOrder, placeStopMarketOrder, placeTakeProfitMarketOrder, and cancelOrder",
        "Each function reads API credentials from localStorage and passes them to the Motoko canister actor",
        "If credentials are missing, a descriptive error is thrown before any canister call is made",
        "Successful canister responses are parsed and returned as typed objects",
        "Failed canister calls throw a typed error with the Binance error message"
      ]
    },
    {
      "id": "REQ-141",
      "text": "Create a credentials utility module (frontend/src/utils/credentialsStorage.ts) that manages Binance API credentials in localStorage. Expose: (1) saveCredentials(apiKey: string, apiSecret: string) — saves both values under keys 'binance_api_key' and 'binance_api_secret' and dispatches a custom DOM event 'credential-change'; (2) getCredentials() — returns { apiKey, apiSecret } from localStorage; (3) clearCredentials() — removes both keys and dispatches 'credential-change'; (4) hasCredentials() — returns true only if both keys are present and non-empty. The 'credential-change' event must be dispatched synchronously after every write so dependent components update reactively without a page reload.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "reduza o aplicativo para fazer apenas as funcoes extremamente necessárias"
        ]
      },
      "acceptanceCriteria": [
        "saveCredentials stores both keys in localStorage and dispatches 'credential-change'",
        "getCredentials returns the stored values or empty strings if not set",
        "clearCredentials removes both keys and dispatches 'credential-change'",
        "hasCredentials returns false if either key is missing or empty",
        "Components subscribing to 'credential-change' update without a page reload"
      ]
    },
    {
      "id": "REQ-142",
      "text": "Implement the Order Terminal tab (frontend/src/components/OrderTerminalTab.tsx) as the primary order placement interface. The tab must contain: (1) an asset selector dropdown/autocomplete populated with all perpetual pairs from https://fapi.binance.com/fapi/v1/exchangeInfo filtered by contractType === 'PERPETUAL', with a loading state while fetching and an error message on failure; (2) a live current price display for the selected symbol fetched from https://fapi.binance.com/fapi/v1/ticker/price, refreshed every 5 seconds; (3) order type selector: Market, Limit, Stop Market, Take Profit Market; (4) side selector: Buy (Long) / Sell (Short); (5) quantity input (numeric, required); (6) price input (shown only for Limit orders); (7) stop price input (shown for Stop Market and Take Profit Market orders); (8) a 'Place Order' button that is disabled when Live Trading mode is OFF — show a tooltip 'Enable Live Trading in Settings to place real orders'; (9) when Live Trading mode is ON and credentials are present, clicking 'Place Order' calls the appropriate function from binanceProxyService.ts, shows a loading state on the button, and displays a success toast with the order ID or an error toast on failure. All order calls must be wrapped in try/catch with a 15-second timeout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "reduza o aplicativo para fazer apenas as funcoes extremamente necessárias para conseguir se comunicar com a binance enviando ordens sem restrições. Esse eh o objtvo primario"
        ]
      },
      "acceptanceCriteria": [
        "Asset dropdown shows all PERPETUAL pairs from Binance exchangeInfo",
        "Live price updates every 5 seconds for the selected symbol",
        "Order type, side, quantity, price, and stop price inputs render correctly based on order type selection",
        "Place Order button is disabled when Live Trading mode is OFF with a tooltip explanation",
        "Successful order placement shows a toast with the returned order ID",
        "Failed order placement shows an error toast with the Binance error message",
        "All order calls time out after 15 seconds with a descriptive error toast"
      ]
    },
    {
      "id": "REQ-143",
      "text": "Implement the Dashboard tab (frontend/src/components/DashboardTab.tsx) that displays the user's open positions imported from Binance. The tab must include: (1) an 'Import Positions' button — visible only when hasCredentials() returns true — that calls https://fapi.binance.com/fapi/v2/positionRisk via the Motoko proxy canister, filters for entries where positionAmt is non-zero, maps them to a simple local Position type (symbol, side as Long/Short based on positionAmt sign, entryPrice, quantity, leverage), and stores them in localStorage under 'positions'; (2) a position list that renders each position as a card showing symbol, side badge (green for Long, red for Short), entry price, quantity, leverage, current price fetched from https://fapi.binance.com/fapi/v1/ticker/price, and unrealized PnL in USD and percentage — updated every 5 seconds; (3) an onboarding banner when hasCredentials() returns false instructing the user to go to Settings and enter their API credentials; (4) a 'Remove' button on each position card to delete it from the local list. Live prices must be fetched directly from the browser (public endpoint, no proxy needed) — only authenticated calls go through the Motoko proxy.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "reduza o aplicativo para fazer apenas as funcoes extremamente necessárias"
        ]
      },
      "acceptanceCriteria": [
        "Import Positions button is visible only when credentials are configured",
        "Clicking Import Positions fetches from Binance positionRisk via the proxy and stores non-zero positions in localStorage",
        "Each position card shows symbol, side, entry price, quantity, leverage, live current price, and PnL",
        "PnL updates every 5 seconds using live price from the public Binance ticker endpoint",
        "Onboarding banner appears when no credentials are configured and disappears reactively after credentials are saved",
        "Remove button deletes the position from the local list and localStorage"
      ]
    },
    {
      "id": "REQ-144",
      "text": "Implement the Settings tab (frontend/src/components/SettingsTab.tsx) with three sections: (1) API Credentials — text input for API Key, password-type input for API Secret, a 'Save' button that calls saveCredentials() and shows a success toast, a 'Clear' button that calls clearCredentials(), and a warning notice 'Your API keys are stored locally in your browser and are only sent to the Internet Computer canister for signing — never to any third-party server'; (2) Connection Test — a 'Test Connection' button that calls the Motoko proxy canister's account endpoint (https://fapi.binance.com/fapi/v2/account) with the stored credentials, shows a 'Connected ✓' badge on success or 'Invalid credentials ✗' on failure, uses a 15-second timeout, and never leaves the UI in a frozen loading state (always resets loading state in a finally block); (3) Live Trading Mode — a toggle switch labeled 'Live Trading', defaulting to OFF, stored in localStorage under 'live_trading_enabled', with a confirmation dialog before enabling ('Warning: enabling this will send real orders to Binance Futures') and an amber banner visible in the app header whenever Live Trading is active.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "reduza o aplicativo para fazer apenas as funcoes extremamente necessárias para conseguir se comunicar com a binance enviando ordens sem restrições"
        ]
      },
      "acceptanceCriteria": [
        "API Key and Secret inputs save to localStorage on click of Save button and dispatch 'credential-change' event",
        "Clear button removes credentials and dispatches 'credential-change' event",
        "Test Connection calls the Binance account endpoint via Motoko proxy, shows Connected or Invalid credentials status, and resets loading state in all outcomes",
        "Test Connection times out after 15 seconds with a clear status message",
        "Live Trading toggle defaults to OFF and shows a confirmation dialog before enabling",
        "An amber header banner appears when Live Trading is active and disappears when toggled off"
      ]
    },
    {
      "id": "REQ-145",
      "text": "Design the application with a dark, professional trading terminal aesthetic using Tailwind CSS. Use a near-black background (#0a0a0f or equivalent), gold/amber accent colors (consistent with oklch CSS variables) for interactive elements, buttons, and badges, and green/red color coding exclusively for profit/loss indicators. The header must display the app name 'Binance Order Terminal', a credential status indicator ('API Connected' in green or 'No API Key' in amber), a live trading mode amber badge when active, and the tab navigation bar. The layout must be responsive and work on both desktop and mobile screens. Typography must be clean and readable — use a monospace or semi-monospace font for price and numeric data.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "construa toda a aplicação do zero",
          "tudo do zero"
        ]
      },
      "acceptanceCriteria": [
        "Dark background with gold/amber accent colors is applied consistently across all tabs",
        "Prices and numeric values use a monospace or semi-monospace font",
        "Profit values are green, loss values are red",
        "Header shows app name, credential status indicator, and live trading badge when active",
        "Layout is usable on both desktop (≥768px) and mobile (<768px) screen sizes",
        "Tab navigation is sticky and always visible"
      ]
    }
  ],
  "constraints": [
    "The Motoko backend canister must never persist or log API keys or secrets — they are passed per-call only",
    "Authenticated Binance calls (order placement, position import, account info) must go through the Motoko proxy canister — never directly from the browser",
    "Public Binance endpoints (ticker price, exchangeInfo, klines, leverageBracket) may be called directly from the browser without the proxy",
    "Do not carry over any code, components, hooks, or utilities from the previous application version",
    "The application scope is strictly limited to: credential management, position viewing, and order placement — no AI trade generation, no SMC analysis, no recovery engine, no scenario simulator"
  ],
  "nonGoals": [
    "AI Daily Trades feature",
    "SMC / Smart Money Concepts analysis",
    "Market reversal detection",
    "Position recovery engine",
    "Scenario simulator",
    "Portfolio exposure dashboard",
    "Position size calculator",
    "Sentiment analysis",
    "Trend prediction",
    "PWA installation flow",
    "Service worker / offline caching",
    "Performance comparison panel",
    "Trade history tracking",
    "TP/SL auto-adjustment suggestions",
    "Per-modality live order toggles"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}