{
  "kind": "build_request",
  "title": "Fix Live Trading Mode freeze and order execution failure",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-64",
      "text": "Fix the Live Trading mode toggle in LiveTradingToggle.tsx and useLiveTradingMode.ts so that enabling it does not cause the application to freeze or become unresponsive. The freeze likely originates from a synchronous blocking operation, an infinite re-render loop triggered by state changes when live trading is activated, or an unhandled promise rejection in the order placement flow that locks the UI. Audit the toggle activation path — including the confirmation dialog, credential validation, localStorage write, and any reactive effects that fire on live trading state change — and ensure all async operations are non-blocking with proper error boundaries.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Ai ativar a opcao . \" live trade mode\" . O aplicativo trava. Apenas fechando o aplicativo eh possivel alguma ação"
        ]
      },
      "acceptanceCriteria": [
        "Toggling Live Trading mode ON does not freeze, hang, or make the UI unresponsive.",
        "The application remains fully interactive after enabling Live Trading mode.",
        "If credential validation fails asynchronously, the error is caught and displayed as a toast/badge without locking the UI.",
        "No infinite re-render loop is triggered when live trading state changes in localStorage.",
        "The Live Trading amber banner appears correctly in the header after enabling without any UI lockup."
      ]
    },
    {
      "id": "REQ-65",
      "text": "Fix the order execution flow in usePositionStorage.ts, useAITradeGeneration.ts, and binanceOrderService.ts so that when Live Trading mode is ON and valid Binance credentials are present, real orders are actually sent to Binance Futures (https://fapi.binance.com/fapi/v1/order). Ensure all order calls (market entry, TAKE_PROFIT_MARKET, STOP_MARKET) are properly awaited, errors are caught per-order without aborting the entire flow, and the result (success or failure) is surfaced to the user via a toast notification. If an order fails, log the error and continue — do not let a single order failure block position creation or AI trade activation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "nao conseguimos enviar as ordens"
        ]
      },
      "acceptanceCriteria": [
        "When Live Trading mode is ON and credentials are valid, adding a manual position triggers a real MARKET order on Binance Futures followed by TAKE_PROFIT_MARKET and STOP_MARKET orders.",
        "When Live Trading mode is ON and an AI trade is generated, the corresponding entry and TP/SL orders are placed on Binance Futures.",
        "Each order call is wrapped in try/catch; a failure in one order (e.g., TP order) does not prevent the others from being attempted.",
        "A success toast is shown when orders are placed, and an error toast is shown with the Binance error message if an order fails.",
        "Order placement is fully asynchronous and does not block the UI thread."
      ]
    },
    {
      "id": "REQ-66",
      "text": "Audit all useEffect and React Query hooks that listen to the live trading mode state (live_trading_enabled in localStorage) — including useLiveTradingMode.ts, usePositionStorage.ts, and useAITradeGeneration.ts — and remove or fix any dependency array entries or event listener registrations that could cause infinite loops or cascading re-renders when live trading is toggled. Ensure custom window event listeners for live trading state changes are registered once and properly cleaned up on unmount.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "O aplicativo trava. Apenas fechando o aplicativo eh possivel alguma ação"
        ]
      },
      "acceptanceCriteria": [
        "No infinite re-render loops occur when live trading mode is toggled ON or OFF.",
        "Custom window event listeners for live trading state are added once and removed on component unmount.",
        "React Query hooks that depend on live trading state do not refetch in an infinite loop after the toggle.",
        "The application's frame rate and interactivity remain normal after toggling live trading mode multiple times in a session."
      ]
    }
  ],
  "constraints": [
    "Do not change the backend (backend/main.mo).",
    "Do not modify any file listed in frontend.immutablePaths.",
    "Live Trading mode must remain OFF by default.",
    "The existing simulated/fictitious order logic must remain fully functional when Live Trading mode is OFF."
  ],
  "nonGoals": [
    "Adding new trading features or UI sections.",
    "Changing the golden color theme or layout.",
    "Modifying the PWA install flow.",
    "Changing the AI trade selection algorithm."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}