{
  "kind": "build_request",
  "title": "Enhance Risk Management tab with real Binance asset data",
  "projectName": "Crypto Position Monitor",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-89",
      "text": "Update the PositionSizeCalculator component (frontend/src/components/PositionSizeCalculator.tsx) to fetch and use the live current price from the Binance Futures API (https://fapi.binance.com/fapi/v1/ticker/price?symbol=SYMBOL) for the selected asset when calculating position size. Display the live price next to the entry price field as a reference. Also fetch and display the leverage brackets/tiers for the selected symbol from https://fapi.binance.com/fapi/v1/leverageBracket?symbol=SYMBOL (public endpoint, no auth required) to show the maximum allowed leverage and the corresponding maintenance margin rate at the selected leverage level. Warn the user if their chosen leverage exceeds the maximum allowed for the selected symbol.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Atualize a aba de riscos \"risk\" agora que temos informações reais dos ativos na binance."
        ]
      },
      "acceptanceCriteria": [
        "PositionSizeCalculator fetches live price from Binance for the selected symbol and displays it as a reference alongside the entry price field",
        "The component fetches leverage bracket data from https://fapi.binance.com/fapi/v1/leverageBracket and shows the max leverage and maintenance margin rate for the selected symbol at the user-chosen leverage",
        "A warning is displayed if the selected leverage exceeds the maximum allowed leverage tier for the symbol",
        "If the Binance API call fails, the component gracefully falls back to manual input without breaking the UI"
      ]
    },
    {
      "id": "REQ-90",
      "text": "Update the PortfolioExposureDashboard component (frontend/src/components/PortfolioExposureDashboard.tsx) and its underlying usePortfolioExposure hook (frontend/src/hooks/usePortfolioExposure.ts) to enrich each position with its live current price fetched from the Binance Futures ticker API (https://fapi.binance.com/fapi/v1/ticker/price). Use the live prices to calculate real-time unrealized PnL per position, real current exposure (quantity × current price), and distance to liquidation price. Display these live-price-based metrics in the dashboard cards, clearly distinguishing between entry-price-based and current-price-based exposure values. Refresh live prices every 30 seconds.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Atualize a aba de riscos \"risk\" agora que temos informações reais dos ativos na binance."
        ]
      },
      "acceptanceCriteria": [
        "PortfolioExposureDashboard fetches live current prices for all tracked position symbols from Binance ticker API",
        "Real-time unrealized PnL is calculated and displayed per position using live prices",
        "Current exposure (quantity × live price) is shown alongside entry-price-based exposure",
        "Distance to estimated liquidation price is calculated and displayed for each position",
        "Prices refresh every 30 seconds without layout shifts",
        "If price fetch fails for a symbol, the component shows the last known value with a stale data indicator"
      ]
    },
    {
      "id": "REQ-91",
      "text": "Update the ScenarioSimulator component (frontend/src/components/ScenarioSimulator.tsx) and its underlying scenarioSimulator utility (frontend/src/utils/scenarioSimulator.ts) to use live current prices from the Binance Futures ticker API (https://fapi.binance.com/fapi/v1/ticker/price) as the baseline for all scenario calculations instead of entry prices. Additionally, fetch ATR-based volatility data via recent klines (https://fapi.binance.com/fapi/v1/klines) for each position's symbol to dynamically suggest realistic scenario percentages (e.g., '1-day ATR move', '3-day ATR move') as preset buttons alongside the existing presets. Display the current live price used as the simulation baseline for each position in the results panel.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Atualize a aba de riscos \"risk\" agora que temos informações reais dos ativos na binance."
        ]
      },
      "acceptanceCriteria": [
        "ScenarioSimulator fetches live current prices from Binance ticker API and uses them as the simulation baseline instead of entry prices",
        "ATR-based volatility presets (e.g., '1-day ATR', '3-day ATR') are fetched from recent kline data and displayed as additional preset scenario buttons",
        "The live price used as baseline is displayed clearly in the simulation results for each position",
        "Existing preset scenarios ('Market crash -20%', 'Bull run +30%', 'High volatility ±15%') continue to work unchanged",
        "If live price fetch fails, the simulator falls back to entry price with a visible warning message"
      ]
    },
    {
      "id": "REQ-92",
      "text": "Add a new 'Live Risk Metrics' summary card at the top of the Risk Management tab (frontend/src/components/RiskManagementTab.tsx) that displays real-time aggregate risk data fetched from Binance. For each active position, compute and display: (1) estimated liquidation price using the formula based on leverage, entry price, and maintenance margin rate fetched from https://fapi.binance.com/fapi/v1/leverageBracket; (2) distance to liquidation as a percentage from the current live price; (3) a color-coded liquidation risk badge — green if >20% away, amber if 10–20% away, red if <10% away. Show a portfolio-level summary row aggregating the number of positions at each risk level. Refresh all metrics every 30 seconds.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Atualize a aba de riscos \"risk\" agora que temos informações reais dos ativos na binance."
        ]
      },
      "acceptanceCriteria": [
        "A 'Live Risk Metrics' card is rendered at the top of the Risk Management tab",
        "Estimated liquidation price is computed per position using leverage bracket maintenance margin rates from Binance API",
        "Distance to liquidation is shown as a percentage using the live current price",
        "Color-coded badges indicate liquidation risk: green (>20%), amber (10–20%), red (<10%)",
        "A portfolio summary row shows how many positions fall into each risk level",
        "All metrics refresh every 30 seconds",
        "If the leverageBracket or ticker API call fails, the card shows a 'Data unavailable' message without crashing"
      ]
    }
  ],
  "constraints": [
    "All Binance data fetches must use public endpoints (no authentication required) except where credentials are already stored — use https://fapi.binance.com/fapi/v1/ticker/price, https://fapi.binance.com/fapi/v1/klines, and https://fapi.binance.com/fapi/v1/leverageBracket",
    "Do not modify files listed in frontend.immutablePaths",
    "Maintain the existing golden-themed design system — do not introduce new color tokens",
    "All API errors must be handled gracefully with fallback values or user-facing error messages; no uncaught exceptions that crash the UI"
  ],
  "nonGoals": [
    "Placing real orders or modifying live trading logic",
    "Changes to the Dashboard, AI Daily Trades, or AI Insights tabs",
    "Modifying backend Motoko code",
    "Adding new tabs or changing the tab navigation structure"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}