{
  "kind": "coverage_report",
  "version": "1.0",
  "generatedAt": "2026-02-25T03:52:22.522Z",
  "sources": {
    "buildRequest": true,
    "implementationPlan": true
  },
  "requirements": {
    "total": 5,
    "implemented": 5,
    "items": [
      {
        "id": "REQ-113",
        "summary": "On application load, check whether Binance credentials are present in localStorage (using hasCredentials() from binanceAuth.ts). If credentials are found, automatically trigger an import of the user's open positions from Binance USD-M Futures (via binancePositionService.ts / the existing getOpenPositions function) and merge them into the positions list managed by usePositionStorage, skipping any symbol already tracked. Display a non-blocking toast notification indicating how many positions were imported (e.g., 'Auto-imported 3 positions from Binance') or an error message if the import fails. This auto-import must run once per app session on mount, not on every re-render.",
        "status": "implemented",
        "plannedFiles": [
          "frontend/src/App.tsx"
        ],
        "matchedFiles": [
          "frontend/src/App.tsx"
        ]
      },
      {
        "id": "REQ-114",
        "summary": "Update the Settings onboarding flow so that when the user saves Binance credentials for the first time (in BinanceCredentialsPanel.tsx) and both the API key and secret are non-empty, immediately trigger an automatic position import from Binance after the credentials are saved — without requiring the user to navigate to the Dashboard tab and click 'Import from Binance'. After the import completes, show a toast (e.g., 'Credentials saved — imported N positions from Binance') and switch the active tab to 'Dashboard' so the user can see their positions right away.",
        "status": "implemented",
        "plannedFiles": [
          "frontend/src/components/BinanceCredentialsPanel.tsx",
          "frontend/src/App.tsx"
        ],
        "matchedFiles": [
          "frontend/src/components/BinanceCredentialsPanel.tsx",
          "frontend/src/App.tsx"
        ]
      },
      {
        "id": "REQ-115",
        "summary": "Add a periodic background sync that refreshes the position list from Binance every 60 seconds when credentials are present (hasCredentials() returns true) and Live Trading mode is ON (isLiveTradingEnabled() returns true). On each sync cycle, call getOpenPositions() and merge any new positions into usePositionStorage (skip existing symbols). Remove from the local list any position whose symbol no longer appears in the Binance response (i.e., it has been closed on the exchange). Do not show a toast on routine syncs — only show a toast if new positions are added or existing ones are removed.",
        "status": "implemented",
        "plannedFiles": [
          "frontend/src/App.tsx"
        ],
        "matchedFiles": [
          "frontend/src/App.tsx"
        ]
      },
      {
        "id": "REQ-116",
        "summary": "Update the Dashboard tab (DashboardTab.tsx) to display a prominent onboarding banner when no Binance credentials are configured (hasCredentials() returns false). The banner must clearly instruct the user to open Settings (gear icon) and enter their Binance API Key and Secret to get started. Include a direct 'Open Settings' button inside the banner that opens the SettingsDialog immediately. The banner must disappear as soon as credentials are saved, reactively responding to the 'credential-change' custom DOM event without requiring a page reload.",
        "status": "implemented",
        "plannedFiles": [
          "frontend/src/components/DashboardTab.tsx",
          "frontend/src/App.tsx"
        ],
        "matchedFiles": [
          "frontend/src/components/DashboardTab.tsx",
          "frontend/src/App.tsx"
        ]
      },
      {
        "id": "REQ-117",
        "summary": "Update the AI Daily Trades tab to automatically use the user's Binance account balance as the total capital value when credentials are present. On app load (or after credentials are saved), fetch the account's available balance from the Binance USD-M Futures account endpoint (https://fapi.binance.com/fapi/v2/account) using authenticatedFetch from binanceAuth.ts. Extract the totalWalletBalance field and, if the stored total_capital in localStorage is unset or zero, automatically set it via totalCapitalStorage to the fetched wallet balance. If the stored total_capital already has a user-defined value, do not overwrite it — only pre-fill when no value exists. Show a toast 'Total capital set from Binance account: $X' when auto-filled.",
        "status": "implemented",
        "plannedFiles": [
          "frontend/src/App.tsx",
          "frontend/src/utils/totalCapitalStorage.ts"
        ],
        "matchedFiles": [
          "frontend/src/App.tsx",
          "frontend/src/utils/totalCapitalStorage.ts"
        ]
      }
    ]
  },
  "changedFiles": [
    "build-request.json",
    "feature_evidence.json",
    "frontend-file-summaries.txt",
    "frontend-implementation-plan.json",
    "frontend/src/App.tsx",
    "frontend/src/components/BinanceCredentialsPanel.tsx",
    "frontend/src/components/DashboardTab.tsx",
    "frontend/src/utils/totalCapitalStorage.ts",
    "project_state.json",
    "scratch/component-selection.json",
    "spec.md",
    "spec_vs_diff_report.json"
  ]
}