{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Auto-load and use Binance credentials on app start for seamless credential-driven operation",
  "requirements": [
    {
      "id": "REQ-113",
      "summary": "Auto-import open positions from Binance on application load when credentials are present",
      "acceptanceCriteria": [
        "On app load, if hasCredentials() returns true, getOpenPositions() is called automatically without any user interaction.",
        "Positions returned from Binance are merged into usePositionStorage, skipping duplicates by symbol.",
        "A toast notification appears confirming the number of imported positions or showing an error.",
        "The auto-import runs only once per mount — not on every re-render or tab switch.",
        "If credentials are absent, no import attempt is made and no error is shown."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a useEffect hook that runs once on mount to check for credentials using hasCredentials() from binanceAuth.ts. If credentials exist, call getOpenPositions() from binancePositionService.ts and merge the returned positions into the positions list via the addPosition function from usePositionStorage, skipping any symbol that already exists in the current positions array. Display a toast notification showing the number of imported positions (e.g., 'Auto-imported 3 positions from Binance') or an error message if the API call fails. Use a useRef to track whether the auto-import has already run in this session to prevent duplicate executions on re-renders."
        }
      ]
    },
    {
      "id": "REQ-114",
      "summary": "Trigger automatic position import and switch to Dashboard tab when Binance credentials are saved for the first time in Settings",
      "acceptanceCriteria": [
        "After the user saves valid credentials in BinanceCredentialsPanel, an automatic position import is triggered immediately.",
        "A combined toast confirms credential save and import result.",
        "The active tab switches to 'Dashboard' after the import completes.",
        "If the import fails, credentials are still saved and an error toast is shown.",
        "The flow does not block the UI — all async steps are non-blocking with proper error handling."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BinanceCredentialsPanel.tsx",
          "operation": "modify",
          "description": "After successfully saving credentials in the handleSave function, add logic to immediately trigger an automatic position import by calling getOpenPositions() from binancePositionService.ts. Pass the newly saved credentials to the function. Once the import completes, show a combined toast notification (e.g., 'Credentials saved — imported N positions from Binance' or an error toast if the import fails). Emit a custom DOM event 'trigger-dashboard-switch' to signal that the active tab should switch to Dashboard. Wrap all async operations in try/catch blocks to ensure credentials are saved even if the import fails."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add an event listener for the custom 'trigger-dashboard-switch' DOM event. When this event is received, update the activeTab state to 'dashboard' to switch the visible tab. This listener should be attached in a useEffect hook and cleaned up on unmount. Ensure the positions list is already updated by the import before the tab switch occurs by coordinating the timing with the credential-change event that triggers a re-render of usePositionStorage."
        }
      ]
    },
    {
      "id": "REQ-115",
      "summary": "Add periodic 60-second background sync to refresh position list from Binance when credentials and Live Trading mode are active",
      "acceptanceCriteria": [
        "When credentials are present and Live Trading mode is ON, positions are synced from Binance every 60 seconds.",
        "New positions found in Binance that are not in the local list are added automatically.",
        "Positions closed on Binance (positionAmt = 0) are removed from the local list.",
        "No toast is shown for routine syncs with no changes.",
        "A toast is shown only when positions are added or removed.",
        "The sync loop stops when credentials are cleared or Live Trading mode is turned OFF."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a useEffect hook that sets up a 60-second interval to call getOpenPositions() from binancePositionService.ts when both hasCredentials() and isLiveTradingEnabled() return true. On each sync cycle, compare the returned Binance positions with the current local positions array. Add any new positions (by symbol) that are not already tracked. Remove any local positions whose symbol does not appear in the Binance response (indicating they were closed on the exchange). Track the number of positions added and removed. Show a toast notification only if changes occurred (e.g., 'Synced: +2 new, -1 closed'). Clear the interval when credentials are cleared, Live Trading mode is disabled, or the component unmounts. Listen to 'credential-change' and 'live-trading-change' custom DOM events to restart or stop the interval reactively."
        }
      ]
    },
    {
      "id": "REQ-116",
      "summary": "Display prominent onboarding banner in Dashboard tab when no Binance credentials are configured",
      "acceptanceCriteria": [
        "When no credentials are stored, a prominent onboarding banner is visible in the Dashboard tab.",
        "The banner contains an 'Open Settings' button that opens the SettingsDialog.",
        "The banner disappears immediately after credentials are saved, without a page reload.",
        "When credentials are present, the banner is not rendered.",
        "The banner uses the existing golden-themed card/alert design system."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DashboardTab.tsx",
          "operation": "modify",
          "description": "Add state to track whether credentials are present by calling hasCredentials() from binanceAuth.ts. Add a useEffect hook that listens for the 'credential-change' custom DOM event to update this state reactively. When credentials are not present, render a prominent onboarding banner card at the top of the Dashboard tab using the existing golden-themed Alert or Card component from shadcn/ui. The banner should clearly instruct the user to open Settings and enter their Binance API Key and Secret. Include an 'Open Settings' button inside the banner that triggers the openSettings callback passed as a prop from App.tsx (or emits a custom event to open the SettingsDialog). When credentials are saved, the banner should disappear immediately without requiring a page reload."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "If DashboardTab does not already receive a prop to open the SettingsDialog, add a callback prop (e.g., onOpenSettings) that sets the settings dialog open state to true. Pass this callback down to DashboardTab so the onboarding banner can trigger the SettingsDialog when the 'Open Settings' button is clicked."
        }
      ]
    },
    {
      "id": "REQ-117",
      "summary": "Auto-fill total capital from Binance account balance when credentials are present and total_capital is unset or zero",
      "acceptanceCriteria": [
        "On app load with credentials present, the Binance account balance is fetched from https://fapi.binance.com/fapi/v2/account.",
        "If total_capital in localStorage is unset or zero, it is auto-filled with totalWalletBalance from the Binance response.",
        "If total_capital already has a user-defined non-zero value, it is not overwritten.",
        "A toast confirms when total capital is auto-filled from Binance.",
        "If the fetch fails, the app continues normally with no error blocking the UI.",
        "The fetched balance is used as the base for AI daily trade investment amounts and risk calculations."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a useEffect hook that runs once on mount (or when credentials are saved) to check if credentials are present using hasCredentials() from binanceAuth.ts. If credentials exist, read the current total_capital value from localStorage via totalCapitalStorage.ts. If total_capital is unset, null, or zero, make an authenticated fetch to https://fapi.binance.com/fapi/v2/account using authenticatedFetch from binanceAuth.ts. Extract the totalWalletBalance field from the response and save it as the total_capital via totalCapitalStorage. Show a toast notification confirming the auto-fill (e.g., 'Total capital set from Binance account: $X'). If total_capital already has a non-zero value, skip the fetch and do not overwrite it. Wrap the fetch in a try/catch block to handle errors gracefully without blocking the UI. Use a useRef to ensure this logic runs only once per session."
        },
        {
          "path": "frontend/src/utils/totalCapitalStorage.ts",
          "operation": "modify",
          "description": "Add a helper function getTotalCapital() that reads the total_capital value from localStorage and returns it as a number (or 0 if unset/null). Export this function so it can be used in App.tsx to check whether the capital has already been set before attempting to auto-fill from Binance."
        }
      ]
    }
  ]
}