{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove PositionEntryForm from Dashboard, keep only Import from Binance",
  "requirements": [
    {
      "id": "REQ-93",
      "summary": "Remove the PositionEntryForm component from the Dashboard tab rendering, keeping only the Import from Binance button as the means to add positions",
      "acceptanceCriteria": [
        "The PositionEntryForm is no longer visible in the Dashboard tab under any circumstance.",
        "The 'Import from Binance' button remains present and functional in the Dashboard tab when credentials are configured.",
        "The PositionDashboard (active positions list with real-time PnL) and TotalCapitalSummary card remain fully visible and functional.",
        "No layout shifts or empty whitespace appear where the form previously existed.",
        "The PositionEntryForm component file (frontend/src/components/PositionEntryForm.tsx) is not deleted — only its usage in DashboardTab.tsx is removed.",
        "If no positions are present, the PositionDashboard empty state still prompts the user to import from Binance instead of adding manually."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DashboardTab.tsx",
          "operation": "modify",
          "description": "Remove the PositionEntryForm component import and its JSX rendering from the DashboardTab component. Remove any state or handlers specific to the form (e.g., handleAddPosition, any form-related state variables). Ensure TotalCapitalSummary, PositionDashboard, and the Binance import button remain fully rendered and functional. Verify the layout remains clean with no empty whitespace where the form previously existed."
        },
        {
          "path": "frontend/src/components/PositionDashboard.tsx",
          "operation": "modify",
          "description": "Update the empty state message in PositionDashboard to only reference importing from Binance (remove any mention of manually adding positions via a form). The empty state should guide users to use the Import from Binance button exclusively."
        }
      ]
    }
  ]
}