{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Live Trading Mode freeze and order execution failure",
  "requirements": [
    {
      "id": "REQ-64",
      "summary": "Fix Live Trading mode toggle to prevent application freeze and UI unresponsiveness when enabled",
      "acceptanceCriteria": [
        "Toggling Live Trading mode ON does not freeze, hang, or make the UI unresponsive.",
        "The application remains fully interactive after enabling Live Trading mode.",
        "If credential validation fails asynchronously, the error is caught and displayed as a toast/badge without locking the UI.",
        "No infinite re-render loop is triggered when live trading state changes in localStorage.",
        "The Live Trading amber banner appears correctly in the header after enabling without any UI lockup."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useLiveTradingMode.ts",
          "operation": "modify",
          "description": "Refactor the toggleLiveTrading function to ensure all async operations (credential validation, localStorage write, event dispatch) are non-blocking and properly awaited. Wrap credential validation in a try-catch block that displays errors via toast without blocking the UI thread. Ensure the useEffect hook that listens to localStorage changes has a proper dependency array to prevent infinite loops. Add debouncing to the window event listener registration if it fires state updates that trigger re-registration."
        },
        {
          "path": "frontend/src/components/LiveTradingToggle.tsx",
          "operation": "modify",
          "description": "Audit the confirmation dialog flow to ensure the toggle state change is deferred until after the user confirms and credential validation succeeds. Prevent synchronous blocking operations in the onChange handler by moving all async work (validation, storage write) into a separate async function. Add loading state during credential validation to prevent duplicate toggle attempts. Ensure the component does not trigger cascading re-renders when live trading state changes."
        },
        {
          "path": "frontend/src/components/LiveTradingBanner.tsx",
          "operation": "modify",
          "description": "Ensure the banner component listens to live trading state changes via a custom window event listener that is registered once on mount and cleaned up on unmount. Verify that showing/hiding the banner does not trigger layout shifts or z-index conflicts that could cause UI freezing. Add a React.memo wrapper if the component re-renders excessively when live trading state changes."
        },
        {
          "path": "frontend/src/utils/liveTradingStorage.ts",
          "operation": "modify",
          "description": "Audit the setLiveTradingEnabled and isLiveTradingReady functions to ensure they do not perform synchronous blocking operations. Add error boundaries around localStorage writes. Ensure the custom window event dispatch for live trading state changes does not trigger synchronous event handlers that could lock the UI. Add a small delay or microtask queue flush after setting storage to prevent immediate re-render cascades."
        },
        {
          "path": "frontend/src/components/SettingsDialog.tsx",
          "operation": "modify",
          "description": "Ensure the LiveTradingToggle component rendered inside the settings dialog does not cause the dialog portal to freeze when toggled. Verify that the dialog remains dismissible and interactive during live trading state changes. Add error boundaries around the toggle component to catch any unhandled promise rejections."
        }
      ]
    },
    {
      "id": "REQ-65",
      "summary": "Fix order execution flow to send real Binance Futures orders when Live Trading mode is ON",
      "acceptanceCriteria": [
        "When Live Trading mode is ON and credentials are valid, adding a manual position triggers a real MARKET order on Binance Futures followed by TAKE_PROFIT_MARKET and STOP_MARKET orders.",
        "When Live Trading mode is ON and an AI trade is generated, the corresponding entry and TP/SL orders are placed on Binance Futures.",
        "Each order call is wrapped in try/catch; a failure in one order (e.g., TP order) does not prevent the others from being attempted.",
        "A success toast is shown when orders are placed, and an error toast is shown with the Binance error message if an order fails.",
        "Order placement is fully asynchronous and does not block the UI thread."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/usePositionStorage.ts",
          "operation": "modify",
          "description": "Refactor the addPosition function to properly await all Binance order placement calls when live trading is enabled. Wrap each order call (market entry, TAKE_PROFIT_MARKET for each TP level, STOP_MARKET for SL) in an individual try-catch block so that a failure in one order does not abort the entire flow. Collect order results and display a success toast if all orders succeed, or a detailed error toast listing which orders failed with their Binance error messages. Ensure the order placement logic is fully async and does not block the React render cycle."
        },
        {
          "path": "frontend/src/hooks/useAITradeGeneration.ts",
          "operation": "modify",
          "description": "Audit the AI trade generation flow to ensure that when live trading is enabled and valid credentials exist, the generated trades trigger real Binance order placement via binanceOrderService. Wrap all order calls in try-catch blocks per-trade, logging errors and continuing to the next trade if one fails. Surface order success/failure to the user via toast notifications. Ensure the order placement is non-blocking and does not cause the AI trade generation query to hang or timeout."
        },
        {
          "path": "frontend/src/services/binanceOrderService.ts",
          "operation": "modify",
          "description": "Review all order placement functions (placeMarketOrder, placeTakeProfitOrder, placeStopLossOrder) to ensure they correctly target the Binance Futures API (https://fapi.binance.com/fapi/v1/order) with proper request signing and error handling. Add detailed error logging for failed orders, including the full Binance error response. Ensure all fetch calls are properly awaited and do not silently fail or return undefined. Add a timeout to prevent hanging network requests from blocking the UI."
        },
        {
          "path": "frontend/src/hooks/useAITradeMonitoring.ts",
          "operation": "modify",
          "description": "Ensure that the trade monitoring hook does not interfere with order placement during live trading. If the monitoring hook detects that an AI trade should be executed (e.g., price crosses entry), verify it triggers order placement via the same error-handled, non-blocking flow. Add logging to track when orders are placed versus when they are monitored."
        }
      ]
    },
    {
      "id": "REQ-66",
      "summary": "Audit and fix useEffect and React Query hooks to prevent infinite loops when live trading state changes",
      "acceptanceCriteria": [
        "No infinite re-render loops occur when live trading mode is toggled ON or OFF.",
        "Custom window event listeners for live trading state are added once and removed on component unmount.",
        "React Query hooks that depend on live trading state do not refetch in an infinite loop after the toggle.",
        "The application's frame rate and interactivity remain normal after toggling live trading mode multiple times in a session."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useLiveTradingMode.ts",
          "operation": "modify",
          "description": "Audit all useEffect hooks in this file to ensure their dependency arrays are correct and do not include state variables that change on every render. Ensure the custom window event listener for live trading state changes is registered exactly once (in a useEffect with an empty dependency array) and properly cleaned up on unmount. Remove any circular dependencies between state setters and useEffect hooks that could cause infinite loops."
        },
        {
          "path": "frontend/src/hooks/usePositionStorage.ts",
          "operation": "modify",
          "description": "Review all useEffect and React Query hooks that listen to live trading state. Ensure the dependency arrays do not include mutable references or functions that are recreated on every render. Wrap any callbacks that depend on live trading state in useCallback with a stable dependency array. Verify that enabling live trading does not trigger an infinite refetch loop in the position query."
        },
        {
          "path": "frontend/src/hooks/useAITradeGeneration.ts",
          "operation": "modify",
          "description": "Audit the React Query hook configuration (enabled, refetchOnWindowFocus, staleTime, etc.) to ensure that toggling live trading state does not cause the query to refetch in a loop. Ensure any useEffect hooks that listen to live trading state changes have stable dependencies and do not trigger cascading refetches. Add logging to track when the query runs and why it was triggered."
        },
        {
          "path": "frontend/src/hooks/useAITradeMonitoring.ts",
          "operation": "modify",
          "description": "Ensure the monitoring hook's polling interval and dependency array do not cause infinite re-renders when live trading state changes. Verify that the hook does not register duplicate window event listeners for live trading state. Add a cleanup function to remove any event listeners or timers on unmount."
        },
        {
          "path": "frontend/src/components/LiveTradingBanner.tsx",
          "operation": "modify",
          "description": "Ensure the custom window event listener for live trading state is registered once in a useEffect with an empty dependency array and removed on unmount. Verify that the event handler does not trigger state updates that cause the listener to be re-registered, creating an infinite loop. Add a flag to prevent multiple simultaneous event listener registrations."
        },
        {
          "path": "frontend/src/components/CredentialStatusIndicator.tsx",
          "operation": "modify",
          "description": "Audit the custom window event listener for credential changes to ensure it is registered once and cleaned up on unmount. Verify that the event handler does not trigger state updates that cause re-registration. Ensure the component does not re-render in a loop when credentials or live trading state changes."
        }
      ]
    }
  ]
}