{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Enhance Risk Management tab with real Binance asset data",
  "requirements": [
    {
      "id": "REQ-89",
      "summary": "Update PositionSizeCalculator to fetch and display live Binance price and leverage brackets for the selected asset",
      "acceptanceCriteria": [
        "PositionSizeCalculator fetches live price from Binance for the selected symbol and displays it as a reference alongside the entry price field",
        "The component fetches leverage bracket data from https://fapi.binance.com/fapi/v1/leverageBracket and shows the max leverage and maintenance margin rate for the selected symbol at the user-chosen leverage",
        "A warning is displayed if the selected leverage exceeds the maximum allowed leverage tier for the symbol",
        "If the Binance API call fails, the component gracefully falls back to manual input without breaking the UI"
      ],
      "file_operations": [
        {
          "path": "frontend/src/services/binanceApi.ts",
          "operation": "modify",
          "description": "Add two new public API fetch functions: fetchTickerPrice(symbol: string) to fetch live current price from https://fapi.binance.com/fapi/v1/ticker/price?symbol=SYMBOL, and fetchLeverageBracket(symbol: string) to fetch leverage tiers from https://fapi.binance.com/fapi/v1/leverageBracket?symbol=SYMBOL. Both functions should return typed responses and handle errors gracefully with try-catch."
        },
        {
          "path": "frontend/src/types/binanceApi.ts",
          "operation": "modify",
          "description": "Add TypeScript interface definitions for TickerPriceResponse (symbol: string, price: string) and LeverageBracketResponse (symbol: string, brackets: Array<{ bracket: number, initialLeverage: number, notionalCap: number, notionalFloor: number, maintMarginRatio: number, cum: number }>)."
        },
        {
          "path": "frontend/src/components/PositionSizeCalculator.tsx",
          "operation": "modify",
          "description": "Add state to track the selected symbol (from a dropdown or input). On symbol change, fetch live price via fetchTickerPrice and display it as a read-only reference field near the entry price input. Fetch leverage bracket data via fetchLeverageBracket and display the maximum allowed leverage for the symbol. If the user's chosen leverage exceeds the max allowed, display an amber warning badge. Add error boundaries to handle API failures gracefully, showing a fallback message without breaking the calculator UI."
        }
      ]
    },
    {
      "id": "REQ-90",
      "summary": "Update PortfolioExposureDashboard and usePortfolioExposure to enrich positions with live Binance prices and compute real-time metrics",
      "acceptanceCriteria": [
        "PortfolioExposureDashboard fetches live current prices for all tracked position symbols from Binance ticker API",
        "Real-time unrealized PnL is calculated and displayed per position using live prices",
        "Current exposure (quantity × live price) is shown alongside entry-price-based exposure",
        "Distance to estimated liquidation price is calculated and displayed for each position",
        "Prices refresh every 30 seconds without layout shifts",
        "If price fetch fails for a symbol, the component shows the last known value with a stale data indicator"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/usePortfolioExposure.ts",
          "operation": "modify",
          "description": "Add a React Query hook (or polling logic) that fetches live prices for all position symbols using fetchTickerPrice every 30 seconds. Merge the live prices into the positions array. Compute real-time unrealized PnL using (currentPrice - entryPrice) * quantity * leverage. Compute current exposure as quantity × currentPrice. For liquidation distance, use maintenance margin rate (from leverage bracket) to estimate liquidation price, then compute percentage distance from current price. Return these enriched metrics alongside existing exposure calculations."
        },
        {
          "path": "frontend/src/components/PortfolioExposureDashboard.tsx",
          "operation": "modify",
          "description": "Update the dashboard cards to display live-price-based metrics: real-time unrealized PnL per position, current exposure (quantity × live price), and distance to liquidation price as a percentage. Clearly label entry-price-based vs. current-price-based values. If a price fetch fails, show the last known value with a 'stale data' badge or icon. Ensure the UI does not shift layout when prices refresh every 30 seconds."
        }
      ]
    },
    {
      "id": "REQ-91",
      "summary": "Update ScenarioSimulator to use live Binance prices as baseline and add ATR-based volatility presets",
      "acceptanceCriteria": [
        "ScenarioSimulator fetches live current prices from Binance ticker API and uses them as the simulation baseline instead of entry prices",
        "ATR-based volatility presets (e.g., '1-day ATR', '3-day ATR') are fetched from recent kline data and displayed as additional preset scenario buttons",
        "The live price used as baseline is displayed clearly in the simulation results for each position",
        "Existing preset scenarios ('Market crash -20%', 'Bull run +30%', 'High volatility ±15%') continue to work unchanged",
        "If live price fetch fails, the simulator falls back to entry price with a visible warning message"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/scenarioSimulator.ts",
          "operation": "modify",
          "description": "Modify the simulation baseline logic to accept live current prices instead of entry prices. For each position, use the live price from fetchTickerPrice. Fetch recent kline data (e.g., 100 hourly candles) via fetchKlines and compute ATR (Average True Range). Generate dynamic preset buttons labeled '1-day ATR move' and '3-day ATR move' representing ±1 ATR and ±3 ATR percentage changes from the live baseline. If the live price fetch fails, fall back to entry price and include a fallback flag in the result."
        },
        {
          "path": "frontend/src/components/ScenarioSimulator.tsx",
          "operation": "modify",
          "description": "Fetch live prices for all position symbols on component mount and every 30 seconds. Pass the live prices as the simulation baseline to the scenarioSimulator utility. Render ATR-based preset buttons ('1-day ATR', '3-day ATR') alongside existing presets. Display the live price used as baseline in the simulation results panel for each position. If the live price fetch fails, show a warning message ('Using entry price as fallback') near the results."
        }
      ]
    },
    {
      "id": "REQ-92",
      "summary": "Add a 'Live Risk Metrics' summary card at the top of the Risk Management tab showing real-time liquidation risk",
      "acceptanceCriteria": [
        "A 'Live Risk Metrics' card is rendered at the top of the Risk Management tab",
        "Estimated liquidation price is computed per position using leverage bracket maintenance margin rates from Binance API",
        "Distance to liquidation is shown as a percentage using the live current price",
        "Color-coded badges indicate liquidation risk: green (>20%), amber (10–20%), red (<10%)",
        "A portfolio summary row shows how many positions fall into each risk level",
        "All metrics refresh every 30 seconds",
        "If the leverageBracket or ticker API call fails, the card shows a 'Data unavailable' message without crashing"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LiveRiskMetricsCard.tsx",
          "operation": "create",
          "description": "Create a new React component that fetches live prices via fetchTickerPrice and leverage bracket data via fetchLeverageBracket for all active positions every 30 seconds. For each position, compute estimated liquidation price using the formula: liquidationPrice = entryPrice × (1 ± (1 / leverage - maintMarginRatio)) (adjust sign for long/short). Compute distance to liquidation as ((currentPrice - liquidationPrice) / currentPrice) × 100. Display a color-coded badge: green if distance >20%, amber if 10–20%, red if <10%. Show a portfolio summary row aggregating the count of positions at each risk level. Handle API errors gracefully by showing 'Data unavailable' without crashing the UI."
        },
        {
          "path": "frontend/src/components/RiskManagementTab.tsx",
          "operation": "modify",
          "description": "Import and render the new LiveRiskMetricsCard component at the top of the Risk Management tab layout, above the existing PositionSizeCalculator, PortfolioExposureDashboard, and ScenarioSimulator components. Pass the active positions array as a prop to LiveRiskMetricsCard. Ensure the card is only displayed when positions exist, otherwise show the existing placeholder."
        }
      ]
    }
  ]
}