{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "AI Market Reversal Detection and Profit Protection",
  "requirements": [
    {
      "id": "REQ-53",
      "summary": "Implement market reversal detection algorithm that analyzes Binance kline data to identify trend reversals using momentum divergence, EMA crossovers, candlestick patterns, ATR volatility spikes, and support/resistance violations",
      "acceptanceCriteria": [
        "marketReversalDetector.ts exports a detectReversal function that fetches Binance kline data for the appropriate modality timeframe",
        "Function returns a ReversalSignal with detectedReversal, confidence (0–100), reason, recommendedAction, and optional suggestedNewSL",
        "RSI divergence, EMA crossover, candlestick patterns, ATR volatility spikes, and support/resistance violations are all evaluated",
        "recommendedAction is 'close' when reversal confidence > 75%, 'reverse' when > 85% and trade has accumulated profit (price past TP1), 'tighten_sl' when confidence is 50–75%, and 'none' otherwise",
        "The function is modality-aware: uses 1m/5m klines for Scalping, 15m/1h for Day Trading, 4h/1d for Swing Trading, 1d/1w for Trend Following"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/marketReversalDetector.ts",
          "operation": "create",
          "description": "Create the market reversal detection algorithm module. Export a detectReversal function that accepts AITrade parameters (symbol, position type, entry price, effective SL, current price, TP execution state) and returns a ReversalSignal object. The function must fetch appropriate Binance kline data based on the trade's modality (1m/5m for Scalping, 15m/1h for Day Trading, 4h/1d for Swing Trading, 1d/1w for Trend Following). Implement five core detection mechanisms: (1) RSI divergence detection comparing RSI trend to price action trend, (2) EMA crossover signals using short-term (9/21) and long-term (50/200) EMAs to detect reversals opposite to the trade direction, (3) candlestick pattern recognition for engulfing candles, shooting stars, and hammers, (4) ATR-based volatility spike detection indicating structural breaks, and (5) support/resistance zone violations using price clustering from technicalAnalysis.ts. Calculate a confidence score (0-100) by weighting each signal's strength. Return recommendedAction as 'close' when confidence > 75%, 'reverse' when confidence > 85% and tp1Executed is true, 'tighten_sl' when confidence is 50-75% with a suggestedNewSL price halfway between current price and entry, and 'none' otherwise. Reuse existing utilities from frontend/src/utils/technicalAnalysis.ts for ATR calculation and support/resistance detection, and implement new helper functions for RSI calculation, EMA calculation, and candlestick pattern recognition within this module."
        },
        {
          "path": "frontend/src/types/reversal.ts",
          "operation": "create",
          "description": "Create TypeScript type definitions for reversal detection. Export a ReversalSignal interface with fields: detectedReversal (boolean), confidence (number 0-100), reason (string), recommendedAction ('close' | 'reverse' | 'tighten_sl' | 'none'), and suggestedNewSL (optional number). Export helper types for individual signal components (RSIDivergence, EMACrossover, CandlestickPattern, VolatilitySpike, SupportResistanceViolation) if needed for internal use by the detector."
        }
      ]
    },
    {
      "id": "REQ-54",
      "summary": "Extend AITrade type to include reversal detection state fields for tracking reversal status, confidence, reason, action taken, and profit protection stop-loss",
      "acceptanceCriteria": [
        "frontend/src/types/aiTrade.ts includes all five new optional fields with TypeScript types",
        "Existing stored trades without these fields remain compatible (defaults apply via nullish coalescing)",
        "AITradeWithPrice interface also reflects these new fields"
      ],
      "file_operations": [
        {
          "path": "frontend/src/types/aiTrade.ts",
          "operation": "modify",
          "description": "Extend the AITrade interface to include five new optional fields: reversalDetected (boolean, default false), reversalConfidence (number 0-100, default 0), reversalReason (string, default empty string), reversalAction ('close' | 'reverse' | 'tighten_sl' | 'none', default 'none'), and profitProtectionSL (number, optional stop-loss price set by reversal protection logic). Mark all five fields as optional using the ? modifier to ensure backward compatibility with existing stored trades in localStorage. Also update the AITradeWithPrice interface to include these same optional fields so that enriched trades with current prices maintain type consistency."
        }
      ]
    },
    {
      "id": "REQ-55",
      "summary": "Integrate reversal detection into useAITradeMonitoring hook to automatically close, reverse, or tighten stop-loss on open AI trades based on detected market reversals",
      "acceptanceCriteria": [
        "useAITradeMonitoring polls detectReversal for every open AI trade on each price update cycle",
        "A 'close' action transitions the trade status to closed, records the outcome in AI trade history with a 'Closed by reversal detection' note, and triggers auto-regeneration",
        "A 'reverse' action (only when tp1Executed is true) closes the current trade with profit and enqueues a new opposite-direction trade for that modality",
        "A 'tighten_sl' action updates effectiveSL to the suggested new SL price and persists to localStorage",
        "Reversal fields (reversalDetected, reversalConfidence, reversalReason, reversalAction, profitProtectionSL) are saved to the trade in localStorage after detection",
        "No reversal action fires when recommendedAction is 'none'"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAITradeMonitoring.ts",
          "operation": "modify",
          "description": "Integrate market reversal detection into the price polling cycle. Import detectReversal from frontend/src/utils/marketReversalDetector.ts. On each price update cycle, for every trade with status 'Open', call detectReversal passing the trade's symbol, positionType, entryPrice, effectiveSL, current price, and TP execution state (tp1Executed, tp2Executed, tp3Executed). Based on the returned ReversalSignal: (1) If recommendedAction is 'close', set trade status to 'SL Hit', record the exit at current price in AI trade history via aiTradeHistoryStorage with outcome note 'Closed by reversal detection', trigger auto-regeneration for that modality, and update the stored trade. (2) If recommendedAction is 'reverse' AND tp1Executed is true, close the current trade at current price recording profit in history, then create a new trade object for the same modality with opposite positionType (Long -> Short or Short -> Long), same symbol, current price as entry, and enqueue it for the next generation cycle. (3) If recommendedAction is 'tighten_sl', update the trade's effectiveSL to suggestedNewSL, set profitProtectionSL to suggestedNewSL, and persist to localStorage. (4) If recommendedAction is 'none', do nothing. After any detection, update the trade's reversal fields (reversalDetected, reversalConfidence, reversalReason, reversalAction, profitProtectionSL) in localStorage using the useAITradeStorage hook's update function. Ensure reversal detection runs only once per trade per price cycle to avoid duplicate actions."
        }
      ]
    },
    {
      "id": "REQ-56",
      "summary": "Update AITradeCard component to visually display reversal detection state with amber warning banners, action badges, and profit protection SL display",
      "acceptanceCriteria": [
        "An amber/orange warning banner appears inside AITradeCard when reversalDetected is true",
        "The banner displays the reversalReason string and a badge for the action taken",
        "When reversalAction is 'tighten_sl', the profitProtectionSL price is shown with the label 'Profit Protection SL' near the effective SL row",
        "Trades closed by reversal detection show a 'Closed — Reversal Guard' status badge",
        "No new CSS color tokens are introduced; existing variables from index.css are reused",
        "Visual changes are consistent with the golden-themed card design"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AITradeCard.tsx",
          "operation": "modify",
          "description": "Add reversal detection visual indicators to the AITradeCard component. When trade.reversalDetected is true, render an amber/orange warning banner at the top of the card using existing CSS custom properties (--chart-warning or --accent colors from index.css). Display the reversalReason text in the banner along with a badge indicating the action taken: 'SL Tightened' for 'tighten_sl', 'Trade Closed' for 'close', or 'Direction Reversed' for 'reverse'. When reversalAction is 'tighten_sl' and profitProtectionSL exists, display the profitProtectionSL price in the stop-loss section with a label 'Profit Protection SL' alongside the effectiveSL price, using a smaller font size or secondary text style to differentiate it. For trades with status 'SL Hit' or 'TP Hit' that have reversalAction 'close', render a distinct status badge 'Closed — Reversal Guard' instead of or in addition to the normal closed status badge. Ensure all styling uses existing CSS variables from frontend/src/index.css (e.g., --chart-warning, --accent, --muted) and maintains consistency with the golden-themed card design. Do not introduce new color tokens or CSS classes outside of the existing design system."
        }
      ]
    },
    {
      "id": "REQ-57",
      "summary": "Add 'Reversal Guard' summary metric to AIDailyTradesSummary showing count of trades protected by reversal detection today",
      "acceptanceCriteria": [
        "AIDailyTradesSummary displays a 'Reversal Guards' count derived from AI trade history records where the outcome note includes 'Closed by reversal detection' or direction was reversed",
        "The stat is displayed in the summary banner alongside total PnL and win/loss counts",
        "The count resets to 0 at UTC day rollover consistent with the daily trade reset logic",
        "The metric is visible on both mobile and desktop layouts without breaking the existing summary layout"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AIDailyTradesSummary.tsx",
          "operation": "modify",
          "description": "Add a 'Reversal Guard' count metric to the AIDailyTradesSummary component. Import aiTradeHistoryStorage from frontend/src/utils/aiTradeHistoryStorage.ts to access stored AI trade history records. In the component, compute a reversalGuardCount by filtering the AI trade history for today's date (matching the existing UTC day logic used for daily trade reset) where the outcome note includes the string 'Closed by reversal detection' or where the reversalAction field equals 'close' or 'reverse'. Display this count in the summary banner as 'Reversal Guards: N' alongside the existing PnL summary, winning/losing trade counts, and live timestamp. Use a small stat format consistent with the existing summary metrics. Ensure the layout adapts to both mobile and desktop viewports without breaking the existing flexbox or grid layout, potentially stacking metrics vertically on mobile if needed. The count must reset to 0 at UTC day rollover, consistent with the existing daily trade reset behavior."
        }
      ]
    }
  ]
}