{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend canister with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including market sentiment analysis, trend prediction, automatic TP/SL adjustment suggestions, and position size calculator with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, hooks, utilities, and services for the AI-powered crypto trading assistant application.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH-based golden color system defining CSS custom properties for light and dark themes including primary, secondary, accent, and UI component colors.",
  "frontend/index.html": "HTML entry point with PWA manifest links, meta tags for mobile web app capabilities, theme colors, and Apple touch icons for progressive web app installation.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, display mode, theme colors, shortcuts, and categories for installable crypto position monitor application.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for static assets, network-first for API calls, offline fallback support, and cache management for PWA functionality.",
  "frontend/src/App.tsx": "Main application component with header, navigation, collapsible sections for position entry form, position size calculator, portfolio exposure dashboard, scenario simulator, and position monitoring dashboard.",
  "frontend/src/components/AdjustmentSuggestionCard.tsx": "Component displaying TP/SL adjustment suggestions with current vs. proposed levels, confidence badges, reasoning text, and accept/dismiss action buttons.",
  "frontend/src/components/ExposureChart.tsx": "Displays portfolio exposure metrics with two cards: Asset Allocation showing capital deployed per symbol with progress bars, and Long/Short Balance showing position counts and capital distribution with visual indicators.",
  "frontend/src/components/InstallButton.tsx": "PWA install button component that conditionally renders based on installability status and triggers the install prompt when clicked.",
  "frontend/src/components/PortfolioExposureDashboard.tsx": "Main dashboard displaying portfolio exposure metrics including capital deployed, leverage exposure, potential P&L, warning flags for high exposure/correlation/imbalance, and correlation risks with visual charts.",
  "frontend/src/components/PositionCard.tsx": "Card component for individual trading positions showing P&L, distance to TP/SL, sentiment gauge, trend predictions, AI adjustment suggestions with accept/dismiss actions, and delete functionality with visual indicators for near-target states.",
  "frontend/src/components/PositionDashboard.tsx": "Container component that displays all active positions using PositionCard components, handles real-time price monitoring, shows empty state when no positions exist, and provides add/update/delete position actions.",
  "frontend/src/components/PositionEntryForm.tsx": "Form component for creating new trading positions with inputs for symbol selection (searchable Binance pairs), position type (long/short), leverage slider, entry price, and investment amount; automatically calculates TP/SL levels using historical data and technical analysis.",
  "frontend/src/components/PositionSizeCalculator.tsx": "React component that calculates optimal position size based on capital, risk percentage, entry/stop-loss prices, and leverage. Includes a slider UI for risk adjustment and an apply button to pass results to parent components.",
  "frontend/src/components/ScenarioSimulator.tsx": "React component that simulates portfolio outcomes under different price change scenarios using preset buttons and a custom slider. Displays total impact, liquidation risks, and per-position outcomes.",
  "frontend/src/components/SentimentGauge.tsx": "React component that fetches and displays market sentiment analysis for a symbol, showing bullish/bearish score, strength percentage, and contributing factors with visual indicators.",
  "frontend/src/components/StopLossRecommendations.tsx": "React component that displays stop-loss recommendations including price, distance from current price, max loss, capital risk percentage, reasoning, and partial taking strategy with visual alerts for near-SL conditions.",
  "frontend/src/components/TakeProfitRecommendations.tsx": "React component that renders multiple take-profit levels with target prices, profit calculations, distance from current price, and reasoning. Highlights reached targets and shows visual indicators for long/short positions.",
  "frontend/src/components/TrendPredictionCard.tsx": "React component that fetches and displays AI-powered trend predictions for a symbol, showing short-term and medium-term directional forecasts with confidence levels and visual direction indicators.",
  "frontend/src/hooks/useActor.ts": "Manages Internet Identity authentication and creates backend actors with proper identity configuration, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAdjustmentSuggestions.ts": "Fetches Binance price data and generates adjustment suggestions for position take-profit and stop-loss levels, refreshing every 30 seconds.",
  "frontend/src/hooks/useBinancePairs.ts": "Queries and caches the list of perpetual trading pairs from Binance with a 1-hour stale time.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity persistence, and status tracking for the entire application.",
  "frontend/src/hooks/usePortfolioExposure.ts": "Calculates and memoizes portfolio exposure metrics including capital deployment, leverage, and correlation risks from position data.",
  "frontend/src/hooks/usePositionMonitoring.ts": "Monitors positions by fetching current prices from Binance every 5 seconds and calculating real-time PnL and distances to take-profit/stop-loss levels.",
  "frontend/src/hooks/usePositionStorage.ts": "Manages position data persistence in localStorage with CRUD operations for adding, updating, and deleting positions.",
  "frontend/src/hooks/usePWAInstall.ts": "Manages Progressive Web App installation prompts and tracks installation state using the beforeinstallprompt event.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating backend operations are handled through direct Binance API calls rather than the backend canister.",
  "frontend/src/hooks/useSentimentAnalysis.ts": "Fetches 1-hour kline data from Binance and analyzes market sentiment based on price and volume patterns, refreshing every 30 seconds.",
  "frontend/src/hooks/useTrendPrediction.ts": "Predicts short-term and medium-term price trends using hourly and daily kline data from Binance, refreshing every 5 minutes.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with a golden-themed color palette for light/dark modes, including custom utilities for animations and PWA styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/services/binanceApi.ts": "Provides API functions to fetch perpetual trading pairs, current prices, and kline data from Binance Futures endpoints.",
  "frontend/src/types/adjustment.ts": "Defines types for position adjustment suggestions including take-profit/stop-loss recommendations with confidence scores and action history.",
  "frontend/src/types/calculator.ts": "Defines types for position size calculator inputs and results including capital, risk percentage, and risk-reward calculations.",
  "frontend/src/types/exposure.ts": "Defines types for portfolio exposure analysis including asset allocation, long/short balance, correlation risks, and warning flags.",
  "frontend/src/types/position.ts": "Defines core position types including entry details, take-profit levels, stop-loss recommendations, and real-time price/PnL data.",
  "frontend/src/types/prediction.ts": "Defines types for trend predictions including direction (up/down/sideways), confidence, time horizon, and prediction history with actual outcomes.",
  "frontend/src/types/scenario.ts": "Defines types for scenario analysis including inputs, position outcomes with simulated prices and P&L, and preset scenarios for portfolio stress testing.",
  "frontend/src/types/sentiment.ts": "Defines types for market sentiment analysis including sentiment scores (bullish/bearish/neutral), strength metrics, and contributing factors with their impacts.",
  "frontend/src/utils/adjustmentSuggestions.ts": "Generates position adjustment suggestions based on market conditions (volatility, ATR, support/resistance) by analyzing price data and recommending stop-loss or take-profit modifications.",
  "frontend/src/utils/exposureCalculations.ts": "Calculates portfolio-wide exposure metrics including capital deployed, leverage exposure, long/short balance, asset distribution, and correlation risks between positions.",
  "frontend/src/utils/pnlCalculations.ts": "Provides utility functions to calculate profit/loss in USD and percentage for long/short positions based on entry price, current price, investment amount, and leverage.",
  "frontend/src/utils/positionSizeCalculator.ts": "Calculates optimal position size based on capital, risk percentage, stop-loss distance, and leverage, returning position size, contracts, risk/reward amounts and ratio.",
  "frontend/src/utils/registerServiceWorker.ts": "Registers and manages the service worker for PWA functionality, handles updates, and checks for new versions hourly with optional user notification.",
  "frontend/src/utils/scenarioSimulator.ts": "Simulates portfolio performance under various market scenarios (crash, rally, volatility) by calculating projected P&L, checking TP/SL hits, and assessing liquidation risks.",
  "frontend/src/utils/sentimentAnalysis.ts": "Analyzes market sentiment using technical indicators (RSI, MACD, volume trends, price action, momentum) and generates bullish/bearish/neutral sentiment scores with contributing factors.",
  "frontend/src/utils/stopLossCalculator.ts": "Calculates recommended stop-loss levels using ATR, support/resistance levels, and leverage-adjusted risk parameters, providing loss estimates and partial profit-taking strategies.",
  "frontend/src/utils/takeProfitCalculator.ts": "Calculates three take-profit levels (TP1, TP2, TP3) for trading positions using technical analysis including support/resistance levels, volatility, and leverage adjustments, with reasoning for each target price.",
  "frontend/src/utils/technicalAnalysis.ts": "Provides technical analysis utilities including ATR calculation, volatility measurement, support/resistance level detection through price clustering, and risk-reward ratio computation.",
  "frontend/src/utils/trendPrediction.ts": "Predicts short-term (1-24 hours) and medium-term (1-7 days) price trends using moving averages, momentum, and volatility indicators, returning direction and confidence scores.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended animations, border radius variables, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing a crypto trading monitoring app with manual position entry, AI-powered TP/SL recommendations, real-time Binance API integration, technical analysis algorithms, and PWA capabilities."
}